[13329]() NASL> [0x56214ab8a4c0 <- 1
[13329]() NASL> [0x56214ab868a0 <- 0
[13329]() NASL> [0x56214ab8b550 <- 6
[13329]() NASL> [0x56214ab8b5b0 <- 17
[13329]() NASL> [0x56214ab8b610 <- 1
[13329]() NASL> [0x56214ab8b670 <- 0
[13329]() NASL> [0x56214ab8b6d0 <- 2
[13329]() NASL> [0x56214ab8b730 <- 0
[13329]() NASL> [0x56214ab8b790 <- 1
[13329]() NASL> [0x56214ab8b7f0 <- 2
[13329]() NASL> [0x56214ab8b850 <- 3
[13329]() NASL> [0x56214ab8b8b0 <- 4
[13329]() NASL> [0x56214ab8b910 <- 5
[13329]() NASL> [0x56214ab8b970 <- 6
[13329]() NASL> [0x56214ab8b9d0 <- 7
[13329]() NASL> [0x56214ab8ba30 <- 9
[13329]() NASL> [0x56214ab8ba90 <- 10
[13329]() NASL> [0x56214ab8baf0 <- 1
[13329]() NASL> [0x56214ab8bb50 <- 2
[13329]() NASL> [0x56214ab8bbb0 <- 4
[13329]() NASL> [0x56214ab8bc10 <- 8
[13329]() NASL> [0x56214ab8bc70 <- 16
[13329]() NASL> [0x56214ab8bcd0 <- 32
[13329]() NASL> [0x56214ab8bd30 <- 32768
[13329]() NASL> [0x56214ab8bd90 <- 16384
[13329]() NASL> [0x56214ab8bdf0 <- 8192
[13329]() NASL> [0x56214ab8be50 <- 8191
[13329]() NASL> [0x56214ab8beb0 <- 0
[13329]() NASL> [0x56214ab8bf10 <- 3
[13329]() NASL> [0x56214ab8bf70 <- 4
[13329]() NASL> [0x56214ab8bfd0 <- 5
[13329]() NASL> [0x56214ab8c030 <- 6
[13329]() NASL> [0x56214ab8c090 <- 7
[13329]() NASL> [0x56214ab8c0f0 <- 1
[13329]() NASL> [0x56214ab8c150 <- 2
[13329]() NASL> [0x56214ab8c1b0 <- 8
[13329]() NASL> [0x56214ab8c210 <- 9
[13329]() NASL> [0x56214ab8c270 <- 10
[13329]() NASL> [0x56214ab8c2d0 <- 1
[13329]() NASL> [0x56214ab8c330 <- 0
[13329]() NASL> [0x56214ab8c390 <- 1
[13329]() NASL> [0x56214ab8c3f0 <- 2
[13329]() NASL> [0x56214ab8c450 <- 3
[13329]() NASL> [0x56214ab8c4b0 <- 99
[13329]() NASL> [0x56214ab8c510 <- "1.1.0.0"
[13329]() NASL> [0x56214ab8c5f0 <- 1
[13329]() NASL> [0x56214ab8c650 <- 0
[13329]() NASL> [0x56214ab8c6b0 <- "secpod_apache_detect.nasl"
NASL:0052> if (description) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8c650 -> 0
NASL:0033> global_var ...
NASL:0034> _http_ua_include_oid=FALSE;
[13329]() NASL> [0x56214ab8c7c0 <- 0
NASL:0037> global_var ...
NASL:0040> global_var ...
NASL:0041> _http_debug=FALSE;
[13329]() NASL> [0x56214ab8c970 <- 0
NASL:0044> global_var ...
NASL:0045> optimize_test_enabled=get_preference(...);
NASL:0045> get_preference(...)
[13329]() NASL> [0x56214ab8cc00 <- 1
[13329]() NASL> [0x56214ab8cc60 <- 0
[13329]() NASL> [0x56214ab8ccc0 <- 6
[13329]() NASL> [0x56214ab8cd20 <- 17
[13329]() NASL> [0x56214ab8cd80 <- 1
[13329]() NASL> [0x56214ab8cde0 <- 0
[13329]() NASL> [0x56214ab8ce40 <- 2
[13329]() NASL> [0x56214ab8cea0 <- 0
[13329]() NASL> [0x56214ab8cf00 <- 1
[13329]() NASL> [0x56214ab8cf60 <- 2
[13329]() NASL> [0x56214ab8cfc0 <- 3
[13329]() NASL> [0x56214ab8d020 <- 4
[13329]() NASL> [0x56214ab8d080 <- 5
[13329]() NASL> [0x56214ab8d0e0 <- 6
[13329]() NASL> [0x56214ab8d140 <- 7
[13329]() NASL> [0x56214ab8d1a0 <- 9
[13329]() NASL> [0x56214ab8d200 <- 10
[13329]() NASL> [0x56214ab8d260 <- 1
[13329]() NASL> [0x56214ab8d2c0 <- 2
[13329]() NASL> [0x56214ab8d320 <- 4
[13329]() NASL> [0x56214ab8d380 <- 8
[13329]() NASL> [0x56214ab8d3e0 <- 16
[13329]() NASL> [0x56214ab8d440 <- 32
[13329]() NASL> [0x56214ab8d4a0 <- 32768
[13329]() NASL> [0x56214ab8d500 <- 16384
[13329]() NASL> [0x56214ab8d560 <- 8192
[13329]() NASL> [0x56214ab8d5c0 <- 8191
[13329]() NASL> [0x56214ab8d620 <- 0
[13329]() NASL> [0x56214ab8d680 <- 3
[13329]() NASL> [0x56214ab8d6e0 <- 4
[13329]() NASL> [0x56214ab8d740 <- 5
[13329]() NASL> [0x56214ab8d7a0 <- 6
[13329]() NASL> [0x56214ab8d800 <- 7
[13329]() NASL> [0x56214ab8d860 <- 1
[13329]() NASL> [0x56214ab8d8c0 <- 2
[13329]() NASL> [0x56214ab8d920 <- 8
[13329]() NASL> [0x56214ab8d980 <- 9
[13329]() NASL> [0x56214ab8d9e0 <- 10
[13329]() NASL> [0x56214ab8da40 <- 1
[13329]() NASL> [0x56214ab8daa0 <- 0
[13329]() NASL> [0x56214ab8db00 <- 1
[13329]() NASL> [0x56214ab8db60 <- 2
[13329]() NASL> [0x56214ab8dbc0 <- 3
[13329]() NASL> [0x56214ab8dc20 <- 99
[13329]() NASL> [0x56214ab8dc80 <- "1.1.0.0"
[13329]() NASL> [0x56214ab8de90 <- "optimize_test"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_preference(1: "optimize_test")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_preference: "yes"
[13329]() NASL> [0x56214ab8ca10 <- "yes"
NASL:0048> global_var ...
NASL:0051> _http_is_broken_array=make_array(...);
NASL:0051> make_array(...)
[13329]() NASL> [0x56214ab8daa0 <- 1
[13329]() NASL> [0x56214ab8d500 <- 0
[13329]() NASL> [0x56214ab8d260 <- 6
[13329]() NASL> [0x56214ab8cf00 <- 17
[13329]() NASL> [0x56214ab8cd20 <- 1
[13329]() NASL> [0x56214ab8d200 <- 0
[13329]() NASL> [0x56214ab8cea0 <- 2
[13329]() NASL> [0x56214ab8ce40 <- 0
[13329]() NASL> [0x56214ab8cc60 <- 1
[13329]() NASL> [0x56214ab8d740 <- 2
[13329]() NASL> [0x56214ab8cd80 <- 3
[13329]() NASL> [0x56214ab8d5c0 <- 4
[13329]() NASL> [0x56214ab8cc00 <- 5
[13329]() NASL> [0x56214ab8ccc0 <- 6
[13329]() NASL> [0x56214ab8da40 <- 7
[13329]() NASL> [0x56214ab8d8c0 <- 9
[13329]() NASL> [0x56214ab8d620 <- 10
[13329]() NASL> [0x56214ab8d9e0 <- 1
[13329]() NASL> [0x56214ab8d4a0 <- 2
[13329]() NASL> [0x56214ab8dd00 <- 4
[13329]() NASL> [0x56214ab8dc80 <- 8
[13329]() NASL> [0x56214ab8db00 <- 16
[13329]() NASL> [0x56214ab8d980 <- 32
[13329]() NASL> [0x56214ab8d1a0 <- 32768
[13329]() NASL> [0x56214ab8d080 <- 16384
[13329]() NASL> [0x56214ab8d2c0 <- 8192
[13329]() NASL> [0x56214ab8d860 <- 8191
[13329]() NASL> [0x56214ab8d920 <- 0
[13329]() NASL> [0x56214ab8d680 <- 3
[13329]() NASL> [0x56214ab8d140 <- 4
[13329]() NASL> [0x56214ab8d440 <- 5
[13329]() NASL> [0x56214ab8d0e0 <- 6
[13329]() NASL> [0x56214ab8d560 <- 7
[13329]() NASL> [0x56214ab8d320 <- 1
[13329]() NASL> [0x56214ab8d7a0 <- 2
[13329]() NASL> [0x56214ab8d3e0 <- 8
[13329]() NASL> [0x56214ab8d020 <- 9
[13329]() NASL> [0x56214ab8cde0 <- 10
[13329]() NASL> [0x56214ab8d800 <- 1
[13329]() NASL> [0x56214ab8d6e0 <- 0
[13329]() NASL> [0x56214ab8d380 <- 1
[13329]() NASL> [0x56214ab8cfc0 <- 2
[13329]() NASL> [0x56214ab8cf60 <- 3
[13329]() NASL> [0x56214ab8e080 <- 99
[13329]() NASL> [0x56214ab8e0c0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call make_array()
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return make_array: ???? (DYN_ARRAY (64))
[13329]() NASL> [0x56214ab8df00 <- (VAR2_ARRAY)
NASL:0054> _http_no404_string_array=make_array(...);
NASL:0054> make_array(...)
[13329]() NASL> [0x56214ab8dc20 <- 1
[13329]() NASL> [0x56214ab8cf60 <- 0
[13329]() NASL> [0x56214ab8cfc0 <- 6
[13329]() NASL> [0x56214ab8e080 <- 17
[13329]() NASL> [0x56214ab8d6e0 <- 1
[13329]() NASL> [0x56214ab8d080 <- 0
[13329]() NASL> [0x56214ab8d9e0 <- 2
[13329]() NASL> [0x56214ab8cc60 <- 0
[13329]() NASL> [0x56214ab8cf00 <- 1
[13329]() NASL> [0x56214ab8d620 <- 2
[13329]() NASL> [0x56214ab8ce40 <- 3
[13329]() NASL> [0x56214ab8cea0 <- 4
[13329]() NASL> [0x56214ab8d500 <- 5
[13329]() NASL> [0x56214ab8d440 <- 6
[13329]() NASL> [0x56214ab8cd20 <- 7
[13329]() NASL> [0x56214ab8d860 <- 9
[13329]() NASL> [0x56214ab8daa0 <- 10
[13329]() NASL> [0x56214ab8d260 <- 1
[13329]() NASL> [0x56214ab8d800 <- 2
[13329]() NASL> [0x56214ab8d7a0 <- 4
[13329]() NASL> [0x56214ab8d920 <- 8
[13329]() NASL> [0x56214ab8cde0 <- 16
[13329]() NASL> [0x56214ab8d1a0 <- 32
[13329]() NASL> [0x56214ab8e100 <- 32768
[13329]() NASL> [0x56214ab8e0c0 <- 16384
[13329]() NASL> [0x56214ab8d380 <- 8192
[13329]() NASL> [0x56214ab8d020 <- 8191
[13329]() NASL> [0x56214ab8d8c0 <- 0
[13329]() NASL> [0x56214ab8cc00 <- 3
[13329]() NASL> [0x56214ab8d4a0 <- 4
[13329]() NASL> [0x56214ab8d320 <- 5
[13329]() NASL> [0x56214ab8d3e0 <- 6
[13329]() NASL> [0x56214ab8d680 <- 7
[13329]() NASL> [0x56214ab8da40 <- 1
[13329]() NASL> [0x56214ab8d980 <- 2
[13329]() NASL> [0x56214ab8ccc0 <- 8
[13329]() NASL> [0x56214ab8d2c0 <- 9
[13329]() NASL> [0x56214ab8dd00 <- 10
[13329]() NASL> [0x56214ab8d0e0 <- 1
[13329]() NASL> [0x56214ab8db00 <- 0
[13329]() NASL> [0x56214ab8d5c0 <- 1
[13329]() NASL> [0x56214ab8d200 <- 2
[13329]() NASL> [0x56214ab8d560 <- 3
[13329]() NASL> [0x56214ab8d140 <- 99
[13329]() NASL> [0x56214ab8dc80 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call make_array()
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return make_array: ???? (DYN_ARRAY (64))
[13329]() NASL> [0x56214ab8ca70 <- (VAR2_ARRAY)
NASL:0057> _http_has_generic_xss_array=make_array(...);
NASL:0057> make_array(...)
[13329]() NASL> [0x56214ab8e250 <- 1
[13329]() NASL> [0x56214ab8d560 <- 0
[13329]() NASL> [0x56214ab8d200 <- 6
[13329]() NASL> [0x56214ab8d140 <- 17
[13329]() NASL> [0x56214ab8db00 <- 1
[13329]() NASL> [0x56214ab8e0c0 <- 0
[13329]() NASL> [0x56214ab8d260 <- 2
[13329]() NASL> [0x56214ab8cf00 <- 0
[13329]() NASL> [0x56214ab8e080 <- 1
[13329]() NASL> [0x56214ab8daa0 <- 2
[13329]() NASL> [0x56214ab8cc60 <- 3
[13329]() NASL> [0x56214ab8d9e0 <- 4
[13329]() NASL> [0x56214ab8cf60 <- 5
[13329]() NASL> [0x56214ab8d320 <- 6
[13329]() NASL> [0x56214ab8d6e0 <- 7
[13329]() NASL> [0x56214ab8d020 <- 9
[13329]() NASL> [0x56214ab8dc20 <- 10
[13329]() NASL> [0x56214ab8cfc0 <- 1
[13329]() NASL> [0x56214ab8d0e0 <- 2
[13329]() NASL> [0x56214ab8d980 <- 4
[13329]() NASL> [0x56214ab8d8c0 <- 8
[13329]() NASL> [0x56214ab8dd00 <- 16
[13329]() NASL> [0x56214ab8e100 <- 32
[13329]() NASL> [0x56214ab8cd80 <- 32768
[13329]() NASL> [0x56214ab8dc80 <- 16384
[13329]() NASL> [0x56214ab8d5c0 <- 8192
[13329]() NASL> [0x56214ab8d2c0 <- 8191
[13329]() NASL> [0x56214ab8d860 <- 0
[13329]() NASL> [0x56214ab8d500 <- 3
[13329]() NASL> [0x56214ab8d800 <- 4
[13329]() NASL> [0x56214ab8da40 <- 5
[13329]() NASL> [0x56214ab8ccc0 <- 6
[13329]() NASL> [0x56214ab8cc00 <- 7
[13329]() NASL> [0x56214ab8cd20 <- 1
[13329]() NASL> [0x56214ab8d1a0 <- 2
[13329]() NASL> [0x56214ab8d440 <- 8
[13329]() NASL> [0x56214ab8d380 <- 9
[13329]() NASL> [0x56214ab8d7a0 <- 10
[13329]() NASL> [0x56214ab8d3e0 <- 1
[13329]() NASL> [0x56214ab8cde0 <- 0
[13329]() NASL> [0x56214ab8cea0 <- 1
[13329]() NASL> [0x56214ab8d080 <- 2
[13329]() NASL> [0x56214ab8d680 <- 3
[13329]() NASL> [0x56214ab8d4a0 <- 99
[13329]() NASL> [0x56214ab8d920 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call make_array()
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return make_array: ???? (DYN_ARRAY (64))
[13329]() NASL> [0x56214ab8dbc0 <- (VAR2_ARRAY)
NASL:0060> _http_is_embedded_array=make_array(...);
NASL:0060> make_array(...)
[13329]() NASL> [0x56214ab8d740 <- 1
[13329]() NASL> [0x56214ab8d680 <- 0
[13329]() NASL> [0x56214ab8d080 <- 6
[13329]() NASL> [0x56214ab8d4a0 <- 17
[13329]() NASL> [0x56214ab8cde0 <- 1
[13329]() NASL> [0x56214ab8dc80 <- 0
[13329]() NASL> [0x56214ab8cfc0 <- 2
[13329]() NASL> [0x56214ab8e080 <- 0
[13329]() NASL> [0x56214ab8d140 <- 1
[13329]() NASL> [0x56214ab8dc20 <- 2
[13329]() NASL> [0x56214ab8cf00 <- 3
[13329]() NASL> [0x56214ab8d260 <- 4
[13329]() NASL> [0x56214ab8d560 <- 5
[13329]() NASL> [0x56214ab8da40 <- 6
[13329]() NASL> [0x56214ab8db00 <- 7
[13329]() NASL> [0x56214ab8d2c0 <- 9
[13329]() NASL> [0x56214ab8e250 <- 10
[13329]() NASL> [0x56214ab8d200 <- 1
[13329]() NASL> [0x56214ab8d3e0 <- 2
[13329]() NASL> [0x56214ab8d1a0 <- 4
[13329]() NASL> [0x56214ab8d860 <- 8
[13329]() NASL> [0x56214ab8d7a0 <- 16
[13329]() NASL> [0x56214ab8cd80 <- 32
[13329]() NASL> [0x56214ab8ce40 <- 32768
[13329]() NASL> [0x56214ab8d920 <- 16384
[13329]() NASL> [0x56214ab8cea0 <- 8192
[13329]() NASL> [0x56214ab8d380 <- 8191
[13329]() NASL> [0x56214ab8d020 <- 0
[13329]() NASL> [0x56214ab8cf60 <- 3
[13329]() NASL> [0x56214ab8d0e0 <- 4
[13329]() NASL> [0x56214ab8cd20 <- 5
[13329]() NASL> [0x56214ab8d440 <- 6
[13329]() NASL> [0x56214ab8d500 <- 7
[13329]() NASL> [0x56214ab8d6e0 <- 1
[13329]() NASL> [0x56214ab8e100 <- 2
[13329]() NASL> [0x56214ab8d320 <- 8
[13329]() NASL> [0x56214ab8d5c0 <- 9
[13329]() NASL> [0x56214ab8d980 <- 10
[13329]() NASL> [0x56214ab8ccc0 <- 1
[13329]() NASL> [0x56214ab8dd00 <- 0
[13329]() NASL> [0x56214ab8d9e0 <- 1
[13329]() NASL> [0x56214ab8e0c0 <- 2
[13329]() NASL> [0x56214ab8cc00 <- 3
[13329]() NASL> [0x56214ab8d800 <- 99
[13329]() NASL> [0x56214ab8d8c0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call make_array()
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return make_array: ???? (DYN_ARRAY (64))
[13329]() NASL> [0x56214ab8db60 <- (VAR2_ARRAY)
NASL:0033> global_var ...
NASL:0035> __ka_socket=0;
[13329]() NASL> [0x56214ab8daa0 <- 0
NASL:0036> __ka_port=0;
[13329]() NASL> [0x56214ab8d620 <- 0
NASL:0037> __ka_enabled= - (1);
[13329]() NASL> [0x56214ab8cc00 <- -1
NASL:0038> __ka_last_request="";
[13329]() NASL> [0x56214ab8e0c0 <- ""
NASL:0041> global_var ...
NASL:0042> _http_ka_debug=FALSE;
[13329]() NASL> [0x56214ab8dd00 <- 0
NASL:0046> global_var ...
NASL:0047> _http_ua_include_oid=FALSE;
[13329]() NASL> [0x56214ab8c7c0 <- 0
NASL:0050> global_var ...
NASL:0051> optimize_test_enabled=get_preference(...);
NASL:0051> get_preference(...)
[13329]() NASL> [0x56214ab8d920 <- 1
[13329]() NASL> [0x56214ab8d200 <- 0
[13329]() NASL> [0x56214ab8d140 <- 6
[13329]() NASL> [0x56214ab8d4a0 <- 17
[13329]() NASL> [0x56214ab8e250 <- 1
[13329]() NASL> [0x56214ab8e080 <- 0
[13329]() NASL> [0x56214ab8cfc0 <- 2
[13329]() NASL> [0x56214ab8d680 <- 0
[13329]() NASL> [0x56214ab8cd20 <- 1
[13329]() NASL> [0x56214ab8cde0 <- 2
[13329]() NASL> [0x56214ab8d380 <- 3
[13329]() NASL> [0x56214ab8d740 <- 4
[13329]() NASL> [0x56214ab8d080 <- 5
[13329]() NASL> [0x56214ab8ccc0 <- 6
[13329]() NASL> [0x56214ab8e100 <- 7
[13329]() NASL> [0x56214ab8d020 <- 9
[13329]() NASL> [0x56214ab8d980 <- 10
[13329]() NASL> [0x56214ab8ce40 <- 1
[13329]() NASL> [0x56214ab8cc60 <- 2
[13329]() NASL> [0x56214ab8d8c0 <- 4
[13329]() NASL> [0x56214ab8d9e0 <- 8
[13329]() NASL> [0x56214ab8d5c0 <- 16
[13329]() NASL> [0x56214ab8d2c0 <- 32
[13329]() NASL> [0x56214ab8d560 <- 32768
[13329]() NASL> [0x56214ab8d3e0 <- 16384
[13329]() NASL> [0x56214ab8d6e0 <- 8192
[13329]() NASL> [0x56214ab8d320 <- 8191
[13329]() NASL> [0x56214ab8cf60 <- 0
[13329]() NASL> [0x56214ab8db00 <- 3
[13329]() NASL> [0x56214ab8cd80 <- 4
[13329]() NASL> [0x56214ab8da40 <- 5
[13329]() NASL> [0x56214ab8cea0 <- 6
[13329]() NASL> [0x56214ab8d1a0 <- 7
[13329]() NASL> [0x56214ab8d440 <- 1
[13329]() NASL> [0x56214ab8d7a0 <- 2
[13329]() NASL> [0x56214ab8d260 <- 8
[13329]() NASL> [0x56214ab8dc80 <- 9
[13329]() NASL> [0x56214ab8d500 <- 10
[13329]() NASL> [0x56214ab8d0e0 <- 1
[13329]() NASL> [0x56214ab8d860 <- 0
[13329]() NASL> [0x56214ab8cf00 <- 1
[13329]() NASL> [0x56214ab8dc20 <- 2
[13329]() NASL> [0x56214ab8fd90 <- 3
[13329]() NASL> [0x56214ab8fdf0 <- 99
[13329]() NASL> [0x56214ab8fe50 <- "1.1.0.0"
[13329]() NASL> [0x56214ab90060 <- "optimize_test"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_preference(1: "optimize_test")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_preference: "yes"
[13329]() NASL> [0x56214ab8ca10 <- "yes"
NASL:0300> if (0) { ... }
NASL:0029> global_var ...
NASL:0030> optimize_test_enabled=get_preference(...);
NASL:0030> get_preference(...)
[13329]() NASL> [0x56214ab8d800 <- 1
[13329]() NASL> [0x56214ab8fd90 <- 0
[13329]() NASL> [0x56214ab8dc20 <- 6
[13329]() NASL> [0x56214ab8fdf0 <- 17
[13329]() NASL> [0x56214ab8d860 <- 1
[13329]() NASL> [0x56214ab8d3e0 <- 0
[13329]() NASL> [0x56214ab8ce40 <- 2
[13329]() NASL> [0x56214ab8cd20 <- 0
[13329]() NASL> [0x56214ab8d4a0 <- 1
[13329]() NASL> [0x56214ab8d980 <- 2
[13329]() NASL> [0x56214ab8d680 <- 3
[13329]() NASL> [0x56214ab8cfc0 <- 4
[13329]() NASL> [0x56214ab8d200 <- 5
[13329]() NASL> [0x56214ab8da40 <- 6
[13329]() NASL> [0x56214ab8e250 <- 7
[13329]() NASL> [0x56214ab8d320 <- 9
[13329]() NASL> [0x56214ab8d920 <- 10
[13329]() NASL> [0x56214ab8d140 <- 1
[13329]() NASL> [0x56214ab8d0e0 <- 2
[13329]() NASL> [0x56214ab8d7a0 <- 4
[13329]() NASL> [0x56214ab8cf60 <- 8
[13329]() NASL> [0x56214ab8d500 <- 16
[13329]() NASL> [0x56214ab8d560 <- 32
[13329]() NASL> [0x56214ab8fed0 <- 32768
[13329]() NASL> [0x56214ab8fe50 <- 16384
[13329]() NASL> [0x56214ab8cf00 <- 8192
[13329]() NASL> [0x56214ab8dc80 <- 8191
[13329]() NASL> [0x56214ab8d020 <- 0
[13329]() NASL> [0x56214ab8d080 <- 3
[13329]() NASL> [0x56214ab8cc60 <- 4
[13329]() NASL> [0x56214ab8d440 <- 5
[13329]() NASL> [0x56214ab8d260 <- 6
[13329]() NASL> [0x56214ab8db00 <- 7
[13329]() NASL> [0x56214ab8e100 <- 1
[13329]() NASL> [0x56214ab8d2c0 <- 2
[13329]() NASL> [0x56214ab8ccc0 <- 8
[13329]() NASL> [0x56214ab8d6e0 <- 9
[13329]() NASL> [0x56214ab8d8c0 <- 10
[13329]() NASL> [0x56214ab8cea0 <- 1
[13329]() NASL> [0x56214ab8d5c0 <- 0
[13329]() NASL> [0x56214ab8d740 <- 1
[13329]() NASL> [0x56214ab8e080 <- 2
[13329]() NASL> [0x56214ab8d1a0 <- 3
[13329]() NASL> [0x56214ab8cd80 <- 99
[13329]() NASL> [0x56214ab8d9e0 <- "1.1.0.0"
[13329]() NASL> [0x56214ab904f0 <- "optimize_test"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_preference(1: "optimize_test")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_preference: "yes"
[13329]() NASL> [0x56214ab8ca10 <- "yes"
NASL:0033> global_var ...
NASL:0187> OS_CPE_SRC=make_list(...);
NASL:0187> make_list(...)
[13329]() NASL> [0x56214ab8cd80 <- 1
[13329]() NASL> [0x56214ab8d5c0 <- 0
[13329]() NASL> [0x56214ab8fe50 <- 6
[13329]() NASL> [0x56214ab8d140 <- 17
[13329]() NASL> [0x56214ab8d4a0 <- 1
[13329]() NASL> [0x56214ab8fdf0 <- 0
[13329]() NASL> [0x56214ab8d920 <- 2
[13329]() NASL> [0x56214ab8cd20 <- 0
[13329]() NASL> [0x56214ab8ce40 <- 1
[13329]() NASL> [0x56214ab8fd90 <- 2
[13329]() NASL> [0x56214ab8d440 <- 3
[13329]() NASL> [0x56214ab8d860 <- 4
[13329]() NASL> [0x56214ab8dc80 <- 5
[13329]() NASL> [0x56214ab8d800 <- 6
[13329]() NASL> [0x56214ab8dc20 <- 7
[13329]() NASL> [0x56214ab8cea0 <- 9
[13329]() NASL> [0x56214ab8d2c0 <- 10
[13329]() NASL> [0x56214ab8d020 <- 1
[13329]() NASL> [0x56214ab8d8c0 <- 2
[13329]() NASL> [0x56214ab8fed0 <- 4
[13329]() NASL> [0x56214ab8d380 <- 8
[13329]() NASL> [0x56214ab8d9e0 <- 16
[13329]() NASL> [0x56214ab8d740 <- 32
[13329]() NASL> [0x56214ab8d6e0 <- 32768
[13329]() NASL> [0x56214ab8d320 <- 16384
[13329]() NASL> [0x56214ab8d200 <- 8192
[13329]() NASL> [0x56214ab8d0e0 <- 8191
[13329]() NASL> [0x56214ab8e100 <- 0
[13329]() NASL> [0x56214ab8ccc0 <- 3
[13329]() NASL> [0x56214ab8d080 <- 4
[13329]() NASL> [0x56214ab8e250 <- 5
[13329]() NASL> [0x56214ab8d560 <- 6
[13329]() NASL> [0x56214ab8da40 <- 7
[13329]() NASL> [0x56214ab8cf00 <- 1
[13329]() NASL> [0x56214ab8d7a0 <- 2
[13329]() NASL> [0x56214ab8d260 <- 8
[13329]() NASL> [0x56214ab8d500 <- 9
[13329]() NASL> [0x56214ab8cfc0 <- 10
[13329]() NASL> [0x56214ab8d3e0 <- 1
[13329]() NASL> [0x56214ab8db00 <- 0
[13329]() NASL> [0x56214ab8cc60 <- 1
[13329]() NASL> [0x56214ab8cf60 <- 2
[13329]() NASL> [0x56214ab8d680 <- 3
[13329]() NASL> [0x56214ab8d980 <- 99
[13329]() NASL> [0x56214ab90490 <- "1.1.0.0"
[13329]() NASL> [0x56214ab906b0 <- "1.3.6.1.4.1.25623.1.0.103220"
[13329]() NASL> [0x56214ab90710 <- "1.3.6.1.4.1.25623.1.0.105383"
[13329]() NASL> [0x56214ab90770 <- "1.3.6.1.4.1.25623.1.0.103633"
[13329]() NASL> [0x56214ab90800 <- "1.3.6.1.4.1.25623.1.0.103628"
[13329]() NASL> [0x56214ab90860 <- "1.3.6.1.4.1.25623.1.0.103418"
[13329]() NASL> [0x56214ab90900 <- "1.3.6.1.4.1.25623.1.0.103417"
[13329]() NASL> [0x56214ab90960 <- "1.3.6.1.4.1.25623.1.0.96206"
[13329]() NASL> [0x56214ab90a10 <- "1.3.6.1.4.1.25623.1.0.105544"
[13329]() NASL> [0x56214ab90a70 <- "1.3.6.1.4.1.25623.1.0.105540"
[13329]() NASL> [0x56214ab90b30 <- "1.3.6.1.4.1.25623.1.0.105690"
[13329]() NASL> [0x56214ab90b90 <- "1.3.6.1.4.1.25623.1.0.105068"
[13329]() NASL> [0x56214ab90c60 <- "1.3.6.1.4.1.25623.1.0.105313"
[13329]() NASL> [0x56214ab90cc0 <- "1.3.6.1.4.1.25623.1.0.105440"
[13329]() NASL> [0x56214ab90da0 <- "1.3.6.1.4.1.25623.1.0.105441"
[13329]() NASL> [0x56214ab90e00 <- "1.3.6.1.4.1.25623.1.0.105433"
[13329]() NASL> [0x56214ab90ef0 <- "1.3.6.1.4.1.25623.1.0.105533"
[13329]() NASL> [0x56214ab90f50 <- "1.3.6.1.4.1.25623.1.0.105532"
[13329]() NASL> [0x56214ab90e60 <- "1.3.6.1.4.1.25623.1.0.96200"
[13329]() NASL> [0x56214ab90ec0 <- "1.3.6.1.4.1.25623.1.0.105263"
[13329]() NASL> [0x56214ab91130 <- "1.3.6.1.4.1.25623.1.0.105266"
[13329]() NASL> [0x56214ab91190 <- "1.3.6.1.4.1.25623.1.0.106413"
[13329]() NASL> [0x56214ab912b0 <- "1.3.6.1.4.1.25623.1.0.108566"
[13329]() NASL> [0x56214ab91310 <- "1.3.6.1.4.1.25623.1.0.106513"
[13329]() NASL> [0x56214ab91440 <- "1.3.6.1.4.1.25623.1.0.105222"
[13329]() NASL> [0x56214ab914a0 <- "1.3.6.1.4.1.25623.1.0.105033"
[13329]() NASL> [0x56214ab915e0 <- "1.3.6.1.4.1.25623.1.0.106494"
[13329]() NASL> [0x56214ab91640 <- "1.3.6.1.4.1.25623.1.0.108307"
[13329]() NASL> [0x56214ab91790 <- "1.3.6.1.4.1.25623.1.0.108311"
[13329]() NASL> [0x56214ab917f0 <- "1.3.6.1.4.1.25623.1.0.810608"
[13329]() NASL> [0x56214ab91950 <- "1.3.6.1.4.1.25623.1.0.105144"
[13329]() NASL> [0x56214ab919b0 <- "1.3.6.1.4.1.25623.1.0.105659"
[13329]() NASL> [0x56214ab91b20 <- "1.3.6.1.4.1.25623.1.0.105155"
[13329]() NASL> [0x56214ab91b80 <- "1.3.6.1.4.1.25623.1.0.140058"
[13329]() NASL> [0x56214ab91a10 <- "1.3.6.1.4.1.25623.1.0.108335"
[13329]() NASL> [0x56214ab91a70 <- "1.3.6.1.4.1.25623.1.0.105244"
[13329]() NASL> [0x56214ab91ad0 <- "1.3.6.1.4.1.25623.1.0.106864"
[13329]() NASL> [0x56214ab91d40 <- "1.3.6.1.4.1.25623.1.0.106875"
[13329]() NASL> [0x56214ab91ee0 <- "1.3.6.1.4.1.25623.1.0.103875"
[13329]() NASL> [0x56214ab91f40 <- "1.3.6.1.4.1.25623.1.0.103786"
[13329]() NASL> [0x56214ab920f0 <- "1.3.6.1.4.1.25623.1.0.142078"
[13329]() NASL> [0x56214ab92150 <- "1.3.6.1.4.1.25623.1.0.108557"
[13329]() NASL> [0x56214ab92310 <- "1.3.6.1.4.1.25623.1.0.106096"
[13329]() NASL> [0x56214ab92370 <- "1.3.6.1.4.1.25623.1.0.140738"
[13329]() NASL> [0x56214ab92540 <- "1.3.6.1.4.1.25623.1.0.140748"
[13329]() NASL> [0x56214ab925a0 <- "1.3.6.1.4.1.25623.1.0.140811"
[13329]() NASL> [0x56214ab92780 <- "1.3.6.1.4.1.25623.1.0.20285"
[13329]() NASL> [0x56214ab927e0 <- "1.3.6.1.4.1.25623.1.0.106078"
[13329]() NASL> [0x56214ab92840 <- "1.3.6.1.4.1.25623.1.0.108338"
[13329]() NASL> [0x56214ab928a0 <- "1.3.6.1.4.1.25623.1.0.108347"
[13329]() NASL> [0x56214ab92900 <- "1.3.6.1.4.1.25623.1.0.103910"
[13329]() NASL> [0x56214abecb00 <- "1.3.6.1.4.1.25623.1.0.810234"
[13329]() NASL> [0x56214abecd10 <- "1.3.6.1.4.1.25623.1.0.812377"
[13329]() NASL> [0x56214abecd70 <- "1.3.6.1.4.1.25623.1.0.106015"
[13329]() NASL> [0x56214abecf90 <- "1.3.6.1.4.1.25623.1.0.103689"
[13329]() NASL> [0x56214abecff0 <- "1.3.6.1.4.1.25623.1.0.113293"
[13329]() NASL> [0x56214abed220 <- "1.3.6.1.4.1.25623.1.0.108488"
[13329]() NASL> [0x56214abed280 <- "1.3.6.1.4.1.25623.1.0.108491"
[13329]() NASL> [0x56214abed4c0 <- "1.3.6.1.4.1.25623.1.0.141923"
[13329]() NASL> [0x56214abed520 <- "1.3.6.1.4.1.25623.1.0.141736"
[13329]() NASL> [0x56214abed770 <- "1.3.6.1.4.1.25623.1.0.108494"
[13329]() NASL> [0x56214abed7d0 <- "1.3.6.1.4.1.25623.1.0.141684"
[13329]() NASL> [0x56214abeda30 <- "1.3.6.1.4.1.25623.1.0.141766"
[13329]() NASL> [0x56214abeda90 <- "1.3.6.1.4.1.25623.1.0.141772"
[13329]() NASL> [0x56214abedd00 <- "1.3.6.1.4.1.25623.1.0.142010"
[13329]() NASL> [0x56214abedd60 <- "1.3.6.1.4.1.25623.1.0.114075"
[13329]() NASL> [0x56214abedfe0 <- "1.3.6.1.4.1.25623.1.0.114095"
[13329]() NASL> [0x56214abee040 <- "1.3.6.1.4.1.25623.1.0.114097"
[13329]() NASL> [0x56214abee2d0 <- "1.3.6.1.4.1.25623.1.0.114099"
[13329]() NASL> [0x56214abee330 <- "1.3.6.1.4.1.25623.1.0.105789"
[13329]() NASL> [0x56214abee5d0 <- "1.3.6.1.4.1.25623.1.0.106845"
[13329]() NASL> [0x56214abee630 <- "1.3.6.1.4.1.25623.1.0.106844"
[13329]() NASL> [0x56214abee8e0 <- "1.3.6.1.4.1.25623.1.0.96207"
[13329]() NASL> [0x56214abee940 <- "1.3.6.1.4.1.25623.1.0.50282"
[13329]() NASL> [0x56214abeec00 <- "1.3.6.1.4.1.25623.1.0.105614"
[13329]() NASL> [0x56214abeec60 <- "1.3.6.1.4.1.25623.1.0.140454"
[13329]() NASL> [0x56214abeef30 <- "1.3.6.1.4.1.25623.1.0.103621"
[13329]() NASL> [0x56214abeef90 <- "1.3.6.1.4.1.25623.1.0.112309"
[13329]() NASL> [0x56214abef270 <- "1.3.6.1.4.1.25623.1.0.105586"
[13329]() NASL> [0x56214abef2d0 <- "1.3.6.1.4.1.25623.1.0.104000"
[13329]() NASL> [0x56214abef5c0 <- "1.3.6.1.4.1.25623.1.0.103809"
[13329]() NASL> [0x56214abef620 <- "1.3.6.1.4.1.25623.1.0.105271"
[13329]() NASL> [0x56214abef920 <- "1.3.6.1.4.1.25623.1.0.103429"
[13329]() NASL> [0x56214abef980 <- "1.3.6.1.4.1.25623.1.0.108014"
[13329]() NASL> [0x56214abefc90 <- "1.3.6.1.4.1.25623.1.0.105355"
[13329]() NASL> [0x56214abefcf0 <- "1.3.6.1.4.1.25623.1.0.102011"
[13329]() NASL> [0x56214abf0010 <- "1.3.6.1.4.1.25623.1.0.103979"
[13329]() NASL> [0x56214abf0070 <- "1.3.6.1.4.1.25623.1.0.111067"
[13329]() NASL> [0x56214abf03a0 <- "1.3.6.1.4.1.25623.1.0.111068"
[13329]() NASL> [0x56214abf0400 <- "1.3.6.1.4.1.25623.1.0.111069"
[13329]() NASL> [0x56214abf0740 <- "1.3.6.1.4.1.25623.1.0.108192"
[13329]() NASL> [0x56214abf07a0 <- "1.3.6.1.4.1.25623.1.0.100292"
[13329]() NASL> [0x56214abf0af0 <- "1.3.6.1.4.1.25623.1.0.10884"
[13329]() NASL> [0x56214abf0b50 <- "1.3.6.1.4.1.25623.1.0.101013"
[13329]() NASL> [0x56214abf0eb0 <- "1.3.6.1.4.1.25623.1.0.10144"
[13329]() NASL> [0x56214abf0f10 <- "1.3.6.1.4.1.25623.1.0.140000"
[13329]() NASL> [0x56214abf1280 <- "1.3.6.1.4.1.25623.1.0.105899"
[13329]() NASL> [0x56214abf12e0 <- "1.3.6.1.4.1.25623.1.0.108200"
[13329]() NASL> [0x56214abf1660 <- "1.3.6.1.4.1.25623.1.0.108201"
[13329]() NASL> [0x56214abf16c0 <- "1.3.6.1.4.1.25623.1.0.140096"
[13329]() NASL> [0x56214abf1a50 <- "1.3.6.1.4.1.25623.1.0.100062"
[13329]() NASL> [0x56214abf1ab0 <- "1.3.6.1.4.1.25623.1.0.105330"
[13329]() NASL> [0x56214abf1e50 <- "1.3.6.1.4.1.25623.1.0.108044"
[13329]() NASL> [0x56214abf1eb0 <- "1.3.6.1.4.1.25623.1.0.108284"
[13329]() NASL> [0x56214abf2260 <- "1.3.6.1.4.1.25623.1.0.108565"
[13329]() NASL> [0x56214abf22c0 <- "1.3.6.1.4.1.25623.1.0.108342"
[13329]() NASL> [0x56214abf2680 <- "1.3.6.1.4.1.25623.1.0.105112"
[13329]() NASL> [0x56214abf26e0 <- "1.3.6.1.4.1.25623.1.0.108451"
[13329]() NASL> [0x56214abf2ab0 <- "1.3.6.1.4.1.25623.1.0.108455"
[13329]() NASL> [0x56214abf2b10 <- "1.3.6.1.4.1.25623.1.0.108447"
[13329]() NASL> [0x56214abf2ef0 <- "1.3.6.1.4.1.25623.1.0.10150"
[13329]() NASL> [0x56214abf2f50 <- "1.3.6.1.4.1.25623.1.0.108021"
[13329]() NASL> [0x56214abf3340 <- "1.3.6.1.4.1.25623.1.0.102002"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call make_list(1: "1.3.6.1.4.1.25623.1.0.103220", 2: "1.3.6.1.4.1.25623.1.0.105383", 3: "1.3.6.1.4.1.25623.1.0.103633", 4: "1.3.6.1.4.1.25623.1.0.103628", 5: "1.3.6.1.4.1.25623.1.0.103418", 6: "1.3.6.1.4.1.25623.1.0.103417", 7: "1.3.6.1.4.1.25623.1.0.962 ...)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return make_list: ???? (DYN_ARRAY (64))
[13329]() NASL> [0x56214ab8d1a0 <- (VAR2_ARRAY)
NASL:0302> OS_TXT_SRC=make_list(...);
NASL:0302> make_list(...)
[13329]() NASL> [0x56214ab8d680 <- 1
[13329]() NASL> [0x56214ab8cf60 <- 0
[13329]() NASL> [0x56214ab8d980 <- 6
[13329]() NASL> [0x56214ab8db00 <- 17
[13329]() NASL> [0x56214ab8d320 <- 1
[13329]() NASL> [0x56214ab8d020 <- 0
[13329]() NASL> [0x56214ab8ce40 <- 2
[13329]() NASL> [0x56214ab8d140 <- 0
[13329]() NASL> [0x56214ab8d2c0 <- 1
[13329]() NASL> [0x56214ab8cd20 <- 2
[13329]() NASL> [0x56214ab8d920 <- 3
[13329]() NASL> [0x56214ab8d5c0 <- 4
[13329]() NASL> [0x56214ab8e250 <- 5
[13329]() NASL> [0x56214ab8d4a0 <- 6
[13329]() NASL> [0x56214ab8d0e0 <- 7
[13329]() NASL> [0x56214ab8cd80 <- 9
[13329]() NASL> [0x56214ab8fe50 <- 10
[13329]() NASL> [0x56214ab8d3e0 <- 1
[13329]() NASL> [0x56214ab8d7a0 <- 2
[13329]() NASL> [0x56214ab8e100 <- 4
[13329]() NASL> [0x56214ab8cfc0 <- 8
[13329]() NASL> [0x56214ab8d6e0 <- 16
[13329]() NASL> [0x56214ab90560 <- 32
[13329]() NASL> [0x56214ab90490 <- 32768
[13329]() NASL> [0x56214ab8cc60 <- 16384
[13329]() NASL> [0x56214ab8d500 <- 8192
[13329]() NASL> [0x56214ab8cea0 <- 8191
[13329]() NASL> [0x56214ab8dc80 <- 0
[13329]() NASL> [0x56214ab8d8c0 <- 3
[13329]() NASL> [0x56214ab8cf00 <- 4
[13329]() NASL> [0x56214ab8d260 <- 5
[13329]() NASL> [0x56214ab8ccc0 <- 6
[13329]() NASL> [0x56214ab8dc20 <- 7
[13329]() NASL> [0x56214ab8d740 <- 1
[13329]() NASL> [0x56214ab8d800 <- 2
[13329]() NASL> [0x56214ab8d200 <- 8
[13329]() NASL> [0x56214ab8fed0 <- 9
[13329]() NASL> [0x56214ab8d560 <- 10
[13329]() NASL> [0x56214ab8d9e0 <- 1
[13329]() NASL> [0x56214ab8d860 <- 0
[13329]() NASL> [0x56214ab8fdf0 <- 1
[13329]() NASL> [0x56214ab8da40 <- 2
[13329]() NASL> [0x56214ab8d080 <- 3
[13329]() NASL> [0x56214ab8d380 <- 99
[13329]() NASL> [0x56214ab8d440 <- "1.1.0.0"
[13329]() NASL> [0x56214abfbc30 <- "1.3.6.1.4.1.25623.1.0.103220"
[13329]() NASL> [0x56214abfbbd0 <- "1.3.6.1.4.1.25623.1.0.105383"
[13329]() NASL> [0x56214abfb7f0 <- "1.3.6.1.4.1.25623.1.0.103633"
[13329]() NASL> [0x56214abfb7c0 <- "1.3.6.1.4.1.25623.1.0.103628"
[13329]() NASL> [0x56214abfb3f0 <- "1.3.6.1.4.1.25623.1.0.103418"
[13329]() NASL> [0x56214abfb790 <- "1.3.6.1.4.1.25623.1.0.103417"
[13329]() NASL> [0x56214abfafa0 <- "1.3.6.1.4.1.25623.1.0.96206"
[13329]() NASL> [0x56214abfaf40 <- "1.3.6.1.4.1.25623.1.0.105544"
[13329]() NASL> [0x56214abfab90 <- "1.3.6.1.4.1.25623.1.0.105540"
[13329]() NASL> [0x56214abfab30 <- "1.3.6.1.4.1.25623.1.0.105690"
[13329]() NASL> [0x56214abfa790 <- "1.3.6.1.4.1.25623.1.0.105068"
[13329]() NASL> [0x56214abfa730 <- "1.3.6.1.4.1.25623.1.0.105313"
[13329]() NASL> [0x56214abfa3a0 <- "1.3.6.1.4.1.25623.1.0.105440"
[13329]() NASL> [0x56214abfa340 <- "1.3.6.1.4.1.25623.1.0.105441"
[13329]() NASL> [0x56214abf9fc0 <- "1.3.6.1.4.1.25623.1.0.105433"
[13329]() NASL> [0x56214abf9f60 <- "1.3.6.1.4.1.25623.1.0.105533"
[13329]() NASL> [0x56214abf9bf0 <- "1.3.6.1.4.1.25623.1.0.105532"
[13329]() NASL> [0x56214abf9b90 <- "1.3.6.1.4.1.25623.1.0.96200"
[13329]() NASL> [0x56214abf9830 <- "1.3.6.1.4.1.25623.1.0.105263"
[13329]() NASL> [0x56214abf97d0 <- "1.3.6.1.4.1.25623.1.0.105266"
[13329]() NASL> [0x56214abf9480 <- "1.3.6.1.4.1.25623.1.0.106413"
[13329]() NASL> [0x56214abf9420 <- "1.3.6.1.4.1.25623.1.0.108566"
[13329]() NASL> [0x56214abf90e0 <- "1.3.6.1.4.1.25623.1.0.106513"
[13329]() NASL> [0x56214abf9080 <- "1.3.6.1.4.1.25623.1.0.105222"
[13329]() NASL> [0x56214abf8d50 <- "1.3.6.1.4.1.25623.1.0.105033"
[13329]() NASL> [0x56214abf8cf0 <- "1.3.6.1.4.1.25623.1.0.106494"
[13329]() NASL> [0x56214abf89d0 <- "1.3.6.1.4.1.25623.1.0.106875"
[13329]() NASL> [0x56214abf8970 <- "1.3.6.1.4.1.25623.1.0.103875"
[13329]() NASL> [0x56214abf8660 <- "1.3.6.1.4.1.25623.1.0.103786"
[13329]() NASL> [0x56214abf8600 <- "1.3.6.1.4.1.25623.1.0.142078"
[13329]() NASL> [0x56214abf8300 <- "1.3.6.1.4.1.25623.1.0.108557"
[13329]() NASL> [0x56214abf82a0 <- "1.3.6.1.4.1.25623.1.0.106096"
[13329]() NASL> [0x56214abf7fb0 <- "1.3.6.1.4.1.25623.1.0.140738"
[13329]() NASL> [0x56214abf7f50 <- "1.3.6.1.4.1.25623.1.0.140748"
[13329]() NASL> [0x56214abf7c70 <- "1.3.6.1.4.1.25623.1.0.140811"
[13329]() NASL> [0x56214abf7c10 <- "1.3.6.1.4.1.25623.1.0.20285"
[13329]() NASL> [0x56214abf7940 <- "1.3.6.1.4.1.25623.1.0.106078"
[13329]() NASL> [0x56214abf78e0 <- "1.3.6.1.4.1.25623.1.0.108307"
[13329]() NASL> [0x56214abf7620 <- "1.3.6.1.4.1.25623.1.0.108311"
[13329]() NASL> [0x56214abf75c0 <- "1.3.6.1.4.1.25623.1.0.810608"
[13329]() NASL> [0x56214abf7310 <- "1.3.6.1.4.1.25623.1.0.105144"
[13329]() NASL> [0x56214abf72b0 <- "1.3.6.1.4.1.25623.1.0.105659"
[13329]() NASL> [0x56214abf7010 <- "1.3.6.1.4.1.25623.1.0.105155"
[13329]() NASL> [0x56214abf6fb0 <- "1.3.6.1.4.1.25623.1.0.140058"
[13329]() NASL> [0x56214abf6d20 <- "1.3.6.1.4.1.25623.1.0.108335"
[13329]() NASL> [0x56214abf6cc0 <- "1.3.6.1.4.1.25623.1.0.105244"
[13329]() NASL> [0x56214abf6a40 <- "1.3.6.1.4.1.25623.1.0.106864"
[13329]() NASL> [0x56214abf69e0 <- "1.3.6.1.4.1.25623.1.0.108338"
[13329]() NASL> [0x56214abf6770 <- "1.3.6.1.4.1.25623.1.0.108347"
[13329]() NASL> [0x56214abf6710 <- "1.3.6.1.4.1.25623.1.0.103910"
[13329]() NASL> [0x56214abf64b0 <- "1.3.6.1.4.1.25623.1.0.810234"
[13329]() NASL> [0x56214abf6450 <- "1.3.6.1.4.1.25623.1.0.812377"
[13329]() NASL> [0x56214abf6200 <- "1.3.6.1.4.1.25623.1.0.106015"
[13329]() NASL> [0x56214abf61a0 <- "1.3.6.1.4.1.25623.1.0.103689"
[13329]() NASL> [0x56214abf5f60 <- "1.3.6.1.4.1.25623.1.0.113293"
[13329]() NASL> [0x56214abf5f00 <- "1.3.6.1.4.1.25623.1.0.108488"
[13329]() NASL> [0x56214abf5cd0 <- "1.3.6.1.4.1.25623.1.0.108491"
[13329]() NASL> [0x56214abf5c70 <- "1.3.6.1.4.1.25623.1.0.141923"
[13329]() NASL> [0x56214abf5a50 <- "1.3.6.1.4.1.25623.1.0.141736"
[13329]() NASL> [0x56214abf59f0 <- "1.3.6.1.4.1.25623.1.0.108494"
[13329]() NASL> [0x56214abf57e0 <- "1.3.6.1.4.1.25623.1.0.141684"
[13329]() NASL> [0x56214abf5780 <- "1.3.6.1.4.1.25623.1.0.141766"
[13329]() NASL> [0x56214abf5580 <- "1.3.6.1.4.1.25623.1.0.141772"
[13329]() NASL> [0x56214abf5520 <- "1.3.6.1.4.1.25623.1.0.142010"
[13329]() NASL> [0x56214abf5330 <- "1.3.6.1.4.1.25623.1.0.114075"
[13329]() NASL> [0x56214abf52d0 <- "1.3.6.1.4.1.25623.1.0.114095"
[13329]() NASL> [0x56214abf50f0 <- "1.3.6.1.4.1.25623.1.0.114097"
[13329]() NASL> [0x56214abf5090 <- "1.3.6.1.4.1.25623.1.0.114099"
[13329]() NASL> [0x56214abf4ec0 <- "1.3.6.1.4.1.25623.1.0.105789"
[13329]() NASL> [0x56214abf4e60 <- "1.3.6.1.4.1.25623.1.0.106845"
[13329]() NASL> [0x56214abf4ca0 <- "1.3.6.1.4.1.25623.1.0.106844"
[13329]() NASL> [0x56214abf4c40 <- "1.3.6.1.4.1.25623.1.0.96207"
[13329]() NASL> [0x56214abf4a90 <- "1.3.6.1.4.1.25623.1.0.50282"
[13329]() NASL> [0x56214abf4a30 <- "1.3.6.1.4.1.25623.1.0.105614"
[13329]() NASL> [0x56214abf4890 <- "1.3.6.1.4.1.25623.1.0.140454"
[13329]() NASL> [0x56214abf4620 <- "1.3.6.1.4.1.25623.1.0.103621"
[13329]() NASL> [0x56214abf45c0 <- "1.3.6.1.4.1.25623.1.0.112309"
[13329]() NASL> [0x56214abf4560 <- "1.3.6.1.4.1.25623.1.0.105586"
[13329]() NASL> [0x56214abf46d0 <- "1.3.6.1.4.1.25623.1.0.104000"
[13329]() NASL> [0x56214abf4670 <- "1.3.6.1.4.1.25623.1.0.105271"
[13329]() NASL> [0x56214abf4500 <- "1.3.6.1.4.1.25623.1.0.103809"
[13329]() NASL> [0x56214abf44a0 <- "1.3.6.1.4.1.25623.1.0.103429"
[13329]() NASL> [0x56214abf4340 <- "1.3.6.1.4.1.25623.1.0.108014"
[13329]() NASL> [0x56214abf42e0 <- "1.3.6.1.4.1.25623.1.0.105355"
[13329]() NASL> [0x56214abf4190 <- "1.3.6.1.4.1.25623.1.0.102011"
[13329]() NASL> [0x56214abf4130 <- "1.3.6.1.4.1.25623.1.0.103979"
[13329]() NASL> [0x56214abf3ff0 <- "1.3.6.1.4.1.25623.1.0.111067"
[13329]() NASL> [0x56214abf3f90 <- "1.3.6.1.4.1.25623.1.0.111068"
[13329]() NASL> [0x56214abf3e60 <- "1.3.6.1.4.1.25623.1.0.111069"
[13329]() NASL> [0x56214abf3e00 <- "1.3.6.1.4.1.25623.1.0.108192"
[13329]() NASL> [0x56214abf3ce0 <- "1.3.6.1.4.1.25623.1.0.100292"
[13329]() NASL> [0x56214abf3c80 <- "1.3.6.1.4.1.25623.1.0.10884"
[13329]() NASL> [0x56214abf3a10 <- "1.3.6.1.4.1.25623.1.0.101013"
[13329]() NASL> [0x56214abf39b0 <- "1.3.6.1.4.1.25623.1.0.10144"
[13329]() NASL> [0x56214abf3aa0 <- "1.3.6.1.4.1.25623.1.0.140000"
[13329]() NASL> [0x56214abf3a40 <- "1.3.6.1.4.1.25623.1.0.105899"
[13329]() NASL> [0x56214abf3950 <- "1.3.6.1.4.1.25623.1.0.108200"
[13329]() NASL> [0x56214abf38f0 <- "1.3.6.1.4.1.25623.1.0.108201"
[13329]() NASL> [0x56214abf3810 <- "1.3.6.1.4.1.25623.1.0.140096"
[13329]() NASL> [0x56214abf37b0 <- "1.3.6.1.4.1.25623.1.0.100062"
[13329]() NASL> [0x56214abf36e0 <- "1.3.6.1.4.1.25623.1.0.105330"
[13329]() NASL> [0x56214abf3680 <- "1.3.6.1.4.1.25623.1.0.108044"
[13329]() NASL> [0x56214abf3620 <- "1.3.6.1.4.1.25623.1.0.108284"
[13329]() NASL> [0x56214abf35c0 <- "1.3.6.1.4.1.25623.1.0.108565"
[13329]() NASL> [0x56214abf3560 <- "1.3.6.1.4.1.25623.1.0.108342"
[13329]() NASL> [0x56214abf3500 <- "1.3.6.1.4.1.25623.1.0.105112"
[13329]() NASL> [0x56214abf3460 <- "1.3.6.1.4.1.25623.1.0.108451"
[13329]() NASL> [0x56214abf3400 <- "1.3.6.1.4.1.25623.1.0.108455"
[13329]() NASL> [0x56214ab90660 <- "1.3.6.1.4.1.25623.1.0.108447"
[13329]() NASL> [0x56214ab90600 <- "1.3.6.1.4.1.25623.1.0.10150"
[13329]() NASL> [0x56214ab905a0 <- "1.3.6.1.4.1.25623.1.0.108021"
[13329]() NASL> [0x56214ab90460 <- "1.3.6.1.4.1.25623.1.0.102002"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call make_list(1: "1.3.6.1.4.1.25623.1.0.103220", 2: "1.3.6.1.4.1.25623.1.0.105383", 3: "1.3.6.1.4.1.25623.1.0.103633", 4: "1.3.6.1.4.1.25623.1.0.103628", 5: "1.3.6.1.4.1.25623.1.0.103418", 6: "1.3.6.1.4.1.25623.1.0.103417", 7: "1.3.6.1.4.1.25623.1.0.962 ...)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return make_list: ???? (DYN_ARRAY (64))
[13329]() NASL> [0x56214ab908c0 <- (VAR2_ARRAY)
NASL:0057> port=get_http_port(...);
NASL:0057> get_http_port(...)
[13329]() NASL> [0x56214ab8cea0 <- 1
[13329]() NASL> [0x56214ab8d980 <- 0
[13329]() NASL> [0x56214ab8d9e0 <- 6
[13329]() NASL> [0x56214ab8dc80 <- 17
[13329]() NASL> [0x56214ab8d560 <- 1
[13329]() NASL> [0x56214ab8d440 <- 0
[13329]() NASL> [0x56214ab8fdf0 <- 2
[13329]() NASL> [0x56214ab8cd80 <- 0
[13329]() NASL> [0x56214ab8e250 <- 1
[13329]() NASL> [0x56214ab8d740 <- 2
[13329]() NASL> [0x56214ab8d200 <- 3
[13329]() NASL> [0x56214ab8d0e0 <- 4
[13329]() NASL> [0x56214ab8d4a0 <- 5
[13329]() NASL> [0x56214ab8e100 <- 6
[13329]() NASL> [0x56214ab8ccc0 <- 7
[13329]() NASL> [0x56214ab8d5c0 <- 9
[13329]() NASL> [0x56214ab8d020 <- 10
[13329]() NASL> [0x56214ab8cf00 <- 1
[13329]() NASL> [0x56214ab8cfc0 <- 2
[13329]() NASL> [0x56214ab8cd20 <- 4
[13329]() NASL> [0x56214ab909c0 <- 8
[13329]() NASL> [0x56214ac05190 <- 16
[13329]() NASL> [0x56214ab90af0 <- 32
[13329]() NASL> [0x56214abfbc50 <- 32768
[13329]() NASL> [0x56214ab904b0 <- 16384
[13329]() NASL> [0x56214ab8eb30 <- 8192
[13329]() NASL> [0x56214ab8fad0 <- 8191
[13329]() NASL> [0x56214ab901a0 <- 0
[13329]() NASL> [0x56214ab90520 <- 3
[13329]() NASL> [0x56214ab90560 <- 4
[13329]() NASL> [0x56214ac04d40 <- 5
[13329]() NASL> [0x56214ac04da0 <- 6
[13329]() NASL> [0x56214ac04900 <- 7
[13329]() NASL> [0x56214ac04960 <- 1
[13329]() NASL> [0x56214ac044d0 <- 2
[13329]() NASL> [0x56214ac04530 <- 8
[13329]() NASL> [0x56214ac040b0 <- 9
[13329]() NASL> [0x56214ac04110 <- 10
[13329]() NASL> [0x56214ac03ca0 <- 1
[13329]() NASL> [0x56214ac03d00 <- 0
[13329]() NASL> [0x56214ac038a0 <- 1
[13329]() NASL> [0x56214ac03900 <- 2
[13329]() NASL> [0x56214ac034b0 <- 3
[13329]() NASL> [0x56214ac03510 <- 99
[13329]() NASL> [0x56214ac030d0 <- "1.1.0.0"
[13329]() NASL> [0x56214ac02d20 <- 80
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_http_port(default: 80)
NASL:0297> local_var ...
NASL:0298> local_var ...
NASL:0307> if ((! (default)) && (! (nodefault))) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac02d20 -> 80
NASL:0316> if (! (ignore_cgi_disabled)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac01ef0 -> undef
NASL:0314> if (http_is_cgi_scan_disabled(...)) { ... }
NASL:0308> http_is_cgi_scan_disabled(...)
[13329]() NASL> [0x56214ac01800 <- 1
[13329]() NASL> [0x56214ac011a0 <- 0
[13329]() NASL> [0x56214ac00e40 <- 6
[13329]() NASL> [0x56214ac00ea0 <- 17
[13329]() NASL> [0x56214ac00b20 <- 1
[13329]() NASL> [0x56214ac00b80 <- 0
[13329]() NASL> [0x56214ac00810 <- 2
[13329]() NASL> [0x56214ac00870 <- 0
[13329]() NASL> [0x56214ac00510 <- 1
[13329]() NASL> [0x56214ac00570 <- 2
[13329]() NASL> [0x56214ac00220 <- 3
[13329]() NASL> [0x56214ac00280 <- 4
[13329]() NASL> [0x56214abfff40 <- 5
[13329]() NASL> [0x56214abfffa0 <- 6
[13329]() NASL> [0x56214abffc70 <- 7
[13329]() NASL> [0x56214abffcd0 <- 9
[13329]() NASL> [0x56214abff9b0 <- 10
[13329]() NASL> [0x56214abffa10 <- 1
[13329]() NASL> [0x56214abff700 <- 2
[13329]() NASL> [0x56214abff760 <- 4
[13329]() NASL> [0x56214abff460 <- 8
[13329]() NASL> [0x56214abff4c0 <- 16
[13329]() NASL> [0x56214abff1d0 <- 32
[13329]() NASL> [0x56214abff230 <- 32768
[13329]() NASL> [0x56214abfef50 <- 16384
[13329]() NASL> [0x56214abfefb0 <- 8192
[13329]() NASL> [0x56214abfece0 <- 8191
[13329]() NASL> [0x56214abfed40 <- 0
[13329]() NASL> [0x56214abfea80 <- 3
[13329]() NASL> [0x56214abfeae0 <- 4
[13329]() NASL> [0x56214abfe830 <- 5
[13329]() NASL> [0x56214abfe890 <- 6
[13329]() NASL> [0x56214abfe5f0 <- 7
[13329]() NASL> [0x56214abfe650 <- 1
[13329]() NASL> [0x56214abfe3c0 <- 2
[13329]() NASL> [0x56214abfe420 <- 8
[13329]() NASL> [0x56214abfe1a0 <- 9
[13329]() NASL> [0x56214abfe200 <- 10
[13329]() NASL> [0x56214abfdf90 <- 1
[13329]() NASL> [0x56214abfdff0 <- 0
[13329]() NASL> [0x56214abfd840 <- 1
[13329]() NASL> [0x56214abfd8a0 <- 2
[13329]() NASL> [0x56214abfd690 <- 3
[13329]() NASL> [0x56214abfd6f0 <- 99
[13329]() NASL> [0x56214abfd4f0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call http_is_cgi_scan_disabled()
NASL:2252> local_var ...
NASL:2264> if (! (isnull(...))) { ... } else { ... }
NASL:2255> isnull(...)
[13329]() NASL> [0x56214ab8eec0 <- 1
[13329]() NASL> [0x56214ab8ef00 <- 0
[13329]() NASL> [0x56214ab8ef60 <- 6
[13329]() NASL> [0x56214abfc410 <- 17
[13329]() NASL> [0x56214abfc470 <- 1
[13329]() NASL> [0x56214abfc4d0 <- 0
[13329]() NASL> [0x56214abfc530 <- 2
[13329]() NASL> [0x56214abfc570 <- 0
[13329]() NASL> [0x56214ab8f200 <- 1
[13329]() NASL> [0x56214ab8f260 <- 2
[13329]() NASL> [0x56214ab8f2c0 <- 3
[13329]() NASL> [0x56214ab8f320 <- 4
[13329]() NASL> [0x56214ab8f380 <- 5
[13329]() NASL> [0x56214abfda00 <- 6
[13329]() NASL> [0x56214abfda60 <- 7
[13329]() NASL> [0x56214abfdac0 <- 9
[13329]() NASL> [0x56214abfdb20 <- 10
[13329]() NASL> [0x56214abfdb80 <- 1
[13329]() NASL> [0x56214abfdbe0 <- 2
[13329]() NASL> [0x56214abfdc40 <- 4
[13329]() NASL> [0x56214abfcda0 <- 8
[13329]() NASL> [0x56214abfce00 <- 16
[13329]() NASL> [0x56214abfce60 <- 32
[13329]() NASL> [0x56214abfcec0 <- 32768
[13329]() NASL> [0x56214abfcf20 <- 16384
[13329]() NASL> [0x56214abfcf80 <- 8192
[13329]() NASL> [0x56214abfcfe0 <- 8191
[13329]() NASL> [0x56214ac05b80 <- 0
[13329]() NASL> [0x56214ac05bc0 <- 3
[13329]() NASL> [0x56214ac05c20 <- 4
[13329]() NASL> [0x56214ac05c80 <- 5
[13329]() NASL> [0x56214ac05ce0 <- 6
[13329]() NASL> [0x56214ac05d40 <- 7
[13329]() NASL> [0x56214ac05da0 <- 1
[13329]() NASL> [0x56214ac05e00 <- 2
[13329]() NASL> [0x56214ac05e60 <- 8
[13329]() NASL> [0x56214ac05ec0 <- 9
[13329]() NASL> [0x56214ac05f20 <- 10
[13329]() NASL> [0x56214ac05f80 <- 1
[13329]() NASL> [0x56214ac05fe0 <- 0
[13329]() NASL> [0x56214ac06040 <- 1
[13329]() NASL> [0x56214ac060a0 <- 2
[13329]() NASL> [0x56214ac06100 <- 3
[13329]() NASL> [0x56214ac06160 <- 99
[13329]() NASL> [0x56214ac061c0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8c900 -> undef
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call isnull(1: NULL)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return isnull: 1
NASL:2258> is_cgi_scan_disabled=get_kb_item(...);
NASL:2258> get_kb_item(...)
[13329]() NASL> [0x56214ac060a0 <- 1
[13329]() NASL> [0x56214ac06160 <- 0
[13329]() NASL> [0x56214ac05fe0 <- 6
[13329]() NASL> [0x56214abfcf20 <- 17
[13329]() NASL> [0x56214abfdb80 <- 1
[13329]() NASL> [0x56214ab8f200 <- 0
[13329]() NASL> [0x56214abfc410 <- 2
[13329]() NASL> [0x56214abfdb20 <- 0
[13329]() NASL> [0x56214abfc570 <- 1
[13329]() NASL> [0x56214abfc530 <- 2
[13329]() NASL> [0x56214ab8ef00 <- 3
[13329]() NASL> [0x56214ac05c80 <- 4
[13329]() NASL> [0x56214abfc470 <- 5
[13329]() NASL> [0x56214abfcfe0 <- 6
[13329]() NASL> [0x56214ab8eec0 <- 7
[13329]() NASL> [0x56214ab8ef60 <- 9
[13329]() NASL> [0x56214ac05f80 <- 10
[13329]() NASL> [0x56214ac05e00 <- 1
[13329]() NASL> [0x56214ac05b80 <- 2
[13329]() NASL> [0x56214ac05f20 <- 4
[13329]() NASL> [0x56214abfcec0 <- 8
[13329]() NASL> [0x56214ac06240 <- 16
[13329]() NASL> [0x56214ac061c0 <- 32
[13329]() NASL> [0x56214ac06040 <- 32768
[13329]() NASL> [0x56214ac05ec0 <- 16384
[13329]() NASL> [0x56214abfdac0 <- 8192
[13329]() NASL> [0x56214ab8f380 <- 8191
[13329]() NASL> [0x56214abfdbe0 <- 0
[13329]() NASL> [0x56214ac05da0 <- 3
[13329]() NASL> [0x56214ac05e60 <- 4
[13329]() NASL> [0x56214ac05bc0 <- 5
[13329]() NASL> [0x56214abfda60 <- 6
[13329]() NASL> [0x56214abfce60 <- 7
[13329]() NASL> [0x56214abfda00 <- 1
[13329]() NASL> [0x56214abfcf80 <- 2
[13329]() NASL> [0x56214ac05ce0 <- 8
[13329]() NASL> [0x56214abfce00 <- 9
[13329]() NASL> [0x56214ab8f320 <- 10
[13329]() NASL> [0x56214abfc4d0 <- 1
[13329]() NASL> [0x56214ac05d40 <- 0
[13329]() NASL> [0x56214ac05c20 <- 1
[13329]() NASL> [0x56214abfcda0 <- 2
[13329]() NASL> [0x56214ab8f2c0 <- 3
[13329]() NASL> [0x56214ab8f260 <- 99
[13329]() NASL> [0x56214ac063f0 <- "1.1.0.0"
[13329]() NASL> [0x56214ac06370 <- "Settings/disable_cgi_scanning"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_kb_item(1: "Settings/disable_cgi_scanning")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_kb_item: NULL
[13329]() NASL> [0x56214abfd3d0 <- undef
NASL:2262> if (is_cgi_scan_disabled) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd3d0 -> undef
NASL:2262> __http_is_cgi_scan_disabled=FALSE;
[13329]() NASL> [0x56214ab8c900 <- 0
NASL:2263> is_cgi_scan_disabled=__http_is_cgi_scan_disabled;
[13329]() NASL> [0x56214abfd3d0 <- 0
NASL:2265> return is_cgi_scan_disabled;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd3d0 -> 0
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return http_is_cgi_scan_disabled: 0
NASL:0316> port=get_kb_item(...);
NASL:0316> get_kb_item(...)
[13329]() NASL> [0x56214ac063b0 <- 1
[13329]() NASL> [0x56214abfd690 <- 0
[13329]() NASL> [0x56214abfd8a0 <- 6
[13329]() NASL> [0x56214abfd6f0 <- 17
[13329]() NASL> [0x56214abfdff0 <- 1
[13329]() NASL> [0x56214abfef50 <- 0
[13329]() NASL> [0x56214abffa10 <- 2
[13329]() NASL> [0x56214ac00510 <- 0
[13329]() NASL> [0x56214ac00ea0 <- 1
[13329]() NASL> [0x56214abff9b0 <- 2
[13329]() NASL> [0x56214ac00870 <- 3
[13329]() NASL> [0x56214ac00810 <- 4
[13329]() NASL> [0x56214ac011a0 <- 5
[13329]() NASL> [0x56214abfe830 <- 6
[13329]() NASL> [0x56214ac00b20 <- 7
[13329]() NASL> [0x56214abfece0 <- 9
[13329]() NASL> [0x56214ac01800 <- 10
[13329]() NASL> [0x56214ac00e40 <- 1
[13329]() NASL> [0x56214abfdf90 <- 2
[13329]() NASL> [0x56214abfe3c0 <- 4
[13329]() NASL> [0x56214abfed40 <- 8
[13329]() NASL> [0x56214abfe200 <- 16
[13329]() NASL> [0x56214abff230 <- 32
[13329]() NASL> [0x56214abfd570 <- 32768
[13329]() NASL> [0x56214abfd4f0 <- 16384
[13329]() NASL> [0x56214abfd840 <- 8192
[13329]() NASL> [0x56214abfe1a0 <- 8191
[13329]() NASL> [0x56214abffcd0 <- 0
[13329]() NASL> [0x56214abfff40 <- 3
[13329]() NASL> [0x56214abff700 <- 4
[13329]() NASL> [0x56214abfe650 <- 5
[13329]() NASL> [0x56214abfe420 <- 6
[13329]() NASL> [0x56214abfea80 <- 7
[13329]() NASL> [0x56214abffc70 <- 1
[13329]() NASL> [0x56214abff1d0 <- 2
[13329]() NASL> [0x56214abfffa0 <- 8
[13329]() NASL> [0x56214abfefb0 <- 9
[13329]() NASL> [0x56214abff760 <- 10
[13329]() NASL> [0x56214abfe890 <- 1
[13329]() NASL> [0x56214abff4c0 <- 0
[13329]() NASL> [0x56214ac00280 <- 1
[13329]() NASL> [0x56214ac00b80 <- 2
[13329]() NASL> [0x56214abfe5f0 <- 3
[13329]() NASL> [0x56214abfeae0 <- 99
[13329]() NASL> [0x56214abff460 <- "1.1.0.0"
[13329]() NASL> [0x56214ac01200 <- "Services/www"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_kb_item(1: "Services/www")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_kb_item: "80"
[13329]() NASL> [0x56214ac01b80 <- "80"
NASL:0322> if (port) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac01b80 -> "80"
NASL:0318> default=port;
[13329]() NASL> [0x56214ac02d20 <- "80"
NASL:0325> if (! (default)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac02d20 -> "80"
NASL:0330> if ((! (ignore_unscanned)) && (! (get_port_state(...)))) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac025f0 -> undef
NASL:0325> get_port_state(...)
[13329]() NASL> [0x56214abfe5f0 <- 1
[13329]() NASL> [0x56214abfd3a0 <- 0
[13329]() NASL> [0x56214ac01be0 <- 6
[13329]() NASL> [0x56214ac00b80 <- 17
[13329]() NASL> [0x56214abfeae0 <- 1
[13329]() NASL> [0x56214abff4c0 <- 0
[13329]() NASL> [0x56214abfd4f0 <- 2
[13329]() NASL> [0x56214ac00e40 <- 0
[13329]() NASL> [0x56214ac00ea0 <- 1
[13329]() NASL> [0x56214abfd6f0 <- 2
[13329]() NASL> [0x56214ac01800 <- 3
[13329]() NASL> [0x56214ac00510 <- 4
[13329]() NASL> [0x56214abffa10 <- 5
[13329]() NASL> [0x56214abfd690 <- 6
[13329]() NASL> [0x56214abfe650 <- 7
[13329]() NASL> [0x56214abfdff0 <- 9
[13329]() NASL> [0x56214abfe1a0 <- 10
[13329]() NASL> [0x56214ac063b0 <- 1
[13329]() NASL> [0x56214abfd8a0 <- 2
[13329]() NASL> [0x56214abfe890 <- 4
[13329]() NASL> [0x56214abff1d0 <- 8
[13329]() NASL> [0x56214abffcd0 <- 16
[13329]() NASL> [0x56214abff760 <- 32
[13329]() NASL> [0x56214abfd570 <- 32768
[13329]() NASL> [0x56214ac00220 <- 16384
[13329]() NASL> [0x56214abff460 <- 8192
[13329]() NASL> [0x56214ac00280 <- 8191
[13329]() NASL> [0x56214abfefb0 <- 0
[13329]() NASL> [0x56214abfece0 <- 3
[13329]() NASL> [0x56214ac011a0 <- 4
[13329]() NASL> [0x56214abfdf90 <- 5
[13329]() NASL> [0x56214abffc70 <- 6
[13329]() NASL> [0x56214abfffa0 <- 7
[13329]() NASL> [0x56214abfff40 <- 1
[13329]() NASL> [0x56214ac00b20 <- 2
[13329]() NASL> [0x56214abff230 <- 8
[13329]() NASL> [0x56214abfe830 <- 9
[13329]() NASL> [0x56214abfd840 <- 10
[13329]() NASL> [0x56214abfe3c0 <- 1
[13329]() NASL> [0x56214abfe420 <- 0
[13329]() NASL> [0x56214abfe200 <- 1
[13329]() NASL> [0x56214ac00810 <- 2
[13329]() NASL> [0x56214abfef50 <- 3
[13329]() NASL> [0x56214abfea80 <- 99
[13329]() NASL> [0x56214abff700 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac02d20 -> "80"
[13329]() NASL> [0x56214ac064a0 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_port_state(1: "80")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_port_state: 1
NASL:0333> if (http_is_fragile_port(...)) { ... }
NASL:0330> http_is_fragile_port(...)
[13329]() NASL> [0x56214abff9b0 <- 1
[13329]() NASL> [0x56214abfef50 <- 0
[13329]() NASL> [0x56214ac00810 <- 6
[13329]() NASL> [0x56214abfea80 <- 17
[13329]() NASL> [0x56214abfe420 <- 1
[13329]() NASL> [0x56214ac00220 <- 0
[13329]() NASL> [0x56214ac063b0 <- 2
[13329]() NASL> [0x56214ac00ea0 <- 0
[13329]() NASL> [0x56214ac00b80 <- 1
[13329]() NASL> [0x56214abfe1a0 <- 2
[13329]() NASL> [0x56214ac00e40 <- 3
[13329]() NASL> [0x56214abfd4f0 <- 4
[13329]() NASL> [0x56214abfd3a0 <- 5
[13329]() NASL> [0x56214abfdf90 <- 6
[13329]() NASL> [0x56214abfeae0 <- 7
[13329]() NASL> [0x56214ac00280 <- 9
[13329]() NASL> [0x56214abfe5f0 <- 10
[13329]() NASL> [0x56214ac01be0 <- 1
[13329]() NASL> [0x56214abfe3c0 <- 2
[13329]() NASL> [0x56214ac00b20 <- 4
[13329]() NASL> [0x56214abfefb0 <- 8
[13329]() NASL> [0x56214abfd840 <- 16
[13329]() NASL> [0x56214abfd570 <- 32
[13329]() NASL> [0x56214abfed40 <- 32768
[13329]() NASL> [0x56214abff700 <- 16384
[13329]() NASL> [0x56214abfe200 <- 8192
[13329]() NASL> [0x56214abfe830 <- 8191
[13329]() NASL> [0x56214abfdff0 <- 0
[13329]() NASL> [0x56214abffa10 <- 3
[13329]() NASL> [0x56214abfd8a0 <- 4
[13329]() NASL> [0x56214abfff40 <- 5
[13329]() NASL> [0x56214abff230 <- 6
[13329]() NASL> [0x56214abfece0 <- 7
[13329]() NASL> [0x56214abfe650 <- 1
[13329]() NASL> [0x56214abff760 <- 2
[13329]() NASL> [0x56214abfd690 <- 8
[13329]() NASL> [0x56214abff460 <- 9
[13329]() NASL> [0x56214abfe890 <- 10
[13329]() NASL> [0x56214abffc70 <- 1
[13329]() NASL> [0x56214abffcd0 <- 0
[13329]() NASL> [0x56214ac00510 <- 1
[13329]() NASL> [0x56214abff4c0 <- 2
[13329]() NASL> [0x56214abfffa0 <- 3
[13329]() NASL> [0x56214ac011a0 <- 99
[13329]() NASL> [0x56214abff1d0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac02d20 -> "80"
[13329]() NASL> [0x56214abfd6f0 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call http_is_fragile_port(port: "80")
NASL:1262> local_var ...
NASL:1263> local_var ...
NASL:1270> if (! (port)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd6f0 -> "80"
NASL:1270> fragile_ports=get_kb_list(...);
NASL:1270> get_kb_list(...)
[13329]() NASL> [0x56214ab90240 <- 1
[13329]() NASL> [0x56214ab90280 <- 0
[13329]() NASL> [0x56214ab8eec0 <- 6
[13329]() NASL> [0x56214ab8ef00 <- 17
[13329]() NASL> [0x56214ab8ef40 <- 1
[13329]() NASL> [0x56214abfc410 <- 0
[13329]() NASL> [0x56214abfc450 <- 2
[13329]() NASL> [0x56214abfc490 <- 0
[13329]() NASL> [0x56214abfc4d0 <- 1
[13329]() NASL> [0x56214abfc530 <- 2
[13329]() NASL> [0x56214abfc570 <- 3
[13329]() NASL> [0x56214ab8f1e0 <- 4
[13329]() NASL> [0x56214ab8f240 <- 5
[13329]() NASL> [0x56214ab8f2a0 <- 6
[13329]() NASL> [0x56214ab8f300 <- 7
[13329]() NASL> [0x56214ab8f360 <- 9
[13329]() NASL> [0x56214abfce60 <- 10
[13329]() NASL> [0x56214abfcec0 <- 1
[13329]() NASL> [0x56214abfcf20 <- 2
[13329]() NASL> [0x56214abfcf80 <- 4
[13329]() NASL> [0x56214abfcfe0 <- 8
[13329]() NASL> [0x56214abfda00 <- 16
[13329]() NASL> [0x56214abfda40 <- 32
[13329]() NASL> [0x56214abfdaa0 <- 32768
[13329]() NASL> [0x56214abfdb00 <- 16384
[13329]() NASL> [0x56214abfdb60 <- 8192
[13329]() NASL> [0x56214abfdbc0 <- 8191
[13329]() NASL> [0x56214abfdc20 <- 0
[13329]() NASL> [0x56214ac05b80 <- 3
[13329]() NASL> [0x56214ac05be0 <- 4
[13329]() NASL> [0x56214ac05c40 <- 5
[13329]() NASL> [0x56214ac05ca0 <- 6
[13329]() NASL> [0x56214ac05d00 <- 7
[13329]() NASL> [0x56214ac05d60 <- 1
[13329]() NASL> [0x56214ac05dc0 <- 2
[13329]() NASL> [0x56214ac05e20 <- 8
[13329]() NASL> [0x56214ac05e80 <- 9
[13329]() NASL> [0x56214ac05ee0 <- 10
[13329]() NASL> [0x56214ac05f40 <- 1
[13329]() NASL> [0x56214ac05fa0 <- 0
[13329]() NASL> [0x56214ac06000 <- 1
[13329]() NASL> [0x56214ac06060 <- 2
[13329]() NASL> [0x56214ac060c0 <- 3
[13329]() NASL> [0x56214ac06120 <- 99
[13329]() NASL> [0x56214ac06180 <- "1.1.0.0"
[13329]() NASL> [0x56214ab71b20 <- "Services/fragile_port"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_kb_list(1: "Services/fragile_port")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_kb_list: FAKE
[13329]() NASL> [0x56214ac00870 <- undef
NASL:1274> if (! (fragile_ports)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00870 -> undef
NASL:1272> return FALSE;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfef50 -> 0
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return http_is_fragile_port: 0
NASL:0340> if ((! (dont_use_vhosts)) && (! (host))) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac01f50 -> undef
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac029a0 -> undef
NASL:0334> host=http_host_name(...);
NASL:0334> http_host_name(...)
[13329]() NASL> [0x56214abff4c0 <- 1
[13329]() NASL> [0x56214ac011a0 <- 0
[13329]() NASL> [0x56214abffcd0 <- 6
[13329]() NASL> [0x56214abff700 <- 17
[13329]() NASL> [0x56214ac01be0 <- 1
[13329]() NASL> [0x56214ac00b80 <- 0
[13329]() NASL> [0x56214abfea80 <- 2
[13329]() NASL> [0x56214abfe5f0 <- 0
[13329]() NASL> [0x56214ac00ea0 <- 1
[13329]() NASL> [0x56214ac063b0 <- 2
[13329]() NASL> [0x56214abfef50 <- 3
[13329]() NASL> [0x56214abfff40 <- 4
[13329]() NASL> [0x56214abfe420 <- 5
[13329]() NASL> [0x56214abfe830 <- 6
[13329]() NASL> [0x56214abff9b0 <- 7
[13329]() NASL> [0x56214ac00870 <- 9
[13329]() NASL> [0x56214ac00810 <- 10
[13329]() NASL> [0x56214abfd6f0 <- 1
[13329]() NASL> [0x56214abffc70 <- 2
[13329]() NASL> [0x56214abff760 <- 4
[13329]() NASL> [0x56214abfdff0 <- 8
[13329]() NASL> [0x56214abfe890 <- 16
[13329]() NASL> [0x56214abfed40 <- 32
[13329]() NASL> [0x56214ac01800 <- 32768
[13329]() NASL> [0x56214abff1d0 <- 16384
[13329]() NASL> [0x56214ac00510 <- 8192
[13329]() NASL> [0x56214abff460 <- 8191
[13329]() NASL> [0x56214ac00280 <- 0
[13329]() NASL> [0x56214abfd3a0 <- 3
[13329]() NASL> [0x56214ab8c9d0 <- 4
[13329]() NASL> [0x56214abfe3c0 <- 5
[13329]() NASL> [0x56214abfe650 <- 6
[13329]() NASL> [0x56214abfd690 <- 7
[13329]() NASL> [0x56214abffa10 <- 1
[13329]() NASL> [0x56214abfeae0 <- 2
[13329]() NASL> [0x56214abfd570 <- 8
[13329]() NASL> [0x56214abfdf90 <- 9
[13329]() NASL> [0x56214abfe200 <- 10
[13329]() NASL> [0x56214ac00b20 <- 1
[13329]() NASL> [0x56214abff230 <- 0
[13329]() NASL> [0x56214abfd840 <- 1
[13329]() NASL> [0x56214abfd4f0 <- 2
[13329]() NASL> [0x56214ac00220 <- 3
[13329]() NASL> [0x56214abfece0 <- 99
[13329]() NASL> [0x56214abfd8a0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cea0 -> 1
[13329]() NASL> [0x56214ac00e40 <- 1
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call http_host_name(dont_add_port: 1)
NASL:1184> local_var ...
NASL:1185> local_var ...
NASL:1191> if (use_ip) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe1a0 -> undef
NASL:1190> host=get_host_name(...);
NASL:1190> get_host_name(...)
[13329]() NASL> [0x56214ac014b0 <- 1
[13329]() NASL> [0x56214ac014f0 <- 0
[13329]() NASL> [0x56214ac01530 <- 6
[13329]() NASL> [0x56214ab8eec0 <- 17
[13329]() NASL> [0x56214ab8ef00 <- 1
[13329]() NASL> [0x56214ab8ef40 <- 0
[13329]() NASL> [0x56214abfc410 <- 2
[13329]() NASL> [0x56214abfc450 <- 0
[13329]() NASL> [0x56214abfc490 <- 1
[13329]() NASL> [0x56214abfc4d0 <- 2
[13329]() NASL> [0x56214abfc510 <- 3
[13329]() NASL> [0x56214abfc550 <- 4
[13329]() NASL> [0x56214ac060a0 <- 5
[13329]() NASL> [0x56214ac060e0 <- 6
[13329]() NASL> [0x56214ac06120 <- 7
[13329]() NASL> [0x56214ac06180 <- 9
[13329]() NASL> [0x56214ac061e0 <- 10
[13329]() NASL> [0x56214ac06240 <- 1
[13329]() NASL> [0x56214ab8f1e0 <- 2
[13329]() NASL> [0x56214ab8f240 <- 4
[13329]() NASL> [0x56214ab8f2a0 <- 8
[13329]() NASL> [0x56214ab8f300 <- 16
[13329]() NASL> [0x56214ab8f360 <- 32
[13329]() NASL> [0x56214abfce60 <- 32768
[13329]() NASL> [0x56214abfcec0 <- 16384
[13329]() NASL> [0x56214abfcf20 <- 8192
[13329]() NASL> [0x56214abfcf80 <- 8191
[13329]() NASL> [0x56214abfcfe0 <- 0
[13329]() NASL> [0x56214abfd020 <- 3
[13329]() NASL> [0x56214abfda00 <- 4
[13329]() NASL> [0x56214abfda60 <- 5
[13329]() NASL> [0x56214abfdac0 <- 6
[13329]() NASL> [0x56214abfdb20 <- 7
[13329]() NASL> [0x56214abfdb80 <- 1
[13329]() NASL> [0x56214abfdbe0 <- 2
[13329]() NASL> [0x56214abfdc40 <- 8
[13329]() NASL> [0x56214ac05ba0 <- 9
[13329]() NASL> [0x56214ac05c00 <- 10
[13329]() NASL> [0x56214ac05c60 <- 1
[13329]() NASL> [0x56214ac05cc0 <- 0
[13329]() NASL> [0x56214ac05d20 <- 1
[13329]() NASL> [0x56214ac05d80 <- 2
[13329]() NASL> [0x56214ac05de0 <- 3
[13329]() NASL> [0x56214ac05e40 <- 99
[13329]() NASL> [0x56214ac05ea0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_host_name()
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_host_name: "192.168.232.129"
[13329]() NASL> [0x56214ac063f0 <- "192.168.232.129"
NASL:1196> if (dont_add_port) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00e40 -> 1
NASL:1194> return host;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac063f0 -> "192.168.232.129"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return http_host_name: "192.168.232.129"
[13329]() NASL> [0x56214ac029a0 <- "192.168.232.129"
NASL:0343> if ((! (ignore_broken)) && (http_get_is_marked_broken(...))) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac02590 -> undef
NASL:0340> http_get_is_marked_broken(...)
[13329]() NASL> [0x56214ac062c0 <- 1
[13329]() NASL> [0x56214ac06060 <- 0
[13329]() NASL> [0x56214abfffa0 <- 6
[13329]() NASL> [0x56214ac00220 <- 17
[13329]() NASL> [0x56214abfd4f0 <- 1
[13329]() NASL> [0x56214abfece0 <- 0
[13329]() NASL> [0x56214abff230 <- 2
[13329]() NASL> [0x56214abff1d0 <- 0
[13329]() NASL> [0x56214abfd6f0 <- 1
[13329]() NASL> [0x56214ac00ea0 <- 2
[13329]() NASL> [0x56214abff700 <- 3
[13329]() NASL> [0x56214ac00810 <- 4
[13329]() NASL> [0x56214abfe5f0 <- 5
[13329]() NASL> [0x56214abfea80 <- 6
[13329]() NASL> [0x56214ac011a0 <- 7
[13329]() NASL> [0x56214abfe1a0 <- 9
[13329]() NASL> [0x56214abfe3c0 <- 10
[13329]() NASL> [0x56214ac01be0 <- 1
[13329]() NASL> [0x56214abff460 <- 2
[13329]() NASL> [0x56214abff4c0 <- 4
[13329]() NASL> [0x56214abffcd0 <- 8
[13329]() NASL> [0x56214abfd3e0 <- 16
[13329]() NASL> [0x56214ac00b20 <- 32
[13329]() NASL> [0x56214abfeae0 <- 32768
[13329]() NASL> [0x56214ac00280 <- 16384
[13329]() NASL> [0x56214ac00e40 <- 8192
[13329]() NASL> [0x56214abfe200 <- 8191
[13329]() NASL> [0x56214ac01800 <- 0
[13329]() NASL> [0x56214abfefb0 <- 3
[13329]() NASL> [0x56214abfd8a0 <- 4
[13329]() NASL> [0x56214abfd840 <- 5
[13329]() NASL> [0x56214abfdf90 <- 6
[13329]() NASL> [0x56214ac00870 <- 7
[13329]() NASL> [0x56214abfe420 <- 1
[13329]() NASL> [0x56214abffc70 <- 2
[13329]() NASL> [0x56214abffa10 <- 8
[13329]() NASL> [0x56214abfd570 <- 9
[13329]() NASL> [0x56214abfd3a0 <- 10
[13329]() NASL> [0x56214abff9b0 <- 1
[13329]() NASL> [0x56214abfed40 <- 0
[13329]() NASL> [0x56214abfe830 <- 1
[13329]() NASL> [0x56214ac00510 <- 2
[13329]() NASL> [0x56214abff760 <- 3
[13329]() NASL> [0x56214ac063f0 <- 99
[13329]() NASL> [0x56214abfe650 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac02d20 -> "80"
[13329]() NASL> [0x56214abfff40 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac029a0 -> "192.168.232.129"
[13329]() NASL> [0x56214ac00b80 <- "192.168.232.129"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call http_get_is_marked_broken(port: "80", host: "192.168.232.129")
NASL:1491> local_var ...
NASL:1492> local_var ...
NASL:1500> if (! (port)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfff40 -> "80"
NASL:1507> if (! (host)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00b80 -> "192.168.232.129"
NASL:1514> if (! (isnull(...))) { ... }
NASL:1507> isnull(...)
[13329]() NASL> [0x56214abfef50 <- 1
[13329]() NASL> [0x56214ac063b0 <- 0
[13329]() NASL> [0x56214ac05de0 <- 6
[13329]() NASL> [0x56214abfda00 <- 17
[13329]() NASL> [0x56214abfd1e0 <- 1
[13329]() NASL> [0x56214abfd220 <- 0
[13329]() NASL> [0x56214ac05fa0 <- 2
[13329]() NASL> [0x56214ac05fe0 <- 0
[13329]() NASL> [0x56214ac06020 <- 1
[13329]() NASL> [0x56214ac014b0 <- 2
[13329]() NASL> [0x56214ac014f0 <- 3
[13329]() NASL> [0x56214ac01530 <- 4
[13329]() NASL> [0x56214ab8f300 <- 5
[13329]() NASL> [0x56214ab8f340 <- 6
[13329]() NASL> [0x56214ab8f380 <- 7
[13329]() NASL> [0x56214ab8eec0 <- 9
[13329]() NASL> [0x56214ab8ef20 <- 10
[13329]() NASL> [0x56214abfda60 <- 1
[13329]() NASL> [0x56214abfdac0 <- 2
[13329]() NASL> [0x56214abfdb20 <- 4
[13329]() NASL> [0x56214ab8f1e0 <- 8
[13329]() NASL> [0x56214ab8f240 <- 16
[13329]() NASL> [0x56214ab8f2a0 <- 32
[13329]() NASL> [0x56214abfdba0 <- 32768
[13329]() NASL> [0x56214abfdc00 <- 16384
[13329]() NASL> [0x56214ac05e40 <- 8192
[13329]() NASL> [0x56214ac05ea0 <- 8191
[13329]() NASL> [0x56214ac05f00 <- 0
[13329]() NASL> [0x56214ac05f40 <- 3
[13329]() NASL> [0x56214abfc430 <- 4
[13329]() NASL> [0x56214abfc490 <- 5
[13329]() NASL> [0x56214abfc4f0 <- 6
[13329]() NASL> [0x56214abfc550 <- 7
[13329]() NASL> [0x56214ac060a0 <- 1
[13329]() NASL> [0x56214ac06100 <- 2
[13329]() NASL> [0x56214ac06160 <- 8
[13329]() NASL> [0x56214ac061c0 <- 9
[13329]() NASL> [0x56214ac06220 <- 10
[13329]() NASL> [0x56214abfce60 <- 1
[13329]() NASL> [0x56214abfcec0 <- 0
[13329]() NASL> [0x56214abfcf20 <- 1
[13329]() NASL> [0x56214abfcf80 <- 2
[13329]() NASL> [0x56214abfcfe0 <- 3
[13329]() NASL> [0x56214ac05b80 <- 99
[13329]() NASL> [0x56214ac05bc0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00b80 -> "192.168.232.129"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfff40 -> "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06810 -> undef
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call isnull(1: NULL)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return isnull: 1
NASL:1528> if (host == "*") { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00b80 -> "192.168.232.129"
NASL:1527> marked_broken=get_kb_item(...);
NASL:1527> get_kb_item(...)
[13329]() NASL> [0x56214abfcf80 <- 1
[13329]() NASL> [0x56214ac05b80 <- 0
[13329]() NASL> [0x56214abfcec0 <- 6
[13329]() NASL> [0x56214abfdc00 <- 17
[13329]() NASL> [0x56214abfda60 <- 1
[13329]() NASL> [0x56214ac06020 <- 0
[13329]() NASL> [0x56214abfda00 <- 2
[13329]() NASL> [0x56214ab8ef20 <- 0
[13329]() NASL> [0x56214ac05fe0 <- 1
[13329]() NASL> [0x56214ac05fa0 <- 2
[13329]() NASL> [0x56214ac063b0 <- 3
[13329]() NASL> [0x56214abfc490 <- 4
[13329]() NASL> [0x56214abfd1e0 <- 5
[13329]() NASL> [0x56214ac05ea0 <- 6
[13329]() NASL> [0x56214abfef50 <- 7
[13329]() NASL> [0x56214ac05de0 <- 9
[13329]() NASL> [0x56214abfce60 <- 10
[13329]() NASL> [0x56214ac06100 <- 1
[13329]() NASL> [0x56214ac05f00 <- 2
[13329]() NASL> [0x56214ac06220 <- 4
[13329]() NASL> [0x56214abfdba0 <- 8
[13329]() NASL> [0x56214ac05c40 <- 16
[13329]() NASL> [0x56214ac05bc0 <- 32
[13329]() NASL> [0x56214abfcf20 <- 32768
[13329]() NASL> [0x56214ac061c0 <- 16384
[13329]() NASL> [0x56214ab8eec0 <- 8192
[13329]() NASL> [0x56214ab8f300 <- 8191
[13329]() NASL> [0x56214abfdac0 <- 0
[13329]() NASL> [0x56214ac060a0 <- 3
[13329]() NASL> [0x56214ac06160 <- 4
[13329]() NASL> [0x56214ac05f40 <- 5
[13329]() NASL> [0x56214ab8f380 <- 6
[13329]() NASL> [0x56214ab8f2a0 <- 7
[13329]() NASL> [0x56214ab8f340 <- 1
[13329]() NASL> [0x56214ac05e40 <- 2
[13329]() NASL> [0x56214abfdb20 <- 8
[13329]() NASL> [0x56214abfc4f0 <- 9
[13329]() NASL> [0x56214ab8f240 <- 10
[13329]() NASL> [0x56214ac01530 <- 1
[13329]() NASL> [0x56214abfc550 <- 0
[13329]() NASL> [0x56214abfc430 <- 1
[13329]() NASL> [0x56214ab8f1e0 <- 2
[13329]() NASL> [0x56214ac014f0 <- 3
[13329]() NASL> [0x56214ac014b0 <- 99
[13329]() NASL> [0x56214ac06770 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00b80 -> "192.168.232.129"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfff40 -> "80"
[13329]() NASL> [0x56214ab902f0 <- "www/192.168.232.129/80/is_broken"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_kb_item(1: "www/192.168.232.129/80/is_broken")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_kb_item: NULL
[13329]() NASL> [0x56214ab8c9d0 <- undef
NASL:1535> if (marked_broken) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8c9d0 -> undef
NASL:1533> _http_is_broken_array[(host) + (port)]=FALSE;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00b80 -> "192.168.232.129"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfff40 -> "80"
[13329]() NASL> [0x56214ac06810 <- 0
NASL:1534> marked_broken=FALSE;
[13329]() NASL> [0x56214ab8c9d0 <- 0
NASL:1537> return marked_broken;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8c9d0 -> 0
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return http_get_is_marked_broken: 0
NASL:0343> return default;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac02d20 -> "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_http_port: "80"
[13329]() NASL> [0x56214ab8ce40 <- "80"
NASL:0058> banner=get_http_banner(...);
NASL:0058> get_http_banner(...)
[13329]() NASL> [0x56214ab8d320 <- 1
[13329]() NASL> [0x56214ab8d260 <- 0
[13329]() NASL> [0x56214ac01ef0 <- 6
[13329]() NASL> [0x56214ac02940 <- 17
[13329]() NASL> [0x56214ac034b0 <- 1
[13329]() NASL> [0x56214ac03900 <- 0
[13329]() NASL> [0x56214ac03510 <- 2
[13329]() NASL> [0x56214ac03d00 <- 0
[13329]() NASL> [0x56214ab904b0 <- 1
[13329]() NASL> [0x56214ab8cf00 <- 2
[13329]() NASL> [0x56214ab8e250 <- 3
[13329]() NASL> [0x56214ab8dc80 <- 4
[13329]() NASL> [0x56214ab8d020 <- 5
[13329]() NASL> [0x56214ab8cd80 <- 6
[13329]() NASL> [0x56214ab8fdf0 <- 7
[13329]() NASL> [0x56214ab8d980 <- 9
[13329]() NASL> [0x56214ac04d40 <- 10
[13329]() NASL> [0x56214ab8d560 <- 1
[13329]() NASL> [0x56214ab8fad0 <- 2
[13329]() NASL> [0x56214ab8cea0 <- 4
[13329]() NASL> [0x56214ab8d9e0 <- 8
[13329]() NASL> [0x56214ac01b80 <- 16
[13329]() NASL> [0x56214ac02590 <- 32
[13329]() NASL> [0x56214ac02d20 <- 32768
[13329]() NASL> [0x56214ac03ca0 <- 16384
[13329]() NASL> [0x56214ac044d0 <- 8192
[13329]() NASL> [0x56214ab901a0 <- 8191
[13329]() NASL> [0x56214ac04110 <- 0
[13329]() NASL> [0x56214abfbc50 <- 3
[13329]() NASL> [0x56214ac02ce0 <- 4
[13329]() NASL> [0x56214ac030d0 <- 5
[13329]() NASL> [0x56214ac038a0 <- 6
[13329]() NASL> [0x56214ac040b0 <- 7
[13329]() NASL> [0x56214ab8d5c0 <- 1
[13329]() NASL> [0x56214ab8d4a0 <- 2
[13329]() NASL> [0x56214ab8cfc0 <- 8
[13329]() NASL> [0x56214ac04960 <- 9
[13329]() NASL> [0x56214ac04530 <- 10
[13329]() NASL> [0x56214ab90520 <- 1
[13329]() NASL> [0x56214ab8ccc0 <- 0
[13329]() NASL> [0x56214ab90af0 <- 1
[13329]() NASL> [0x56214ab8e100 <- 2
[13329]() NASL> [0x56214ac01f50 <- 3
[13329]() NASL> [0x56214ac025f0 <- 99
[13329]() NASL> [0x56214ab8eb30 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8ce40 -> "80"
[13329]() NASL> [0x56214ac029a0 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_http_banner(port: "80")
NASL:0224> local_var ...
NASL:0225> local_var ...
NASL:0232> if (! (port)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac029a0 -> "80"
NASL:0235> if (! (get_port_state(...))) { ... }
NASL:0232> get_port_state(...)
[13329]() NASL> [0x56214ac01be0 <- 1
[13329]() NASL> [0x56214abfd4f0 <- 0
[13329]() NASL> [0x56214abfe5f0 <- 6
[13329]() NASL> [0x56214ab8c9d0 <- 17
[13329]() NASL> [0x56214ab909c0 <- 1
[13329]() NASL> [0x56214ac04900 <- 0
[13329]() NASL> [0x56214abfe650 <- 2
[13329]() NASL> [0x56214abfd550 <- 0
[13329]() NASL> [0x56214abff700 <- 1
[13329]() NASL> [0x56214ac065c0 <- 2
[13329]() NASL> [0x56214ac06ba0 <- 3
[13329]() NASL> [0x56214ac06be0 <- 4
[13329]() NASL> [0x56214ac06ae0 <- 5
[13329]() NASL> [0x56214ac011a0 <- 6
[13329]() NASL> [0x56214ac06920 <- 7
[13329]() NASL> [0x56214abfd1e0 <- 9
[13329]() NASL> [0x56214ac063b0 <- 10
[13329]() NASL> [0x56214ac06410 <- 1
[13329]() NASL> [0x56214ac00510 <- 2
[13329]() NASL> [0x56214ac00570 <- 4
[13329]() NASL> [0x56214ac00220 <- 8
[13329]() NASL> [0x56214ac00280 <- 16
[13329]() NASL> [0x56214abff1d0 <- 32
[13329]() NASL> [0x56214abff230 <- 32768
[13329]() NASL> [0x56214abfff40 <- 16384
[13329]() NASL> [0x56214abfffa0 <- 8192
[13329]() NASL> [0x56214abfd690 <- 8191
[13329]() NASL> [0x56214abfd6f0 <- 0
[13329]() NASL> [0x56214abfe830 <- 3
[13329]() NASL> [0x56214abfe890 <- 4
[13329]() NASL> [0x56214abfe1a0 <- 5
[13329]() NASL> [0x56214abfe200 <- 6
[13329]() NASL> [0x56214abfe3c0 <- 7
[13329]() NASL> [0x56214abfe420 <- 1
[13329]() NASL> [0x56214abff9b0 <- 2
[13329]() NASL> [0x56214abffa10 <- 8
[13329]() NASL> [0x56214abfea80 <- 9
[13329]() NASL> [0x56214abfeae0 <- 10
[13329]() NASL> [0x56214abff460 <- 1
[13329]() NASL> [0x56214abff4c0 <- 0
[13329]() NASL> [0x56214ac00b20 <- 1
[13329]() NASL> [0x56214ac00b80 <- 2
[13329]() NASL> [0x56214abfdf90 <- 3
[13329]() NASL> [0x56214abfdff0 <- 99
[13329]() NASL> [0x56214abfd360 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac029a0 -> "80"
[13329]() NASL> [0x56214ac00810 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_port_state(1: "80")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_port_state: 1
NASL:0238> if (! (file)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d8c0 -> undef
NASL:0236> file="/";
[13329]() NASL> [0x56214ab8d8c0 <- "/"
NASL:0238> sb=strcat(...);
NASL:0238> strcat(...)
[13329]() NASL> [0x56214abfdf90 <- 1
[13329]() NASL> [0x56214ac00b80 <- 0
[13329]() NASL> [0x56214abfdff0 <- 6
[13329]() NASL> [0x56214abff4c0 <- 17
[13329]() NASL> [0x56214abfff40 <- 1
[13329]() NASL> [0x56214ac06410 <- 0
[13329]() NASL> [0x56214abff700 <- 2
[13329]() NASL> [0x56214ab8c9d0 <- 0
[13329]() NASL> [0x56214ac063b0 <- 1
[13329]() NASL> [0x56214abfd550 <- 2
[13329]() NASL> [0x56214abfe650 <- 3
[13329]() NASL> [0x56214abfd4f0 <- 4
[13329]() NASL> [0x56214abfe1a0 <- 5
[13329]() NASL> [0x56214abfd690 <- 6
[13329]() NASL> [0x56214ac01be0 <- 7
[13329]() NASL> [0x56214abfe5f0 <- 9
[13329]() NASL> [0x56214abff460 <- 10
[13329]() NASL> [0x56214abff9b0 <- 1
[13329]() NASL> [0x56214abfd6f0 <- 2
[13329]() NASL> [0x56214abfeae0 <- 4
[13329]() NASL> [0x56214abff230 <- 8
[13329]() NASL> [0x56214abfd3e0 <- 16
[13329]() NASL> [0x56214abfd360 <- 32
[13329]() NASL> [0x56214ac00b20 <- 32768
[13329]() NASL> [0x56214abfea80 <- 16384
[13329]() NASL> [0x56214abfd1e0 <- 8192
[13329]() NASL> [0x56214ac06ae0 <- 8191
[13329]() NASL> [0x56214ac00510 <- 0
[13329]() NASL> [0x56214abfe420 <- 3
[13329]() NASL> [0x56214abffa10 <- 4
[13329]() NASL> [0x56214abfe830 <- 5
[13329]() NASL> [0x56214ac06920 <- 6
[13329]() NASL> [0x56214abff1d0 <- 7
[13329]() NASL> [0x56214ac011a0 <- 1
[13329]() NASL> [0x56214abfffa0 <- 2
[13329]() NASL> [0x56214ac00570 <- 8
[13329]() NASL> [0x56214abfe200 <- 9
[13329]() NASL> [0x56214ac00280 <- 10
[13329]() NASL> [0x56214ac06be0 <- 1
[13329]() NASL> [0x56214ac04900 <- 0
[13329]() NASL> [0x56214abfe3c0 <- 1
[13329]() NASL> [0x56214abfe890 <- 2
[13329]() NASL> [0x56214ac00220 <- 3
[13329]() NASL> [0x56214ac06ba0 <- 99
[13329]() NASL> [0x56214ac065c0 <- "1.1.0.0"
[13329]() NASL> [0x56214ac01200 <- "www/real_banner/"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac029a0 -> "80"
[13329]() NASL> [0x56214ac06980 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d8c0 -> "/"
[13329]() NASL> [0x56214ac06600 <- "/"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strcat(1: "www/real_banner/", 2: "80", 3: "/")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strcat: "www/real_banner/80/"
[13329]() NASL> [0x56214ab8d0e0 <- "www/real_banner/80/"
NASL:0239> banner=get_kb_item(...);
NASL:0239> get_kb_item(...)
[13329]() NASL> [0x56214abfed20 <- 1
[13329]() NASL> [0x56214ac00220 <- 0
[13329]() NASL> [0x56214abfe890 <- 6
[13329]() NASL> [0x56214ac06ba0 <- 17
[13329]() NASL> [0x56214ac04900 <- 1
[13329]() NASL> [0x56214abfea80 <- 0
[13329]() NASL> [0x56214abff9b0 <- 2
[13329]() NASL> [0x56214ac063b0 <- 0
[13329]() NASL> [0x56214abff4c0 <- 1
[13329]() NASL> [0x56214abff460 <- 2
[13329]() NASL> [0x56214ab8c9d0 <- 3
[13329]() NASL> [0x56214abff700 <- 4
[13329]() NASL> [0x56214ac00b80 <- 5
[13329]() NASL> [0x56214abfe830 <- 6
[13329]() NASL> [0x56214abfff40 <- 7
[13329]() NASL> [0x56214ac06ae0 <- 9
[13329]() NASL> [0x56214abfdf90 <- 10
[13329]() NASL> [0x56214abfdff0 <- 1
[13329]() NASL> [0x56214ac06be0 <- 2
[13329]() NASL> [0x56214abfffa0 <- 4
[13329]() NASL> [0x56214ac00510 <- 8
[13329]() NASL> [0x56214ac00280 <- 16
[13329]() NASL> [0x56214ac00b20 <- 32
[13329]() NASL> [0x56214abfece0 <- 32768
[13329]() NASL> [0x56214ac065c0 <- 16384
[13329]() NASL> [0x56214abfe3c0 <- 8192
[13329]() NASL> [0x56214abfe200 <- 8191
[13329]() NASL> [0x56214abfe5f0 <- 0
[13329]() NASL> [0x56214abfe1a0 <- 3
[13329]() NASL> [0x56214abfd6f0 <- 4
[13329]() NASL> [0x56214ac011a0 <- 5
[13329]() NASL> [0x56214ac00570 <- 6
[13329]() NASL> [0x56214abfe420 <- 7
[13329]() NASL> [0x56214ac01be0 <- 1
[13329]() NASL> [0x56214abfd360 <- 2
[13329]() NASL> [0x56214abfd690 <- 8
[13329]() NASL> [0x56214abfd1e0 <- 9
[13329]() NASL> [0x56214abfeae0 <- 10
[13329]() NASL> [0x56214ac06920 <- 1
[13329]() NASL> [0x56214abfd3e0 <- 0
[13329]() NASL> [0x56214abfd4f0 <- 1
[13329]() NASL> [0x56214ac06410 <- 2
[13329]() NASL> [0x56214abff1d0 <- 3
[13329]() NASL> [0x56214abffa10 <- 99
[13329]() NASL> [0x56214abff230 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d0e0 -> "www/real_banner/80/"
[13329]() NASL> [0x56214ac06600 <- "www/real_banner/80/"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_kb_item(1: "www/real_banner/80/")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_kb_item: NULL
[13329]() NASL> [0x56214ab8d440 <- undef
NASL:0247> if (banner) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d440 -> undef
NASL:0247> sb=strcat(...);
NASL:0247> strcat(...)
[13329]() NASL> [0x56214abff1d0 <- 1
[13329]() NASL> [0x56214ac06410 <- 0
[13329]() NASL> [0x56214abffa10 <- 6
[13329]() NASL> [0x56214abfd3e0 <- 17
[13329]() NASL> [0x56214ac065c0 <- 1
[13329]() NASL> [0x56214abfdff0 <- 0
[13329]() NASL> [0x56214abff4c0 <- 2
[13329]() NASL> [0x56214ac06ba0 <- 0
[13329]() NASL> [0x56214abfdf90 <- 1
[13329]() NASL> [0x56214ac063b0 <- 2
[13329]() NASL> [0x56214abff9b0 <- 3
[13329]() NASL> [0x56214ac00220 <- 4
[13329]() NASL> [0x56214ac011a0 <- 5
[13329]() NASL> [0x56214ac04900 <- 6
[13329]() NASL> [0x56214abfe200 <- 7
[13329]() NASL> [0x56214abfed20 <- 9
[13329]() NASL> [0x56214abfe890 <- 10
[13329]() NASL> [0x56214ac06920 <- 1
[13329]() NASL> [0x56214abfd360 <- 2
[13329]() NASL> [0x56214abfe5f0 <- 4
[13329]() NASL> [0x56214abfeae0 <- 8
[13329]() NASL> [0x56214abfece0 <- 16
[13329]() NASL> [0x56214abfe650 <- 32
[13329]() NASL> [0x56214abff230 <- 32768
[13329]() NASL> [0x56214abfd4f0 <- 16384
[13329]() NASL> [0x56214abfd1e0 <- 8192
[13329]() NASL> [0x56214ac06ae0 <- 8191
[13329]() NASL> [0x56214ac00b80 <- 0
[13329]() NASL> [0x56214ac06be0 <- 3
[13329]() NASL> [0x56214ac01be0 <- 4
[13329]() NASL> [0x56214abfd690 <- 5
[13329]() NASL> [0x56214abfe1a0 <- 6
[13329]() NASL> [0x56214abfff40 <- 7
[13329]() NASL> [0x56214ac00b20 <- 1
[13329]() NASL> [0x56214abfe830 <- 2
[13329]() NASL> [0x56214abfe3c0 <- 8
[13329]() NASL> [0x56214abfffa0 <- 9
[13329]() NASL> [0x56214ac00570 <- 10
[13329]() NASL> [0x56214ac00280 <- 1
[13329]() NASL> [0x56214abff700 <- 0
[13329]() NASL> [0x56214abfea80 <- 1
[13329]() NASL> [0x56214abfe420 <- 2
[13329]() NASL> [0x56214abfd6f0 <- 3
[13329]() NASL> [0x56214ac00510 <- 99
[13329]() NASL> [0x56214ab8c9d0 <- "1.1.0.0"
[13329]() NASL> [0x56214ac06980 <- "www/banner/"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac029a0 -> "80"
[13329]() NASL> [0x56214ac06600 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d8c0 -> "/"
[13329]() NASL> [0x56214ac01200 <- "/"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strcat(1: "www/banner/", 2: "80", 3: "/")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strcat: "www/banner/80/"
[13329]() NASL> [0x56214ab8d0e0 <- "www/banner/80/"
NASL:0248> banner=get_kb_item(...);
NASL:0248> get_kb_item(...)
[13329]() NASL> [0x56214abfd880 <- 1
[13329]() NASL> [0x56214abfd6f0 <- 0
[13329]() NASL> [0x56214abfe420 <- 6
[13329]() NASL> [0x56214ac00510 <- 17
[13329]() NASL> [0x56214abff700 <- 1
[13329]() NASL> [0x56214abfd4f0 <- 0
[13329]() NASL> [0x56214ac06920 <- 2
[13329]() NASL> [0x56214abfdf90 <- 0
[13329]() NASL> [0x56214abfd3e0 <- 1
[13329]() NASL> [0x56214abfe890 <- 2
[13329]() NASL> [0x56214ac06ba0 <- 3
[13329]() NASL> [0x56214abff4c0 <- 4
[13329]() NASL> [0x56214ac06410 <- 5
[13329]() NASL> [0x56214abfd690 <- 6
[13329]() NASL> [0x56214ac065c0 <- 7
[13329]() NASL> [0x56214ac06ae0 <- 9
[13329]() NASL> [0x56214abff1d0 <- 10
[13329]() NASL> [0x56214abffa10 <- 1
[13329]() NASL> [0x56214ac00280 <- 2
[13329]() NASL> [0x56214abfe830 <- 4
[13329]() NASL> [0x56214ac00b80 <- 8
[13329]() NASL> [0x56214ac00570 <- 16
[13329]() NASL> [0x56214abff230 <- 32
[13329]() NASL> [0x56214abff460 <- 32768
[13329]() NASL> [0x56214ab8c9d0 <- 16384
[13329]() NASL> [0x56214abfea80 <- 8192
[13329]() NASL> [0x56214abfffa0 <- 8191
[13329]() NASL> [0x56214abfed20 <- 0
[13329]() NASL> [0x56214ac011a0 <- 3
[13329]() NASL> [0x56214abfd360 <- 4
[13329]() NASL> [0x56214ac00b20 <- 5
[13329]() NASL> [0x56214abfe3c0 <- 6
[13329]() NASL> [0x56214ac06be0 <- 7
[13329]() NASL> [0x56214abfe200 <- 1
[13329]() NASL> [0x56214abfe650 <- 2
[13329]() NASL> [0x56214ac04900 <- 8
[13329]() NASL> [0x56214abfd1e0 <- 9
[13329]() NASL> [0x56214abfe5f0 <- 10
[13329]() NASL> [0x56214abfe1a0 <- 1
[13329]() NASL> [0x56214abfece0 <- 0
[13329]() NASL> [0x56214ac00220 <- 1
[13329]() NASL> [0x56214abfdff0 <- 2
[13329]() NASL> [0x56214abfff40 <- 3
[13329]() NASL> [0x56214ac01be0 <- 99
[13329]() NASL> [0x56214abfeae0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d0e0 -> "www/banner/80/"
[13329]() NASL> [0x56214ac01200 <- "www/banner/80/"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_kb_item(1: "www/banner/80/")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_kb_item: NULL
[13329]() NASL> [0x56214ab8d440 <- undef
NASL:0252> if (banner) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d440 -> undef
NASL:0258> if ((! (ignore_broken)) && (http_get_is_marked_broken(...))) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac04da0 -> undef
NASL:0252> http_get_is_marked_broken(...)
[13329]() NASL> [0x56214ac00e80 <- 1
[13329]() NASL> [0x56214abfff40 <- 0
[13329]() NASL> [0x56214abfdff0 <- 6
[13329]() NASL> [0x56214ac01be0 <- 17
[13329]() NASL> [0x56214abfece0 <- 1
[13329]() NASL> [0x56214ab8c9d0 <- 0
[13329]() NASL> [0x56214abffa10 <- 2
[13329]() NASL> [0x56214abfd3e0 <- 0
[13329]() NASL> [0x56214ac00510 <- 1
[13329]() NASL> [0x56214abff1d0 <- 2
[13329]() NASL> [0x56214abfdf90 <- 3
[13329]() NASL> [0x56214ac06920 <- 4
[13329]() NASL> [0x56214abfd6f0 <- 5
[13329]() NASL> [0x56214ac00b20 <- 6
[13329]() NASL> [0x56214abff700 <- 7
[13329]() NASL> [0x56214abfffa0 <- 9
[13329]() NASL> [0x56214abfd880 <- 10
[13329]() NASL> [0x56214abfe420 <- 1
[13329]() NASL> [0x56214abfe1a0 <- 2
[13329]() NASL> [0x56214abfe650 <- 4
[13329]() NASL> [0x56214abfed20 <- 8
[13329]() NASL> [0x56214abfe5f0 <- 16
[13329]() NASL> [0x56214abff460 <- 32
[13329]() NASL> [0x56214abff9b0 <- 32768
[13329]() NASL> [0x56214abfeae0 <- 16384
[13329]() NASL> [0x56214ac00220 <- 8192
[13329]() NASL> [0x56214abfd1e0 <- 8191
[13329]() NASL> [0x56214ac06ae0 <- 0
[13329]() NASL> [0x56214ac06410 <- 3
[13329]() NASL> [0x56214ac00280 <- 4
[13329]() NASL> [0x56214abfe200 <- 5
[13329]() NASL> [0x56214ac04900 <- 6
[13329]() NASL> [0x56214ac011a0 <- 7
[13329]() NASL> [0x56214ac065c0 <- 1
[13329]() NASL> [0x56214abff230 <- 2
[13329]() NASL> [0x56214abfd690 <- 8
[13329]() NASL> [0x56214abfea80 <- 9
[13329]() NASL> [0x56214abfe830 <- 10
[13329]() NASL> [0x56214abfe3c0 <- 1
[13329]() NASL> [0x56214ac00570 <- 0
[13329]() NASL> [0x56214abff4c0 <- 1
[13329]() NASL> [0x56214abfd4f0 <- 2
[13329]() NASL> [0x56214ac06be0 <- 3
[13329]() NASL> [0x56214abfd360 <- 99
[13329]() NASL> [0x56214ac00b80 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac029a0 -> "80"
[13329]() NASL> [0x56214abfe890 <- "80"
[13329]() NASL> [0x56214ac00ec0 <- "*"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call http_get_is_marked_broken(port: "80", host: "*")
NASL:1491> local_var ...
NASL:1492> local_var ...
NASL:1500> if (! (port)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe890 -> "80"
NASL:1507> if (! (host)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00ec0 -> "*"
NASL:1514> if (! (isnull(...))) { ... }
NASL:1507> isnull(...)
[13329]() NASL> [0x56214ac01840 <- 1
[13329]() NASL> [0x56214ac01880 <- 0
[13329]() NASL> [0x56214ab8ef50 <- 6
[13329]() NASL> [0x56214ab902c0 <- 17
[13329]() NASL> [0x56214ac06480 <- 1
[13329]() NASL> [0x56214ac064c0 <- 0
[13329]() NASL> [0x56214ac06500 <- 2
[13329]() NASL> [0x56214abfdba0 <- 0
[13329]() NASL> [0x56214abfdbe0 <- 1
[13329]() NASL> [0x56214abfdc20 <- 2
[13329]() NASL> [0x56214ac066d0 <- 3
[13329]() NASL> [0x56214ac06730 <- 4
[13329]() NASL> [0x56214ac06790 <- 5
[13329]() NASL> [0x56214abfda20 <- 6
[13329]() NASL> [0x56214abfda80 <- 7
[13329]() NASL> [0x56214abfdae0 <- 9
[13329]() NASL> [0x56214abfdb40 <- 10
[13329]() NASL> [0x56214abfc430 <- 1
[13329]() NASL> [0x56214abfc490 <- 2
[13329]() NASL> [0x56214abfc4f0 <- 4
[13329]() NASL> [0x56214abfc550 <- 8
[13329]() NASL> [0x56214ab8f1e0 <- 16
[13329]() NASL> [0x56214ab8f240 <- 32
[13329]() NASL> [0x56214ab8f2a0 <- 32768
[13329]() NASL> [0x56214ab8f300 <- 16384
[13329]() NASL> [0x56214ab8f360 <- 8192
[13329]() NASL> [0x56214abfce40 <- 8191
[13329]() NASL> [0x56214abfcea0 <- 0
[13329]() NASL> [0x56214abfcf00 <- 3
[13329]() NASL> [0x56214abfcf60 <- 4
[13329]() NASL> [0x56214abfcfc0 <- 5
[13329]() NASL> [0x56214abfd020 <- 6
[13329]() NASL> [0x56214ac05de0 <- 7
[13329]() NASL> [0x56214ac05e40 <- 1
[13329]() NASL> [0x56214ac05ea0 <- 2
[13329]() NASL> [0x56214ac05f00 <- 8
[13329]() NASL> [0x56214ac05f60 <- 9
[13329]() NASL> [0x56214ac05fc0 <- 10
[13329]() NASL> [0x56214ac06020 <- 1
[13329]() NASL> [0x56214ac06080 <- 0
[13329]() NASL> [0x56214ac060e0 <- 1
[13329]() NASL> [0x56214ac06140 <- 2
[13329]() NASL> [0x56214ac061a0 <- 3
[13329]() NASL> [0x56214ac06200 <- 99
[13329]() NASL> [0x56214ac06260 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00ec0 -> "*"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe890 -> "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06f30 -> undef
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call isnull(1: NULL)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return isnull: 1
NASL:1528> if (host == "*") { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00ec0 -> "*"
NASL:1515> marked_broken_list=get_kb_list(...);
NASL:1515> get_kb_list(...)
[13329]() NASL> [0x56214ac06140 <- 1
[13329]() NASL> [0x56214ac06200 <- 0
[13329]() NASL> [0x56214ac06080 <- 6
[13329]() NASL> [0x56214ab8f300 <- 17
[13329]() NASL> [0x56214abfc430 <- 1
[13329]() NASL> [0x56214abfdbe0 <- 0
[13329]() NASL> [0x56214ab902c0 <- 2
[13329]() NASL> [0x56214abfdb40 <- 0
[13329]() NASL> [0x56214abfdba0 <- 1
[13329]() NASL> [0x56214ac06500 <- 2
[13329]() NASL> [0x56214ac01880 <- 3
[13329]() NASL> [0x56214abfcfc0 <- 4
[13329]() NASL> [0x56214ac06480 <- 5
[13329]() NASL> [0x56214abfce40 <- 6
[13329]() NASL> [0x56214ac01840 <- 7
[13329]() NASL> [0x56214ac06020 <- 9
[13329]() NASL> [0x56214ac05ea0 <- 10
[13329]() NASL> [0x56214abfcea0 <- 1
[13329]() NASL> [0x56214ac05fc0 <- 2
[13329]() NASL> [0x56214ab8f2a0 <- 4
[13329]() NASL> [0x56214ac062e0 <- 8
[13329]() NASL> [0x56214ac06260 <- 16
[13329]() NASL> [0x56214ac060e0 <- 32
[13329]() NASL> [0x56214ac05f60 <- 32768
[13329]() NASL> [0x56214abfdae0 <- 16384
[13329]() NASL> [0x56214abfc490 <- 8192
[13329]() NASL> [0x56214ac05e40 <- 8191
[13329]() NASL> [0x56214ac05f00 <- 0
[13329]() NASL> [0x56214abfcf00 <- 3
[13329]() NASL> [0x56214abfda80 <- 4
[13329]() NASL> [0x56214ab8f240 <- 5
[13329]() NASL> [0x56214abfda20 <- 6
[13329]() NASL> [0x56214ab8f360 <- 7
[13329]() NASL> [0x56214abfc4f0 <- 1
[13329]() NASL> [0x56214abfd020 <- 2
[13329]() NASL> [0x56214ab8f1e0 <- 8
[13329]() NASL> [0x56214ac06730 <- 9
[13329]() NASL> [0x56214ac064c0 <- 10
[13329]() NASL> [0x56214ac05de0 <- 1
[13329]() NASL> [0x56214abfcf60 <- 0
[13329]() NASL> [0x56214abfc550 <- 1
[13329]() NASL> [0x56214ac066d0 <- 2
[13329]() NASL> [0x56214abfdc20 <- 3
[13329]() NASL> [0x56214ac06eb0 <- 99
[13329]() NASL> [0x56214ac06dc0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe890 -> "80"
[13329]() NASL> [0x56214ac06e80 <- "www/*/80/is_broken"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_kb_list(1: "www/*/80/is_broken")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_kb_list: FAKE
[13329]() NASL> [0x56214ac063b0 <- undef
NASL:1525> if ((! (marked_broken_list)) || (*54*)) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac063b0 -> undef
NASL:1517> marked_broken=FALSE;
[13329]() NASL> [0x56214abfd8c0 <- 0
NASL:1535> if (marked_broken) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd8c0 -> 0
NASL:1533> _http_is_broken_array[(host) + (port)]=FALSE;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00ec0 -> "*"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe890 -> "80"
[13329]() NASL> [0x56214ac06f30 <- 0
NASL:1534> marked_broken=FALSE;
[13329]() NASL> [0x56214abfd8c0 <- 0
NASL:1537> return marked_broken;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd8c0 -> 0
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return http_get_is_marked_broken: 0
NASL:0258> req=http_get(...);
NASL:0258> http_get(...)
[13329]() NASL> [0x56214ac06be0 <- 1
[13329]() NASL> [0x56214abfd4f0 <- 0
[13329]() NASL> [0x56214abfd360 <- 6
[13329]() NASL> [0x56214ac00570 <- 17
[13329]() NASL> [0x56214abfeae0 <- 1
[13329]() NASL> [0x56214abfe420 <- 0
[13329]() NASL> [0x56214ac00510 <- 2
[13329]() NASL> [0x56214ac01be0 <- 0
[13329]() NASL> [0x56214abfd880 <- 1
[13329]() NASL> [0x56214abfd3e0 <- 2
[13329]() NASL> [0x56214abffa10 <- 3
[13329]() NASL> [0x56214abfff40 <- 4
[13329]() NASL> [0x56214abfe200 <- 5
[13329]() NASL> [0x56214abfece0 <- 6
[13329]() NASL> [0x56214abfd1e0 <- 7
[13329]() NASL> [0x56214ac00e80 <- 9
[13329]() NASL> [0x56214abfdff0 <- 10
[13329]() NASL> [0x56214abfe890 <- 1
[13329]() NASL> [0x56214abfe3c0 <- 2
[13329]() NASL> [0x56214abff230 <- 4
[13329]() NASL> [0x56214ac06ae0 <- 8
[13329]() NASL> [0x56214abfe830 <- 16
[13329]() NASL> [0x56214abff9b0 <- 32
[13329]() NASL> [0x56214ac063b0 <- 32768
[13329]() NASL> [0x56214ac06ba0 <- 16384
[13329]() NASL> [0x56214ac00b80 <- 8192
[13329]() NASL> [0x56214abff4c0 <- 8191
[13329]() NASL> [0x56214abfea80 <- 0
[13329]() NASL> [0x56214abfffa0 <- 3
[13329]() NASL> [0x56214abfd6f0 <- 4
[13329]() NASL> [0x56214abfe1a0 <- 5
[13329]() NASL> [0x56214ac065c0 <- 6
[13329]() NASL> [0x56214abfd690 <- 7
[13329]() NASL> [0x56214ac06410 <- 1
[13329]() NASL> [0x56214abff700 <- 2
[13329]() NASL> [0x56214abff460 <- 8
[13329]() NASL> [0x56214ac00b20 <- 9
[13329]() NASL> [0x56214abfd8c0 <- 10
[13329]() NASL> [0x56214ac00220 <- 1
[13329]() NASL> [0x56214abfe650 <- 0
[13329]() NASL> [0x56214abfd550 <- 1
[13329]() NASL> [0x56214ac00ec0 <- 2
[13329]() NASL> [0x56214ac04900 <- 3
[13329]() NASL> [0x56214abfe5f0 <- 99
[13329]() NASL> [0x56214ac06920 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d8c0 -> "/"
[13329]() NASL> [0x56214ac011a0 <- "/"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac029a0 -> "80"
[13329]() NASL> [0x56214ac00280 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call http_get(item: "/", port: "80")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return http_get: "GET / HTTP/1.1
Connection: Close
Host: 192.168.232.129
Pragma: no-cache..."
[13329]() NASL> [0x56214ab90560 <- "GET / HTTP/1.1
Connection: Close
Host: 192.168.232.129
Pragma: no-cache
Cache-Control: no-cache
User-Agent: Mozilla/5.0 [en] (X11, U; Mageni UA 1.1.0.0)
Accept: image/gif, image/x-xbitmap, image/jpeg, image/pjpeg, image/png, */*
Accept-Language: en
Accept-Charset: iso-8859-1,*,utf-8

"
NASL:0259> soc=http_open_socket(...);
NASL:0259> http_open_socket(...)
[13329]() NASL> [0x56214ac066d0 <- 1
[13329]() NASL> [0x56214ac04900 <- 0
[13329]() NASL> [0x56214ac00ec0 <- 6
[13329]() NASL> [0x56214abfe5f0 <- 17
[13329]() NASL> [0x56214abfe650 <- 1
[13329]() NASL> [0x56214ac06ba0 <- 0
[13329]() NASL> [0x56214abfe890 <- 2
[13329]() NASL> [0x56214abfd880 <- 0
[13329]() NASL> [0x56214ac00570 <- 1
[13329]() NASL> [0x56214abfdff0 <- 2
[13329]() NASL> [0x56214ac01be0 <- 3
[13329]() NASL> [0x56214ac00510 <- 4
[13329]() NASL> [0x56214abfd4f0 <- 5
[13329]() NASL> [0x56214abfe1a0 <- 6
[13329]() NASL> [0x56214abfeae0 <- 7
[13329]() NASL> [0x56214abff4c0 <- 9
[13329]() NASL> [0x56214ac06be0 <- 10
[13329]() NASL> [0x56214abfd360 <- 1
[13329]() NASL> [0x56214ac00280 <- 2
[13329]() NASL> [0x56214ac00220 <- 4
[13329]() NASL> [0x56214abff700 <- 8
[13329]() NASL> [0x56214abfea80 <- 16
[13329]() NASL> [0x56214abfd8c0 <- 32
[13329]() NASL> [0x56214ac063b0 <- 32768
[13329]() NASL> [0x56214ab8c9d0 <- 16384
[13329]() NASL> [0x56214ac06920 <- 8192
[13329]() NASL> [0x56214abfd550 <- 8191
[13329]() NASL> [0x56214ac00b20 <- 0
[13329]() NASL> [0x56214ac00e80 <- 3
[13329]() NASL> [0x56214abfe200 <- 4
[13329]() NASL> [0x56214abfe3c0 <- 5
[13329]() NASL> [0x56214ac06410 <- 6
[13329]() NASL> [0x56214abfed20 <- 7
[13329]() NASL> [0x56214abff460 <- 1
[13329]() NASL> [0x56214abfffa0 <- 2
[13329]() NASL> [0x56214abfd1e0 <- 8
[13329]() NASL> [0x56214abff9b0 <- 9
[13329]() NASL> [0x56214abfece0 <- 10
[13329]() NASL> [0x56214ac00b80 <- 1
[13329]() NASL> [0x56214abff230 <- 0
[13329]() NASL> [0x56214ac065c0 <- 1
[13329]() NASL> [0x56214abfe830 <- 2
[13329]() NASL> [0x56214abfff40 <- 3
[13329]() NASL> [0x56214abfe420 <- 99
[13329]() NASL> [0x56214ac011a0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac029a0 -> "80"
[13329]() NASL> [0x56214ac06600 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call http_open_socket(1: "80")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return http_open_socket: 1000000
[13329]() NASL> [0x56214ab8d200 <- 1000000
NASL:0263> if (! (soc)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d200 -> 1000000
NASL:0263> send(...)
[13329]() NASL> [0x56214abff1d0 <- 1
[13329]() NASL> [0x56214ac06370 <- 0
[13329]() NASL> [0x56214abfff40 <- 6
[13329]() NASL> [0x56214abfe830 <- 17
[13329]() NASL> [0x56214abfe420 <- 1
[13329]() NASL> [0x56214abff230 <- 0
[13329]() NASL> [0x56214ab8c9d0 <- 2
[13329]() NASL> [0x56214abfd360 <- 0
[13329]() NASL> [0x56214ac00570 <- 1
[13329]() NASL> [0x56214abfe5f0 <- 2
[13329]() NASL> [0x56214ac06be0 <- 3
[13329]() NASL> [0x56214abfd880 <- 4
[13329]() NASL> [0x56214abfe890 <- 5
[13329]() NASL> [0x56214ac04900 <- 6
[13329]() NASL> [0x56214abfe3c0 <- 7
[13329]() NASL> [0x56214abfe650 <- 9
[13329]() NASL> [0x56214abfd550 <- 10
[13329]() NASL> [0x56214ac066d0 <- 1
[13329]() NASL> [0x56214ac00ec0 <- 2
[13329]() NASL> [0x56214ac00b80 <- 4
[13329]() NASL> [0x56214abfffa0 <- 8
[13329]() NASL> [0x56214ac00b20 <- 16
[13329]() NASL> [0x56214abfece0 <- 32
[13329]() NASL> [0x56214ac063b0 <- 32768
[13329]() NASL> [0x56214abfd690 <- 16384
[13329]() NASL> [0x56214ac011a0 <- 8192
[13329]() NASL> [0x56214ac065c0 <- 8191
[13329]() NASL> [0x56214abff9b0 <- 0
[13329]() NASL> [0x56214abff4c0 <- 3
[13329]() NASL> [0x56214abfd4f0 <- 4
[13329]() NASL> [0x56214ac00280 <- 5
[13329]() NASL> [0x56214abff460 <- 6
[13329]() NASL> [0x56214abfd6f0 <- 7
[13329]() NASL> [0x56214abfd1e0 <- 1
[13329]() NASL> [0x56214ac00e80 <- 2
[13329]() NASL> [0x56214abfeae0 <- 8
[13329]() NASL> [0x56214abfd8c0 <- 9
[13329]() NASL> [0x56214abfe1a0 <- 10
[13329]() NASL> [0x56214ac06ae0 <- 1
[13329]() NASL> [0x56214ac06920 <- 0
[13329]() NASL> [0x56214ac00220 <- 1
[13329]() NASL> [0x56214ac06410 <- 2
[13329]() NASL> [0x56214abfea80 <- 3
[13329]() NASL> [0x56214ac00510 <- 99
[13329]() NASL> [0x56214ac06ba0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d200 -> 1000000
[13329]() NASL> [0x56214abfe200 <- 1000000
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab90560 -> "GET / HTTP/1.1
Connection: Close
Host: 192.168.232.129
Pragma: no-cache
Cache-Control: no-cache
User-Agent: Mozilla/5.0 [en] (X11, U; Mageni UA 1.1.0.0)
Accept: image/gif, image/x-xbitmap, image/jpeg, image/pjpeg, image/png, */*
Accept-Language: en
Accept-Charset: iso-8859-1,*,utf-8

"
[13329]() NASL> [0x56214abff700 <- "GET / HTTP/1.1
Connection: Close
Host: 192.168.232.129
Pragma: no-cache
Cache-Control: no-cache
User-Agent: Mozilla/5.0 [en] (X11, U; Mageni UA 1.1.0.0)
Accept: image/gif, image/x-xbitmap, image/jpeg, image/pjpeg, image/png, */*
Accept-Language: en
Accept-Charset: iso-8859-1,*,utf-8

"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call send(socket: 1000000, data: "GET / HTTP/1.1
Connection: Close
Host: 192.168.232.129
Pragma: no-cache...")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return send: 295
NASL:0264> banner=http_recv_headers2(...);
NASL:0264> http_recv_headers2(...)
[13329]() NASL> [0x56214abfea80 <- 1
[13329]() NASL> [0x56214ac06410 <- 0
[13329]() NASL> [0x56214ac00510 <- 6
[13329]() NASL> [0x56214ac06920 <- 17
[13329]() NASL> [0x56214abfd690 <- 1
[13329]() NASL> [0x56214ac066d0 <- 0
[13329]() NASL> [0x56214ac01be0 <- 2
[13329]() NASL> [0x56214ac00570 <- 0
[13329]() NASL> [0x56214abfe830 <- 1
[13329]() NASL> [0x56214abfd550 <- 2
[13329]() NASL> [0x56214abfd360 <- 3
[13329]() NASL> [0x56214ab8c9d0 <- 4
[13329]() NASL> [0x56214ac06370 <- 5
[13329]() NASL> [0x56214ac00280 <- 6
[13329]() NASL> [0x56214abfe420 <- 7
[13329]() NASL> [0x56214abfdff0 <- 9
[13329]() NASL> [0x56214ac065c0 <- 10
[13329]() NASL> [0x56214abff1d0 <- 1
[13329]() NASL> [0x56214abfff40 <- 2
[13329]() NASL> [0x56214ac06ae0 <- 4
[13329]() NASL> [0x56214ac00e80 <- 8
[13329]() NASL> [0x56214abff9b0 <- 16
[13329]() NASL> [0x56214abfe1a0 <- 32
[13329]() NASL> [0x56214ac063b0 <- 32768
[13329]() NASL> [0x56214abfed20 <- 16384
[13329]() NASL> [0x56214ac06ba0 <- 8192
[13329]() NASL> [0x56214ac00220 <- 8191
[13329]() NASL> [0x56214abfd8c0 <- 0
[13329]() NASL> [0x56214abfe650 <- 3
[13329]() NASL> [0x56214abfe890 <- 4
[13329]() NASL> [0x56214ac00ec0 <- 5
[13329]() NASL> [0x56214abfd1e0 <- 6
[13329]() NASL> [0x56214abff700 <- 7
[13329]() NASL> [0x56214abfeae0 <- 1
[13329]() NASL> [0x56214abff4c0 <- 2
[13329]() NASL> [0x56214abfe3c0 <- 8
[13329]() NASL> [0x56214abfe200 <- 9
[13329]() NASL> [0x56214abfece0 <- 10
[13329]() NASL> [0x56214ac04900 <- 1
[13329]() NASL> [0x56214ac011a0 <- 0
[13329]() NASL> [0x56214ac00b80 <- 1
[13329]() NASL> [0x56214abff460 <- 2
[13329]() NASL> [0x56214ac00b20 <- 3
[13329]() NASL> [0x56214abfd880 <- 99
[13329]() NASL> [0x56214abff230 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d200 -> 1000000
[13329]() NASL> [0x56214abfd4f0 <- 1000000
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call http_recv_headers2(socket: 1000000)
NASL:0627> local_var ...
NASL:0628> local_var ...
NASL:0635> if (! (socket)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> 1000000
NASL:0647> while (TRUE) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfea80 -> 1
NASL:0637> line=recv_line(...);
NASL:0637> recv_line(...)
[13329]() NASL> [0x56214abfd3e0 <- 1
[13329]() NASL> [0x56214abfdae0 <- 0
[13329]() NASL> [0x56214abfdb20 <- 6
[13329]() NASL> [0x56214abfef70 <- 17
[13329]() NASL> [0x56214abfefb0 <- 1
[13329]() NASL> [0x56214abfda00 <- 0
[13329]() NASL> [0x56214abfda40 <- 2
[13329]() NASL> [0x56214abfda80 <- 0
[13329]() NASL> [0x56214ac01800 <- 1
[13329]() NASL> [0x56214ac01840 <- 2
[13329]() NASL> [0x56214ac01880 <- 3
[13329]() NASL> [0x56214ab8f2f0 <- 4
[13329]() NASL> [0x56214ab8f330 <- 5
[13329]() NASL> [0x56214ab8f370 <- 6
[13329]() NASL> [0x56214ac06e60 <- 7
[13329]() NASL> [0x56214ac06ea0 <- 9
[13329]() NASL> [0x56214ac06ee0 <- 10
[13329]() NASL> [0x56214ac06480 <- 1
[13329]() NASL> [0x56214ac064e0 <- 2
[13329]() NASL> [0x56214ac06520 <- 4
[13329]() NASL> [0x56214ab90240 <- 8
[13329]() NASL> [0x56214ab902a0 <- 16
[13329]() NASL> [0x56214ac07040 <- 32
[13329]() NASL> [0x56214ac07080 <- 32768
[13329]() NASL> [0x56214ac070e0 <- 16384
[13329]() NASL> [0x56214ab8eee0 <- 8192
[13329]() NASL> [0x56214ab8ef40 <- 8191
[13329]() NASL> [0x56214abfdba0 <- 0
[13329]() NASL> [0x56214abfdc00 <- 3
[13329]() NASL> [0x56214ac06710 <- 4
[13329]() NASL> [0x56214ac06770 <- 5
[13329]() NASL> [0x56214ac067d0 <- 6
[13329]() NASL> [0x56214ac05dc0 <- 7
[13329]() NASL> [0x56214ac05e20 <- 1
[13329]() NASL> [0x56214ac05e80 <- 2
[13329]() NASL> [0x56214ac05ee0 <- 8
[13329]() NASL> [0x56214ac05f40 <- 9
[13329]() NASL> [0x56214ac05fa0 <- 10
[13329]() NASL> [0x56214ac06000 <- 1
[13329]() NASL> [0x56214ac06060 <- 0
[13329]() NASL> [0x56214ac060c0 <- 1
[13329]() NASL> [0x56214ac06120 <- 2
[13329]() NASL> [0x56214ac06180 <- 3
[13329]() NASL> [0x56214ac061e0 <- 99
[13329]() NASL> [0x56214ac06240 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> 1000000
[13329]() NASL> [0x56214ac172c0 <- 1000000
[13329]() NASL> [0x56214ac17280 <- 4096
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call recv_line(socket: 1000000, length: 4096)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return recv_line: "HTTP/1.1 200 OK
"
[13329]() NASL> [0x56214ac06be0 <- "HTTP/1.1 200 OK
"
NASL:0638> buf+= (line);
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe5f0 -> undef
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "HTTP/1.1 200 OK
"
[13329]() NASL> [0x56214abfe5f0 <- "HTTP/1.1 200 OK
"
NASL:0641> if (line == "
") { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "HTTP/1.1 200 OK
"
NASL:0643> if (! (strlen(...))) { ... }
NASL:0641> strlen(...)
[13329]() NASL> [0x56214ac06120 <- 1
[13329]() NASL> [0x56214ac061e0 <- 0
[13329]() NASL> [0x56214ac06180 <- 6
[13329]() NASL> [0x56214abfc540 <- 17
[13329]() NASL> [0x56214ac06060 <- 1
[13329]() NASL> [0x56214ac070e0 <- 0
[13329]() NASL> [0x56214ac06480 <- 2
[13329]() NASL> [0x56214ac01800 <- 0
[13329]() NASL> [0x56214abfef70 <- 1
[13329]() NASL> [0x56214abfda80 <- 2
[13329]() NASL> [0x56214abfda40 <- 3
[13329]() NASL> [0x56214abfdae0 <- 4
[13329]() NASL> [0x56214ac06770 <- 5
[13329]() NASL> [0x56214abfefb0 <- 6
[13329]() NASL> [0x56214ac17280 <- 7
[13329]() NASL> [0x56214ab8ef40 <- 9
[13329]() NASL> [0x56214abfd3e0 <- 10
[13329]() NASL> [0x56214abfdb20 <- 1
[13329]() NASL> [0x56214ac06000 <- 2
[13329]() NASL> [0x56214ac05e80 <- 4
[13329]() NASL> [0x56214abfdba0 <- 8
[13329]() NASL> [0x56214ac05fa0 <- 16
[13329]() NASL> [0x56214ac07080 <- 32
[13329]() NASL> [0x56214ac062c0 <- 32768
[13329]() NASL> [0x56214ac06240 <- 16384
[13329]() NASL> [0x56214ac060c0 <- 8192
[13329]() NASL> [0x56214ac05f40 <- 8191
[13329]() NASL> [0x56214ac06ea0 <- 0
[13329]() NASL> [0x56214ab8f330 <- 3
[13329]() NASL> [0x56214ac064e0 <- 4
[13329]() NASL> [0x56214ac05e20 <- 5
[13329]() NASL> [0x56214ac05ee0 <- 6
[13329]() NASL> [0x56214abfdc00 <- 7
[13329]() NASL> [0x56214ac06e60 <- 1
[13329]() NASL> [0x56214ac172c0 <- 2
[13329]() NASL> [0x56214ac07040 <- 8
[13329]() NASL> [0x56214ac17190 <- 9
[13329]() NASL> [0x56214ab8eee0 <- 10
[13329]() NASL> [0x56214ac06520 <- 1
[13329]() NASL> [0x56214ac067d0 <- 0
[13329]() NASL> [0x56214ab902a0 <- 1
[13329]() NASL> [0x56214ab8f2f0 <- 2
[13329]() NASL> [0x56214abfda00 <- 3
[13329]() NASL> [0x56214ac05dc0 <- 99
[13329]() NASL> [0x56214ac06710 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "HTTP/1.1 200 OK
"
[13329]() NASL> [0x56214ac008a0 <- "HTTP/1.1 200 OK
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "HTTP/1.1 200 OK
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 17
NASL:0645> if ((strlen(...) == 1) && (line =~ FAKE)) { ... }
NASL:0643> strlen(...)
[13329]() NASL> [0x56214ac01840 <- 1
[13329]() NASL> [0x56214abfda00 <- 0
[13329]() NASL> [0x56214ab8f2f0 <- 6
[13329]() NASL> [0x56214ac05dc0 <- 17
[13329]() NASL> [0x56214ac067d0 <- 1
[13329]() NASL> [0x56214ac06240 <- 0
[13329]() NASL> [0x56214abfdb20 <- 2
[13329]() NASL> [0x56214abfef70 <- 0
[13329]() NASL> [0x56214abfc540 <- 1
[13329]() NASL> [0x56214abfd3e0 <- 2
[13329]() NASL> [0x56214ac01800 <- 3
[13329]() NASL> [0x56214ac06480 <- 4
[13329]() NASL> [0x56214ac061e0 <- 5
[13329]() NASL> [0x56214ac05e20 <- 6
[13329]() NASL> [0x56214ac06060 <- 7
[13329]() NASL> [0x56214ac05f40 <- 9
[13329]() NASL> [0x56214ac06120 <- 10
[13329]() NASL> [0x56214ac06180 <- 1
[13329]() NASL> [0x56214ac06520 <- 2
[13329]() NASL> [0x56214ac172c0 <- 4
[13329]() NASL> [0x56214ac06ea0 <- 8
[13329]() NASL> [0x56214ab8eee0 <- 16
[13329]() NASL> [0x56214ac062c0 <- 32
[13329]() NASL> [0x56214ab90240 <- 32768
[13329]() NASL> [0x56214ac06710 <- 16384
[13329]() NASL> [0x56214ab902a0 <- 8192
[13329]() NASL> [0x56214ac17190 <- 8191
[13329]() NASL> [0x56214ab8ef40 <- 0
[13329]() NASL> [0x56214ac06770 <- 3
[13329]() NASL> [0x56214ac06000 <- 4
[13329]() NASL> [0x56214ac06e60 <- 5
[13329]() NASL> [0x56214ac07040 <- 6
[13329]() NASL> [0x56214ab8f330 <- 7
[13329]() NASL> [0x56214ac17280 <- 1
[13329]() NASL> [0x56214ac07080 <- 2
[13329]() NASL> [0x56214abfefb0 <- 8
[13329]() NASL> [0x56214ac060c0 <- 9
[13329]() NASL> [0x56214ac05e80 <- 10
[13329]() NASL> [0x56214ac05ee0 <- 1
[13329]() NASL> [0x56214ac05fa0 <- 0
[13329]() NASL> [0x56214abfdae0 <- 1
[13329]() NASL> [0x56214ac070e0 <- 2
[13329]() NASL> [0x56214abfdc00 <- 3
[13329]() NASL> [0x56214ac064e0 <- 99
[13329]() NASL> [0x56214abfdba0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "HTTP/1.1 200 OK
"
[13329]() NASL> [0x56214ab909e0 <- "HTTP/1.1 200 OK
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "HTTP/1.1 200 OK
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 17
NASL:0647> if (counter > 1024) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfffa0 -> 1
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfea80 -> 1
NASL:0637> line=recv_line(...);
NASL:0637> recv_line(...)
[13329]() NASL> [0x56214abfdc00 <- 1
[13329]() NASL> [0x56214ac070e0 <- 0
[13329]() NASL> [0x56214ac064e0 <- 6
[13329]() NASL> [0x56214ac05fa0 <- 17
[13329]() NASL> [0x56214ac06710 <- 1
[13329]() NASL> [0x56214ac06180 <- 0
[13329]() NASL> [0x56214abfc540 <- 2
[13329]() NASL> [0x56214ac05dc0 <- 0
[13329]() NASL> [0x56214ac06120 <- 1
[13329]() NASL> [0x56214abfef70 <- 2
[13329]() NASL> [0x56214abfdb20 <- 3
[13329]() NASL> [0x56214abfda00 <- 4
[13329]() NASL> [0x56214ac06e60 <- 5
[13329]() NASL> [0x56214ac067d0 <- 6
[13329]() NASL> [0x56214ac17190 <- 7
[13329]() NASL> [0x56214ac01840 <- 9
[13329]() NASL> [0x56214ab8f2f0 <- 10
[13329]() NASL> [0x56214ac05ee0 <- 1
[13329]() NASL> [0x56214ac07080 <- 2
[13329]() NASL> [0x56214ab8ef40 <- 4
[13329]() NASL> [0x56214ac05e80 <- 8
[13329]() NASL> [0x56214ab90240 <- 16
[13329]() NASL> [0x56214abfda40 <- 32
[13329]() NASL> [0x56214abfdba0 <- 32768
[13329]() NASL> [0x56214abfdae0 <- 16384
[13329]() NASL> [0x56214ac060c0 <- 8192
[13329]() NASL> [0x56214ac05f40 <- 8191
[13329]() NASL> [0x56214ac061e0 <- 0
[13329]() NASL> [0x56214ac06520 <- 3
[13329]() NASL> [0x56214ac17280 <- 4
[13329]() NASL> [0x56214abfefb0 <- 5
[13329]() NASL> [0x56214ac06770 <- 6
[13329]() NASL> [0x56214ac06060 <- 7
[13329]() NASL> [0x56214ac062c0 <- 1
[13329]() NASL> [0x56214ac05e20 <- 2
[13329]() NASL> [0x56214ab902a0 <- 8
[13329]() NASL> [0x56214ac172c0 <- 9
[13329]() NASL> [0x56214ac07040 <- 10
[13329]() NASL> [0x56214ab8eee0 <- 1
[13329]() NASL> [0x56214ac06480 <- 0
[13329]() NASL> [0x56214ac06240 <- 1
[13329]() NASL> [0x56214ab8f330 <- 2
[13329]() NASL> [0x56214ac06000 <- 3
[13329]() NASL> [0x56214ac06ea0 <- 99
[13329]() NASL> [0x56214ac01800 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> 1000000
[13329]() NASL> [0x56214abfda80 <- 1000000
[13329]() NASL> [0x56214ac17470 <- 4096
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call recv_line(socket: 1000000, length: 4096)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return recv_line: "Date: Wed, 10 Aug 2022 10:55:29 GMT
"
[13329]() NASL> [0x56214ac06be0 <- "Date: Wed, 10 Aug 2022 10:55:29 GMT
"
NASL:0638> buf+= (line);
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe5f0 -> "HTTP/1.1 200 OK
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Date: Wed, 10 Aug 2022 10:55:29 GMT
"
[13329]() NASL> [0x56214abfe5f0 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
"
NASL:0641> if (line == "
") { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Date: Wed, 10 Aug 2022 10:55:29 GMT
"
NASL:0643> if (! (strlen(...))) { ... }
NASL:0641> strlen(...)
[13329]() NASL> [0x56214abfdae0 <- 1
[13329]() NASL> [0x56214ac05ee0 <- 0
[13329]() NASL> [0x56214ab8f330 <- 6
[13329]() NASL> [0x56214ac06000 <- 17
[13329]() NASL> [0x56214ac01880 <- 1
[13329]() NASL> [0x56214ac06ea0 <- 0
[13329]() NASL> [0x56214ac06120 <- 2
[13329]() NASL> [0x56214ac05fa0 <- 0
[13329]() NASL> [0x56214ab8f2f0 <- 1
[13329]() NASL> [0x56214ac05dc0 <- 2
[13329]() NASL> [0x56214abfc540 <- 3
[13329]() NASL> [0x56214ac070e0 <- 4
[13329]() NASL> [0x56214abfefb0 <- 5
[13329]() NASL> [0x56214ac06710 <- 6
[13329]() NASL> [0x56214ac17470 <- 7
[13329]() NASL> [0x56214ac05f40 <- 9
[13329]() NASL> [0x56214abfdc00 <- 10
[13329]() NASL> [0x56214ac064e0 <- 1
[13329]() NASL> [0x56214ab8eee0 <- 2
[13329]() NASL> [0x56214ac05e20 <- 4
[13329]() NASL> [0x56214ac061e0 <- 8
[13329]() NASL> [0x56214ac07040 <- 16
[13329]() NASL> [0x56214abfdba0 <- 32
[13329]() NASL> [0x56214abfd3e0 <- 32768
[13329]() NASL> [0x56214ac01800 <- 16384
[13329]() NASL> [0x56214ac06240 <- 8192
[13329]() NASL> [0x56214ac172c0 <- 8191
[13329]() NASL> [0x56214ac01840 <- 0
[13329]() NASL> [0x56214ac06e60 <- 3
[13329]() NASL> [0x56214ac07080 <- 4
[13329]() NASL> [0x56214ac062c0 <- 5
[13329]() NASL> [0x56214ab902a0 <- 6
[13329]() NASL> [0x56214ac06520 <- 7
[13329]() NASL> [0x56214ac17190 <- 1
[13329]() NASL> [0x56214abfda80 <- 2
[13329]() NASL> [0x56214abfda40 <- 8
[13329]() NASL> [0x56214ac067d0 <- 9
[13329]() NASL> [0x56214ac17340 <- 10
[13329]() NASL> [0x56214ac060c0 <- 1
[13329]() NASL> [0x56214ab8ef40 <- 0
[13329]() NASL> [0x56214ac06770 <- 1
[13329]() NASL> [0x56214ab90240 <- 2
[13329]() NASL> [0x56214abfda00 <- 3
[13329]() NASL> [0x56214ac06180 <- 99
[13329]() NASL> [0x56214ac06060 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Date: Wed, 10 Aug 2022 10:55:29 GMT
"
[13329]() NASL> [0x56214ac008a0 <- "Date: Wed, 10 Aug 2022 10:55:29 GMT
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Date: Wed, 10 Aug 2022 10:55:29 GMT
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 37
NASL:0645> if ((strlen(...) == 1) && (line =~ FAKE)) { ... }
NASL:0643> strlen(...)
[13329]() NASL> [0x56214abfdb20 <- 1
[13329]() NASL> [0x56214abfda00 <- 0
[13329]() NASL> [0x56214ab90240 <- 6
[13329]() NASL> [0x56214ac06180 <- 17
[13329]() NASL> [0x56214ab8ef40 <- 1
[13329]() NASL> [0x56214ac01800 <- 0
[13329]() NASL> [0x56214ac064e0 <- 2
[13329]() NASL> [0x56214ab8f2f0 <- 0
[13329]() NASL> [0x56214ac06000 <- 1
[13329]() NASL> [0x56214abfdc00 <- 2
[13329]() NASL> [0x56214ac05fa0 <- 3
[13329]() NASL> [0x56214ac06120 <- 4
[13329]() NASL> [0x56214ac05ee0 <- 5
[13329]() NASL> [0x56214ac062c0 <- 6
[13329]() NASL> [0x56214ac01880 <- 7
[13329]() NASL> [0x56214ac172c0 <- 9
[13329]() NASL> [0x56214abfdae0 <- 10
[13329]() NASL> [0x56214ab8f330 <- 1
[13329]() NASL> [0x56214ac060c0 <- 2
[13329]() NASL> [0x56214abfda80 <- 4
[13329]() NASL> [0x56214ac01840 <- 8
[13329]() NASL> [0x56214ac17340 <- 16
[13329]() NASL> [0x56214abfd3e0 <- 32
[13329]() NASL> [0x56214ac17280 <- 32768
[13329]() NASL> [0x56214ac06060 <- 16384
[13329]() NASL> [0x56214ac06770 <- 8192
[13329]() NASL> [0x56214ac067d0 <- 8191
[13329]() NASL> [0x56214ac05f40 <- 0
[13329]() NASL> [0x56214abfefb0 <- 3
[13329]() NASL> [0x56214ab8eee0 <- 4
[13329]() NASL> [0x56214ac17190 <- 5
[13329]() NASL> [0x56214abfda40 <- 6
[13329]() NASL> [0x56214ac06e60 <- 7
[13329]() NASL> [0x56214ac17470 <- 1
[13329]() NASL> [0x56214abfdba0 <- 2
[13329]() NASL> [0x56214ac06710 <- 8
[13329]() NASL> [0x56214ac06240 <- 9
[13329]() NASL> [0x56214ac05e20 <- 10
[13329]() NASL> [0x56214ab902a0 <- 1
[13329]() NASL> [0x56214ac07040 <- 0
[13329]() NASL> [0x56214ac070e0 <- 1
[13329]() NASL> [0x56214ac06ea0 <- 2
[13329]() NASL> [0x56214ac06520 <- 3
[13329]() NASL> [0x56214ac07080 <- 99
[13329]() NASL> [0x56214ac061e0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Date: Wed, 10 Aug 2022 10:55:29 GMT
"
[13329]() NASL> [0x56214ac06980 <- "Date: Wed, 10 Aug 2022 10:55:29 GMT
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Date: Wed, 10 Aug 2022 10:55:29 GMT
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 37
NASL:0647> if (counter > 1024) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfffa0 -> 2
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfea80 -> 1
NASL:0637> line=recv_line(...);
NASL:0637> recv_line(...)
[13329]() NASL> [0x56214ac06520 <- 1
[13329]() NASL> [0x56214ac06ea0 <- 0
[13329]() NASL> [0x56214ac07080 <- 6
[13329]() NASL> [0x56214ac07040 <- 17
[13329]() NASL> [0x56214ac06060 <- 1
[13329]() NASL> [0x56214ab8f330 <- 0
[13329]() NASL> [0x56214ac06000 <- 2
[13329]() NASL> [0x56214ac06180 <- 0
[13329]() NASL> [0x56214abfdae0 <- 1
[13329]() NASL> [0x56214ab8f2f0 <- 2
[13329]() NASL> [0x56214ac064e0 <- 3
[13329]() NASL> [0x56214abfda00 <- 4
[13329]() NASL> [0x56214ac17190 <- 5
[13329]() NASL> [0x56214ab8ef40 <- 6
[13329]() NASL> [0x56214ac067d0 <- 7
[13329]() NASL> [0x56214abfdb20 <- 9
[13329]() NASL> [0x56214ab90240 <- 10
[13329]() NASL> [0x56214ab902a0 <- 1
[13329]() NASL> [0x56214abfdba0 <- 2
[13329]() NASL> [0x56214ac05f40 <- 4
[13329]() NASL> [0x56214ac05e20 <- 8
[13329]() NASL> [0x56214ac17280 <- 16
[13329]() NASL> [0x56214abfc540 <- 32
[13329]() NASL> [0x56214ac061e0 <- 32768
[13329]() NASL> [0x56214ac070e0 <- 16384
[13329]() NASL> [0x56214ac06240 <- 8192
[13329]() NASL> [0x56214ac172c0 <- 8191
[13329]() NASL> [0x56214ac05ee0 <- 0
[13329]() NASL> [0x56214ac060c0 <- 3
[13329]() NASL> [0x56214ac17470 <- 4
[13329]() NASL> [0x56214ac06710 <- 5
[13329]() NASL> [0x56214abfefb0 <- 6
[13329]() NASL> [0x56214ac01880 <- 7
[13329]() NASL> [0x56214abfd3e0 <- 1
[13329]() NASL> [0x56214ac062c0 <- 2
[13329]() NASL> [0x56214ac06770 <- 8
[13329]() NASL> [0x56214abfda80 <- 9
[13329]() NASL> [0x56214abfda40 <- 10
[13329]() NASL> [0x56214ac17340 <- 1
[13329]() NASL> [0x56214ac06120 <- 0
[13329]() NASL> [0x56214ac01800 <- 1
[13329]() NASL> [0x56214ac06e60 <- 2
[13329]() NASL> [0x56214ab8eee0 <- 3
[13329]() NASL> [0x56214ac01840 <- 99
[13329]() NASL> [0x56214ac05fa0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> 1000000
[13329]() NASL> [0x56214ac05dc0 <- 1000000
[13329]() NASL> [0x56214abfef70 <- 4096
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call recv_line(socket: 1000000, length: 4096)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return recv_line: "Server: Apache/2.2.8 (Ubuntu) DAV/2
"
[13329]() NASL> [0x56214ac06be0 <- "Server: Apache/2.2.8 (Ubuntu) DAV/2
"
NASL:0638> buf+= (line);
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe5f0 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Server: Apache/2.2.8 (Ubuntu) DAV/2
"
[13329]() NASL> [0x56214abfe5f0 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
"
NASL:0641> if (line == "
") { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Server: Apache/2.2.8 (Ubuntu) DAV/2
"
NASL:0643> if (! (strlen(...))) { ... }
NASL:0641> strlen(...)
[13329]() NASL> [0x56214ac06e60 <- 1
[13329]() NASL> [0x56214ab902a0 <- 0
[13329]() NASL> [0x56214ab8eee0 <- 6
[13329]() NASL> [0x56214ac05e80 <- 17
[13329]() NASL> [0x56214ac06480 <- 1
[13329]() NASL> [0x56214ac070e0 <- 0
[13329]() NASL> [0x56214ac01840 <- 2
[13329]() NASL> [0x56214ac06120 <- 0
[13329]() NASL> [0x56214abfdae0 <- 1
[13329]() NASL> [0x56214ac07040 <- 2
[13329]() NASL> [0x56214ab90240 <- 3
[13329]() NASL> [0x56214ac06180 <- 4
[13329]() NASL> [0x56214ac06000 <- 5
[13329]() NASL> [0x56214ac06ea0 <- 6
[13329]() NASL> [0x56214ac06710 <- 7
[13329]() NASL> [0x56214ac06060 <- 9
[13329]() NASL> [0x56214abfef70 <- 10
[13329]() NASL> [0x56214ac172c0 <- 1
[13329]() NASL> [0x56214ac06520 <- 2
[13329]() NASL> [0x56214ac07080 <- 4
[13329]() NASL> [0x56214ac17340 <- 8
[13329]() NASL> [0x56214ac062c0 <- 16
[13329]() NASL> [0x56214ac05ee0 <- 32
[13329]() NASL> [0x56214abfda40 <- 32768
[13329]() NASL> [0x56214ac061e0 <- 16384
[13329]() NASL> [0x56214abfdc00 <- 8192
[13329]() NASL> [0x56214ac05fa0 <- 8191
[13329]() NASL> [0x56214ac01800 <- 0
[13329]() NASL> [0x56214abfda80 <- 3
[13329]() NASL> [0x56214abfdb20 <- 4
[13329]() NASL> [0x56214ac17190 <- 5
[13329]() NASL> [0x56214abfdba0 <- 6
[13329]() NASL> [0x56214abfd3e0 <- 7
[13329]() NASL> [0x56214ac06770 <- 1
[13329]() NASL> [0x56214ac060c0 <- 2
[13329]() NASL> [0x56214ac067d0 <- 8
[13329]() NASL> [0x56214ac05dc0 <- 9
[13329]() NASL> [0x56214abfc540 <- 10
[13329]() NASL> [0x56214ab8ef40 <- 1
[13329]() NASL> [0x56214ac06240 <- 0
[13329]() NASL> [0x56214ac05f40 <- 1
[13329]() NASL> [0x56214abfefb0 <- 2
[13329]() NASL> [0x56214ac17280 <- 3
[13329]() NASL> [0x56214abfda00 <- 99
[13329]() NASL> [0x56214ab8f330 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Server: Apache/2.2.8 (Ubuntu) DAV/2
"
[13329]() NASL> [0x56214abfdc60 <- "Server: Apache/2.2.8 (Ubuntu) DAV/2
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Server: Apache/2.2.8 (Ubuntu) DAV/2
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 37
NASL:0645> if ((strlen(...) == 1) && (line =~ FAKE)) { ... }
NASL:0643> strlen(...)
[13329]() NASL> [0x56214ac05e20 <- 1
[13329]() NASL> [0x56214ac17280 <- 0
[13329]() NASL> [0x56214abfefb0 <- 6
[13329]() NASL> [0x56214abfda00 <- 17
[13329]() NASL> [0x56214ac06240 <- 1
[13329]() NASL> [0x56214ac061e0 <- 0
[13329]() NASL> [0x56214ac172c0 <- 2
[13329]() NASL> [0x56214abfdae0 <- 0
[13329]() NASL> [0x56214ac05e80 <- 1
[13329]() NASL> [0x56214abfef70 <- 2
[13329]() NASL> [0x56214ac06120 <- 3
[13329]() NASL> [0x56214ac01840 <- 4
[13329]() NASL> [0x56214ab902a0 <- 5
[13329]() NASL> [0x56214ac17190 <- 6
[13329]() NASL> [0x56214ac06480 <- 7
[13329]() NASL> [0x56214ac05fa0 <- 9
[13329]() NASL> [0x56214ac06e60 <- 10
[13329]() NASL> [0x56214ab8eee0 <- 1
[13329]() NASL> [0x56214ab8ef40 <- 2
[13329]() NASL> [0x56214ac060c0 <- 4
[13329]() NASL> [0x56214ac01800 <- 8
[13329]() NASL> [0x56214abfc540 <- 16
[13329]() NASL> [0x56214abfda40 <- 32
[13329]() NASL> [0x56214ac01880 <- 32768
[13329]() NASL> [0x56214ab8f330 <- 16384
[13329]() NASL> [0x56214ac05f40 <- 8192
[13329]() NASL> [0x56214ac05dc0 <- 8191
[13329]() NASL> [0x56214ac06060 <- 0
[13329]() NASL> [0x56214ac06000 <- 3
[13329]() NASL> [0x56214ac06520 <- 4
[13329]() NASL> [0x56214ac06770 <- 5
[13329]() NASL> [0x56214ac067d0 <- 6
[13329]() NASL> [0x56214abfda80 <- 7
[13329]() NASL> [0x56214ac06710 <- 1
[13329]() NASL> [0x56214ac05ee0 <- 2
[13329]() NASL> [0x56214ac06ea0 <- 8
[13329]() NASL> [0x56214abfdc00 <- 9
[13329]() NASL> [0x56214ac07080 <- 10
[13329]() NASL> [0x56214abfdba0 <- 1
[13329]() NASL> [0x56214ac062c0 <- 0
[13329]() NASL> [0x56214ac06180 <- 1
[13329]() NASL> [0x56214ac070e0 <- 2
[13329]() NASL> [0x56214abfd3e0 <- 3
[13329]() NASL> [0x56214abfdb20 <- 99
[13329]() NASL> [0x56214ac17340 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Server: Apache/2.2.8 (Ubuntu) DAV/2
"
[13329]() NASL> [0x56214ac06980 <- "Server: Apache/2.2.8 (Ubuntu) DAV/2
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Server: Apache/2.2.8 (Ubuntu) DAV/2
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 37
NASL:0647> if (counter > 1024) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfffa0 -> 3
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfea80 -> 1
NASL:0637> line=recv_line(...);
NASL:0637> recv_line(...)
[13329]() NASL> [0x56214abfd3e0 <- 1
[13329]() NASL> [0x56214ac070e0 <- 0
[13329]() NASL> [0x56214abfdb20 <- 6
[13329]() NASL> [0x56214ac062c0 <- 17
[13329]() NASL> [0x56214ab8f330 <- 1
[13329]() NASL> [0x56214ab8eee0 <- 0
[13329]() NASL> [0x56214ac05e80 <- 2
[13329]() NASL> [0x56214abfda00 <- 0
[13329]() NASL> [0x56214ac06e60 <- 1
[13329]() NASL> [0x56214abfdae0 <- 2
[13329]() NASL> [0x56214ac172c0 <- 3
[13329]() NASL> [0x56214ac17280 <- 4
[13329]() NASL> [0x56214ac06770 <- 5
[13329]() NASL> [0x56214ac06240 <- 6
[13329]() NASL> [0x56214ac05dc0 <- 7
[13329]() NASL> [0x56214ac05e20 <- 9
[13329]() NASL> [0x56214abfefb0 <- 10
[13329]() NASL> [0x56214abfdba0 <- 1
[13329]() NASL> [0x56214ac05ee0 <- 2
[13329]() NASL> [0x56214ac06060 <- 4
[13329]() NASL> [0x56214ac07080 <- 8
[13329]() NASL> [0x56214ac01880 <- 16
[13329]() NASL> [0x56214ab90240 <- 32
[13329]() NASL> [0x56214ac17340 <- 32768
[13329]() NASL> [0x56214ac06180 <- 16384
[13329]() NASL> [0x56214abfdc00 <- 8192
[13329]() NASL> [0x56214ac05fa0 <- 8191
[13329]() NASL> [0x56214ab902a0 <- 0
[13329]() NASL> [0x56214ab8ef40 <- 3
[13329]() NASL> [0x56214ac06710 <- 4
[13329]() NASL> [0x56214ac06ea0 <- 5
[13329]() NASL> [0x56214ac06000 <- 6
[13329]() NASL> [0x56214ac06480 <- 7
[13329]() NASL> [0x56214abfda40 <- 1
[13329]() NASL> [0x56214ac17190 <- 2
[13329]() NASL> [0x56214ac05f40 <- 8
[13329]() NASL> [0x56214ac060c0 <- 9
[13329]() NASL> [0x56214ac067d0 <- 10
[13329]() NASL> [0x56214abfc540 <- 1
[13329]() NASL> [0x56214ac01840 <- 0
[13329]() NASL> [0x56214ac061e0 <- 1
[13329]() NASL> [0x56214abfda80 <- 2
[13329]() NASL> [0x56214ac06520 <- 3
[13329]() NASL> [0x56214ac01800 <- 99
[13329]() NASL> [0x56214ac06120 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> 1000000
[13329]() NASL> [0x56214ac07040 <- 1000000
[13329]() NASL> [0x56214ac064e0 <- 4096
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call recv_line(socket: 1000000, length: 4096)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return recv_line: "X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
[13329]() NASL> [0x56214ac06be0 <- "X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
NASL:0638> buf+= (line);
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe5f0 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
[13329]() NASL> [0x56214abfe5f0 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
NASL:0641> if (line == "
") { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
NASL:0643> if (! (strlen(...))) { ... }
NASL:0641> strlen(...)
[13329]() NASL> [0x56214ac06520 <- 1
[13329]() NASL> [0x56214ac01840 <- 0
[13329]() NASL> [0x56214ac17470 <- 6
[13329]() NASL> [0x56214ac17410 <- 17
[13329]() NASL> [0x56214ac01800 <- 1
[13329]() NASL> [0x56214abfda80 <- 0
[13329]() NASL> [0x56214ac06180 <- 2
[13329]() NASL> [0x56214abfdba0 <- 0
[13329]() NASL> [0x56214ac06e60 <- 1
[13329]() NASL> [0x56214ac062c0 <- 2
[13329]() NASL> [0x56214abfefb0 <- 3
[13329]() NASL> [0x56214abfda00 <- 4
[13329]() NASL> [0x56214ac05e80 <- 5
[13329]() NASL> [0x56214ac070e0 <- 6
[13329]() NASL> [0x56214ac06ea0 <- 7
[13329]() NASL> [0x56214ab8f330 <- 9
[13329]() NASL> [0x56214ac064e0 <- 10
[13329]() NASL> [0x56214ac05fa0 <- 1
[13329]() NASL> [0x56214abfd3e0 <- 2
[13329]() NASL> [0x56214abfdb20 <- 4
[13329]() NASL> [0x56214abfc540 <- 8
[13329]() NASL> [0x56214ac17190 <- 16
[13329]() NASL> [0x56214ab902a0 <- 32
[13329]() NASL> [0x56214ac067d0 <- 32768
[13329]() NASL> [0x56214ac17340 <- 16384
[13329]() NASL> [0x56214abfef70 <- 8192
[13329]() NASL> [0x56214ac06120 <- 8191
[13329]() NASL> [0x56214ac061e0 <- 0
[13329]() NASL> [0x56214ac060c0 <- 3
[13329]() NASL> [0x56214ac05e20 <- 4
[13329]() NASL> [0x56214ac06770 <- 5
[13329]() NASL> [0x56214ac05ee0 <- 6
[13329]() NASL> [0x56214abfda40 <- 7
[13329]() NASL> [0x56214ac05f40 <- 1
[13329]() NASL> [0x56214ab8ef40 <- 2
[13329]() NASL> [0x56214ac05dc0 <- 8
[13329]() NASL> [0x56214ac07040 <- 9
[13329]() NASL> [0x56214ab90240 <- 10
[13329]() NASL> [0x56214ac06240 <- 1
[13329]() NASL> [0x56214ab8f2f0 <- 0
[13329]() NASL> [0x56214abfdc00 <- 1
[13329]() NASL> [0x56214ac06060 <- 2
[13329]() NASL> [0x56214ac06000 <- 3
[13329]() NASL> [0x56214ac01880 <- 99
[13329]() NASL> [0x56214ac17280 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
[13329]() NASL> [0x56214ac008a0 <- "X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "X-Powered-By: PHP/5.2.4-2ubuntu5.10
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 37
NASL:0645> if ((strlen(...) == 1) && (line =~ FAKE)) { ... }
NASL:0643> strlen(...)
[13329]() NASL> [0x56214ac06710 <- 1
[13329]() NASL> [0x56214ac06000 <- 0
[13329]() NASL> [0x56214ac06060 <- 6
[13329]() NASL> [0x56214ac01880 <- 17
[13329]() NASL> [0x56214ab8f2f0 <- 1
[13329]() NASL> [0x56214ac17340 <- 0
[13329]() NASL> [0x56214ac05fa0 <- 2
[13329]() NASL> [0x56214ac06e60 <- 0
[13329]() NASL> [0x56214ac17410 <- 1
[13329]() NASL> [0x56214ac064e0 <- 2
[13329]() NASL> [0x56214abfdba0 <- 3
[13329]() NASL> [0x56214ac06180 <- 4
[13329]() NASL> [0x56214ac01840 <- 5
[13329]() NASL> [0x56214ac06770 <- 6
[13329]() NASL> [0x56214ac01800 <- 7
[13329]() NASL> [0x56214ac06120 <- 9
[13329]() NASL> [0x56214ac06520 <- 10
[13329]() NASL> [0x56214ac17470 <- 1
[13329]() NASL> [0x56214ac06240 <- 2
[13329]() NASL> [0x56214ab8ef40 <- 4
[13329]() NASL> [0x56214ac061e0 <- 8
[13329]() NASL> [0x56214ab90240 <- 16
[13329]() NASL> [0x56214ac067d0 <- 32
[13329]() NASL> [0x56214ab8eee0 <- 32768
[13329]() NASL> [0x56214ac17280 <- 16384
[13329]() NASL> [0x56214abfdc00 <- 8192
[13329]() NASL> [0x56214ac07040 <- 8191
[13329]() NASL> [0x56214ab8f330 <- 0
[13329]() NASL> [0x56214ac05e80 <- 3
[13329]() NASL> [0x56214abfd3e0 <- 4
[13329]() NASL> [0x56214ac05f40 <- 5
[13329]() NASL> [0x56214ac05dc0 <- 6
[13329]() NASL> [0x56214ac060c0 <- 7
[13329]() NASL> [0x56214ac06ea0 <- 1
[13329]() NASL> [0x56214ab902a0 <- 2
[13329]() NASL> [0x56214ac070e0 <- 8
[13329]() NASL> [0x56214abfef70 <- 9
[13329]() NASL> [0x56214abfdb20 <- 10
[13329]() NASL> [0x56214ac05ee0 <- 1
[13329]() NASL> [0x56214ac17190 <- 0
[13329]() NASL> [0x56214abfda00 <- 1
[13329]() NASL> [0x56214abfda80 <- 2
[13329]() NASL> [0x56214abfda40 <- 3
[13329]() NASL> [0x56214ac05e20 <- 99
[13329]() NASL> [0x56214abfc540 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
[13329]() NASL> [0x56214ac06980 <- "X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "X-Powered-By: PHP/5.2.4-2ubuntu5.10
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 37
NASL:0647> if (counter > 1024) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfffa0 -> 4
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfea80 -> 1
NASL:0637> line=recv_line(...);
NASL:0637> recv_line(...)
[13329]() NASL> [0x56214abfda40 <- 1
[13329]() NASL> [0x56214abfda80 <- 0
[13329]() NASL> [0x56214ac05e20 <- 6
[13329]() NASL> [0x56214ac17190 <- 17
[13329]() NASL> [0x56214ac17280 <- 1
[13329]() NASL> [0x56214ac17470 <- 0
[13329]() NASL> [0x56214ac17410 <- 2
[13329]() NASL> [0x56214ac01880 <- 0
[13329]() NASL> [0x56214ac06520 <- 1
[13329]() NASL> [0x56214ac06e60 <- 2
[13329]() NASL> [0x56214ac05fa0 <- 3
[13329]() NASL> [0x56214ac06000 <- 4
[13329]() NASL> [0x56214ac05f40 <- 5
[13329]() NASL> [0x56214ab8f2f0 <- 6
[13329]() NASL> [0x56214ac07040 <- 7
[13329]() NASL> [0x56214ac06710 <- 9
[13329]() NASL> [0x56214ac06060 <- 10
[13329]() NASL> [0x56214ac05ee0 <- 1
[13329]() NASL> [0x56214ab902a0 <- 2
[13329]() NASL> [0x56214ab8f330 <- 4
[13329]() NASL> [0x56214abfdb20 <- 8
[13329]() NASL> [0x56214ab8eee0 <- 16
[13329]() NASL> [0x56214abfefb0 <- 32
[13329]() NASL> [0x56214abfc540 <- 32768
[13329]() NASL> [0x56214abfda00 <- 16384
[13329]() NASL> [0x56214abfef70 <- 8192
[13329]() NASL> [0x56214ac06120 <- 8191
[13329]() NASL> [0x56214ac01840 <- 0
[13329]() NASL> [0x56214ac06240 <- 3
[13329]() NASL> [0x56214ac06ea0 <- 4
[13329]() NASL> [0x56214ac070e0 <- 5
[13329]() NASL> [0x56214ac05e80 <- 6
[13329]() NASL> [0x56214ac01800 <- 7
[13329]() NASL> [0x56214ac067d0 <- 1
[13329]() NASL> [0x56214ac06770 <- 2
[13329]() NASL> [0x56214abfdc00 <- 8
[13329]() NASL> [0x56214ab8ef40 <- 9
[13329]() NASL> [0x56214ac05dc0 <- 10
[13329]() NASL> [0x56214ab90240 <- 1
[13329]() NASL> [0x56214ac06180 <- 0
[13329]() NASL> [0x56214ac17340 <- 1
[13329]() NASL> [0x56214ac060c0 <- 2
[13329]() NASL> [0x56214abfd3e0 <- 3
[13329]() NASL> [0x56214ac061e0 <- 99
[13329]() NASL> [0x56214abfdba0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> 1000000
[13329]() NASL> [0x56214ac062c0 <- 1000000
[13329]() NASL> [0x56214ac07080 <- 4096
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call recv_line(socket: 1000000, length: 4096)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return recv_line: "Content-Length: 891
"
[13329]() NASL> [0x56214ac06be0 <- "Content-Length: 891
"
NASL:0638> buf+= (line);
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe5f0 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Content-Length: 891
"
[13329]() NASL> [0x56214abfe5f0 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
"
NASL:0641> if (line == "
") { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Content-Length: 891
"
NASL:0643> if (! (strlen(...))) { ... }
NASL:0641> strlen(...)
[13329]() NASL> [0x56214abfd3e0 <- 1
[13329]() NASL> [0x56214ac06180 <- 0
[13329]() NASL> [0x56214ac06480 <- 6
[13329]() NASL> [0x56214abfdae0 <- 17
[13329]() NASL> [0x56214ac061e0 <- 1
[13329]() NASL> [0x56214ac060c0 <- 0
[13329]() NASL> [0x56214abfda00 <- 2
[13329]() NASL> [0x56214ac05ee0 <- 0
[13329]() NASL> [0x56214ac06520 <- 1
[13329]() NASL> [0x56214ac17190 <- 2
[13329]() NASL> [0x56214ac06060 <- 3
[13329]() NASL> [0x56214ac01880 <- 4
[13329]() NASL> [0x56214ac17410 <- 5
[13329]() NASL> [0x56214abfda80 <- 6
[13329]() NASL> [0x56214ac070e0 <- 7
[13329]() NASL> [0x56214ac17280 <- 9
[13329]() NASL> [0x56214ac07080 <- 10
[13329]() NASL> [0x56214ac06120 <- 1
[13329]() NASL> [0x56214abfda40 <- 2
[13329]() NASL> [0x56214ac05e20 <- 4
[13329]() NASL> [0x56214ab90240 <- 8
[13329]() NASL> [0x56214ac06770 <- 16
[13329]() NASL> [0x56214ac01840 <- 32
[13329]() NASL> [0x56214ac05dc0 <- 32768
[13329]() NASL> [0x56214abfc540 <- 16384
[13329]() NASL> [0x56214ac064e0 <- 8192
[13329]() NASL> [0x56214abfdba0 <- 8191
[13329]() NASL> [0x56214ac17340 <- 0
[13329]() NASL> [0x56214ab8ef40 <- 3
[13329]() NASL> [0x56214ac06710 <- 4
[13329]() NASL> [0x56214ac05f40 <- 5
[13329]() NASL> [0x56214ab902a0 <- 6
[13329]() NASL> [0x56214ac067d0 <- 7
[13329]() NASL> [0x56214abfdc00 <- 1
[13329]() NASL> [0x56214ac06240 <- 2
[13329]() NASL> [0x56214ac07040 <- 8
[13329]() NASL> [0x56214ac062c0 <- 9
[13329]() NASL> [0x56214abfefb0 <- 10
[13329]() NASL> [0x56214ab8f2f0 <- 1
[13329]() NASL> [0x56214ac172c0 <- 0
[13329]() NASL> [0x56214abfef70 <- 1
[13329]() NASL> [0x56214ab8f330 <- 2
[13329]() NASL> [0x56214ac05e80 <- 3
[13329]() NASL> [0x56214ab8eee0 <- 99
[13329]() NASL> [0x56214ac06000 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Content-Length: 891
"
[13329]() NASL> [0x56214ac00810 <- "Content-Length: 891
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Content-Length: 891
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 21
NASL:0645> if ((strlen(...) == 1) && (line =~ FAKE)) { ... }
NASL:0643> strlen(...)
[13329]() NASL> [0x56214ac06ea0 <- 1
[13329]() NASL> [0x56214ac05e80 <- 0
[13329]() NASL> [0x56214ab8f330 <- 6
[13329]() NASL> [0x56214ab8eee0 <- 17
[13329]() NASL> [0x56214ac172c0 <- 1
[13329]() NASL> [0x56214abfc540 <- 0
[13329]() NASL> [0x56214ac06120 <- 2
[13329]() NASL> [0x56214ac06520 <- 0
[13329]() NASL> [0x56214abfdae0 <- 1
[13329]() NASL> [0x56214ac07080 <- 2
[13329]() NASL> [0x56214ac05ee0 <- 3
[13329]() NASL> [0x56214abfda00 <- 4
[13329]() NASL> [0x56214ac06180 <- 5
[13329]() NASL> [0x56214ac05f40 <- 6
[13329]() NASL> [0x56214ac061e0 <- 7
[13329]() NASL> [0x56214abfdba0 <- 9
[13329]() NASL> [0x56214abfd3e0 <- 10
[13329]() NASL> [0x56214ac06480 <- 1
[13329]() NASL> [0x56214ab8f2f0 <- 2
[13329]() NASL> [0x56214ac06240 <- 4
[13329]() NASL> [0x56214ac17340 <- 8
[13329]() NASL> [0x56214abfefb0 <- 16
[13329]() NASL> [0x56214ac05dc0 <- 32
[13329]() NASL> [0x56214ac17470 <- 32768
[13329]() NASL> [0x56214ac06000 <- 16384
[13329]() NASL> [0x56214abfef70 <- 8192
[13329]() NASL> [0x56214ac062c0 <- 8191
[13329]() NASL> [0x56214ac17280 <- 0
[13329]() NASL> [0x56214ac17410 <- 3
[13329]() NASL> [0x56214abfda40 <- 4
[13329]() NASL> [0x56214abfdc00 <- 5
[13329]() NASL> [0x56214ac07040 <- 6
[13329]() NASL> [0x56214ab8ef40 <- 7
[13329]() NASL> [0x56214ac070e0 <- 1
[13329]() NASL> [0x56214ac01840 <- 2
[13329]() NASL> [0x56214abfda80 <- 8
[13329]() NASL> [0x56214ac064e0 <- 9
[13329]() NASL> [0x56214ac05e20 <- 10
[13329]() NASL> [0x56214ab902a0 <- 1
[13329]() NASL> [0x56214ac06770 <- 0
[13329]() NASL> [0x56214ac01880 <- 1
[13329]() NASL> [0x56214ac060c0 <- 2
[13329]() NASL> [0x56214ac067d0 <- 3
[13329]() NASL> [0x56214ac06710 <- 99
[13329]() NASL> [0x56214ab90240 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Content-Length: 891
"
[13329]() NASL> [0x56214ac00810 <- "Content-Length: 891
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Content-Length: 891
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 21
NASL:0647> if (counter > 1024) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfffa0 -> 5
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfea80 -> 1
NASL:0637> line=recv_line(...);
NASL:0637> recv_line(...)
[13329]() NASL> [0x56214ac067d0 <- 1
[13329]() NASL> [0x56214ac060c0 <- 0
[13329]() NASL> [0x56214ac06710 <- 6
[13329]() NASL> [0x56214ac06770 <- 17
[13329]() NASL> [0x56214ac06000 <- 1
[13329]() NASL> [0x56214ac06480 <- 0
[13329]() NASL> [0x56214abfdae0 <- 2
[13329]() NASL> [0x56214ab8eee0 <- 0
[13329]() NASL> [0x56214abfd3e0 <- 1
[13329]() NASL> [0x56214ac06520 <- 2
[13329]() NASL> [0x56214ac06120 <- 3
[13329]() NASL> [0x56214ac05e80 <- 4
[13329]() NASL> [0x56214abfdc00 <- 5
[13329]() NASL> [0x56214ac172c0 <- 6
[13329]() NASL> [0x56214ac062c0 <- 7
[13329]() NASL> [0x56214ac06ea0 <- 9
[13329]() NASL> [0x56214ab8f330 <- 10
[13329]() NASL> [0x56214ab902a0 <- 1
[13329]() NASL> [0x56214ac01840 <- 2
[13329]() NASL> [0x56214ac17280 <- 4
[13329]() NASL> [0x56214ac05e20 <- 8
[13329]() NASL> [0x56214ac17470 <- 16
[13329]() NASL> [0x56214ac06060 <- 32
[13329]() NASL> [0x56214ab90240 <- 32768
[13329]() NASL> [0x56214ac01880 <- 16384
[13329]() NASL> [0x56214ac064e0 <- 8192
[13329]() NASL> [0x56214abfdba0 <- 8191
[13329]() NASL> [0x56214ac06180 <- 0
[13329]() NASL> [0x56214ab8f2f0 <- 3
[13329]() NASL> [0x56214ac070e0 <- 4
[13329]() NASL> [0x56214abfda80 <- 5
[13329]() NASL> [0x56214ac17410 <- 6
[13329]() NASL> [0x56214ac061e0 <- 7
[13329]() NASL> [0x56214ac05dc0 <- 1
[13329]() NASL> [0x56214ac05f40 <- 2
[13329]() NASL> [0x56214abfef70 <- 8
[13329]() NASL> [0x56214ac06240 <- 9
[13329]() NASL> [0x56214ac07040 <- 10
[13329]() NASL> [0x56214abfefb0 <- 1
[13329]() NASL> [0x56214abfda00 <- 0
[13329]() NASL> [0x56214abfc540 <- 1
[13329]() NASL> [0x56214ab8ef40 <- 2
[13329]() NASL> [0x56214abfda40 <- 3
[13329]() NASL> [0x56214ac17340 <- 99
[13329]() NASL> [0x56214ac05ee0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> 1000000
[13329]() NASL> [0x56214ac17190 <- 1000000
[13329]() NASL> [0x56214abfdb20 <- 4096
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call recv_line(socket: 1000000, length: 4096)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return recv_line: "Connection: close
"
[13329]() NASL> [0x56214ac06be0 <- "Connection: close
"
NASL:0638> buf+= (line);
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe5f0 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Connection: close
"
[13329]() NASL> [0x56214abfe5f0 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
"
NASL:0641> if (line == "
") { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Connection: close
"
NASL:0643> if (! (strlen(...))) { ... }
NASL:0641> strlen(...)
[13329]() NASL> [0x56214abfda40 <- 1
[13329]() NASL> [0x56214abfda00 <- 0
[13329]() NASL> [0x56214ac01800 <- 6
[13329]() NASL> [0x56214ac06e60 <- 17
[13329]() NASL> [0x56214ac17340 <- 1
[13329]() NASL> [0x56214ab8ef40 <- 0
[13329]() NASL> [0x56214ac01880 <- 2
[13329]() NASL> [0x56214ab902a0 <- 0
[13329]() NASL> [0x56214abfd3e0 <- 1
[13329]() NASL> [0x56214ac06770 <- 2
[13329]() NASL> [0x56214ab8f330 <- 3
[13329]() NASL> [0x56214ab8eee0 <- 4
[13329]() NASL> [0x56214abfdae0 <- 5
[13329]() NASL> [0x56214ac060c0 <- 6
[13329]() NASL> [0x56214abfda80 <- 7
[13329]() NASL> [0x56214ac06000 <- 9
[13329]() NASL> [0x56214abfdb20 <- 10
[13329]() NASL> [0x56214abfdba0 <- 1
[13329]() NASL> [0x56214ac067d0 <- 2
[13329]() NASL> [0x56214ac06710 <- 4
[13329]() NASL> [0x56214abfefb0 <- 8
[13329]() NASL> [0x56214ac05f40 <- 16
[13329]() NASL> [0x56214ac06180 <- 32
[13329]() NASL> [0x56214ac07040 <- 32768
[13329]() NASL> [0x56214ab90240 <- 16384
[13329]() NASL> [0x56214ac07080 <- 8192
[13329]() NASL> [0x56214ac05ee0 <- 8191
[13329]() NASL> [0x56214abfc540 <- 0
[13329]() NASL> [0x56214ac06240 <- 3
[13329]() NASL> [0x56214ac06ea0 <- 4
[13329]() NASL> [0x56214abfdc00 <- 5
[13329]() NASL> [0x56214ac01840 <- 6
[13329]() NASL> [0x56214ac05dc0 <- 7
[13329]() NASL> [0x56214abfef70 <- 1
[13329]() NASL> [0x56214ab8f2f0 <- 2
[13329]() NASL> [0x56214ac062c0 <- 8
[13329]() NASL> [0x56214ac17190 <- 9
[13329]() NASL> [0x56214ac06060 <- 10
[13329]() NASL> [0x56214ac172c0 <- 1
[13329]() NASL> [0x56214ac05fa0 <- 0
[13329]() NASL> [0x56214ac064e0 <- 1
[13329]() NASL> [0x56214ac17280 <- 2
[13329]() NASL> [0x56214ac17410 <- 3
[13329]() NASL> [0x56214ac17470 <- 99
[13329]() NASL> [0x56214ac05e80 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Connection: close
"
[13329]() NASL> [0x56214ac00810 <- "Connection: close
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Connection: close
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 19
NASL:0645> if ((strlen(...) == 1) && (line =~ FAKE)) { ... }
NASL:0643> strlen(...)
[13329]() NASL> [0x56214ac070e0 <- 1
[13329]() NASL> [0x56214ac17410 <- 0
[13329]() NASL> [0x56214ac17280 <- 6
[13329]() NASL> [0x56214ac17470 <- 17
[13329]() NASL> [0x56214ac05fa0 <- 1
[13329]() NASL> [0x56214ab90240 <- 0
[13329]() NASL> [0x56214abfdba0 <- 2
[13329]() NASL> [0x56214abfd3e0 <- 0
[13329]() NASL> [0x56214ac06e60 <- 1
[13329]() NASL> [0x56214abfdb20 <- 2
[13329]() NASL> [0x56214ab902a0 <- 3
[13329]() NASL> [0x56214ac01880 <- 4
[13329]() NASL> [0x56214abfda00 <- 5
[13329]() NASL> [0x56214abfdc00 <- 6
[13329]() NASL> [0x56214ac17340 <- 7
[13329]() NASL> [0x56214ac05ee0 <- 9
[13329]() NASL> [0x56214abfda40 <- 10
[13329]() NASL> [0x56214ac01800 <- 1
[13329]() NASL> [0x56214ac172c0 <- 2
[13329]() NASL> [0x56214ab8f2f0 <- 4
[13329]() NASL> [0x56214abfc540 <- 8
[13329]() NASL> [0x56214ac06060 <- 16
[13329]() NASL> [0x56214ac07040 <- 32
[13329]() NASL> [0x56214ac06480 <- 32768
[13329]() NASL> [0x56214ac05e80 <- 16384
[13329]() NASL> [0x56214ac064e0 <- 8192
[13329]() NASL> [0x56214ac17190 <- 8191
[13329]() NASL> [0x56214ac06000 <- 0
[13329]() NASL> [0x56214abfdae0 <- 3
[13329]() NASL> [0x56214ac067d0 <- 4
[13329]() NASL> [0x56214abfef70 <- 5
[13329]() NASL> [0x56214ac062c0 <- 6
[13329]() NASL> [0x56214ac06240 <- 7
[13329]() NASL> [0x56214abfda80 <- 1
[13329]() NASL> [0x56214ac06180 <- 2
[13329]() NASL> [0x56214ac060c0 <- 8
[13329]() NASL> [0x56214ac07080 <- 9
[13329]() NASL> [0x56214ac06710 <- 10
[13329]() NASL> [0x56214ac01840 <- 1
[13329]() NASL> [0x56214ac05f40 <- 0
[13329]() NASL> [0x56214ab8eee0 <- 1
[13329]() NASL> [0x56214ab8ef40 <- 2
[13329]() NASL> [0x56214ac05dc0 <- 3
[13329]() NASL> [0x56214ac06ea0 <- 99
[13329]() NASL> [0x56214abfefb0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Connection: close
"
[13329]() NASL> [0x56214ac00810 <- "Connection: close
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Connection: close
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 19
NASL:0647> if (counter > 1024) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfffa0 -> 6
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfea80 -> 1
NASL:0637> line=recv_line(...);
NASL:0637> recv_line(...)
[13329]() NASL> [0x56214ac05dc0 <- 1
[13329]() NASL> [0x56214ab8ef40 <- 0
[13329]() NASL> [0x56214ac06ea0 <- 6
[13329]() NASL> [0x56214ac05f40 <- 17
[13329]() NASL> [0x56214ac05e80 <- 1
[13329]() NASL> [0x56214ac01800 <- 0
[13329]() NASL> [0x56214ac06e60 <- 2
[13329]() NASL> [0x56214ac17470 <- 0
[13329]() NASL> [0x56214abfda40 <- 1
[13329]() NASL> [0x56214abfd3e0 <- 2
[13329]() NASL> [0x56214abfdba0 <- 3
[13329]() NASL> [0x56214ac17410 <- 4
[13329]() NASL> [0x56214abfef70 <- 5
[13329]() NASL> [0x56214ac05fa0 <- 6
[13329]() NASL> [0x56214ac17190 <- 7
[13329]() NASL> [0x56214ac070e0 <- 9
[13329]() NASL> [0x56214ac17280 <- 10
[13329]() NASL> [0x56214ac01840 <- 1
[13329]() NASL> [0x56214ac06180 <- 2
[13329]() NASL> [0x56214ac06000 <- 4
[13329]() NASL> [0x56214ac06710 <- 8
[13329]() NASL> [0x56214ac06480 <- 16
[13329]() NASL> [0x56214ab8f330 <- 32
[13329]() NASL> [0x56214abfefb0 <- 32768
[13329]() NASL> [0x56214ab8eee0 <- 16384
[13329]() NASL> [0x56214ac07080 <- 8192
[13329]() NASL> [0x56214ac05ee0 <- 8191
[13329]() NASL> [0x56214abfda00 <- 0
[13329]() NASL> [0x56214ac172c0 <- 3
[13329]() NASL> [0x56214abfda80 <- 4
[13329]() NASL> [0x56214ac060c0 <- 5
[13329]() NASL> [0x56214abfdae0 <- 6
[13329]() NASL> [0x56214ac17340 <- 7
[13329]() NASL> [0x56214ac07040 <- 1
[13329]() NASL> [0x56214abfdc00 <- 2
[13329]() NASL> [0x56214ac064e0 <- 8
[13329]() NASL> [0x56214ab8f2f0 <- 9
[13329]() NASL> [0x56214ac062c0 <- 10
[13329]() NASL> [0x56214ac06060 <- 1
[13329]() NASL> [0x56214ac01880 <- 0
[13329]() NASL> [0x56214ab90240 <- 1
[13329]() NASL> [0x56214ac06240 <- 2
[13329]() NASL> [0x56214ac067d0 <- 3
[13329]() NASL> [0x56214abfc540 <- 99
[13329]() NASL> [0x56214ab902a0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> 1000000
[13329]() NASL> [0x56214ac06770 <- 1000000
[13329]() NASL> [0x56214ac05e20 <- 4096
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call recv_line(socket: 1000000, length: 4096)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return recv_line: "Content-Type: text/html
"
[13329]() NASL> [0x56214ac06be0 <- "Content-Type: text/html
"
NASL:0638> buf+= (line);
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe5f0 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Content-Type: text/html
"
[13329]() NASL> [0x56214abfe5f0 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html
"
NASL:0641> if (line == "
") { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Content-Type: text/html
"
NASL:0643> if (! (strlen(...))) { ... }
NASL:0641> strlen(...)
[13329]() NASL> [0x56214ac067d0 <- 1
[13329]() NASL> [0x56214ac01880 <- 0
[13329]() NASL> [0x56214ac061e0 <- 6
[13329]() NASL> [0x56214ac06520 <- 17
[13329]() NASL> [0x56214abfc540 <- 1
[13329]() NASL> [0x56214ac06240 <- 0
[13329]() NASL> [0x56214ab8eee0 <- 2
[13329]() NASL> [0x56214ac01840 <- 0
[13329]() NASL> [0x56214abfda40 <- 1
[13329]() NASL> [0x56214ac05f40 <- 2
[13329]() NASL> [0x56214ac17280 <- 3
[13329]() NASL> [0x56214ac17470 <- 4
[13329]() NASL> [0x56214ac06e60 <- 5
[13329]() NASL> [0x56214ab8ef40 <- 6
[13329]() NASL> [0x56214ac060c0 <- 7
[13329]() NASL> [0x56214ac05e80 <- 9
[13329]() NASL> [0x56214ac05e20 <- 10
[13329]() NASL> [0x56214ac05ee0 <- 1
[13329]() NASL> [0x56214ac05dc0 <- 2
[13329]() NASL> [0x56214ac06ea0 <- 4
[13329]() NASL> [0x56214ac06060 <- 8
[13329]() NASL> [0x56214abfdc00 <- 16
[13329]() NASL> [0x56214abfda00 <- 32
[13329]() NASL> [0x56214ac062c0 <- 32768
[13329]() NASL> [0x56214abfefb0 <- 16384
[13329]() NASL> [0x56214abfdb20 <- 8192
[13329]() NASL> [0x56214ab902a0 <- 8191
[13329]() NASL> [0x56214ab90240 <- 0
[13329]() NASL> [0x56214ab8f2f0 <- 3
[13329]() NASL> [0x56214ac070e0 <- 4
[13329]() NASL> [0x56214abfef70 <- 5
[13329]() NASL> [0x56214ac06180 <- 6
[13329]() NASL> [0x56214ac07040 <- 7
[13329]() NASL> [0x56214ac064e0 <- 1
[13329]() NASL> [0x56214ac172c0 <- 2
[13329]() NASL> [0x56214ac17190 <- 8
[13329]() NASL> [0x56214ac06770 <- 9
[13329]() NASL> [0x56214ab8f330 <- 10
[13329]() NASL> [0x56214ac05fa0 <- 1
[13329]() NASL> [0x56214ac06120 <- 0
[13329]() NASL> [0x56214ac07080 <- 1
[13329]() NASL> [0x56214ac06000 <- 2
[13329]() NASL> [0x56214abfdae0 <- 3
[13329]() NASL> [0x56214ac06480 <- 99
[13329]() NASL> [0x56214ac17410 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Content-Type: text/html
"
[13329]() NASL> [0x56214abfdc60 <- "Content-Type: text/html
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Content-Type: text/html
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 25
NASL:0645> if ((strlen(...) == 1) && (line =~ FAKE)) { ... }
NASL:0643> strlen(...)
[13329]() NASL> [0x56214abfda80 <- 1
[13329]() NASL> [0x56214abfdae0 <- 0
[13329]() NASL> [0x56214ac06000 <- 6
[13329]() NASL> [0x56214ac06480 <- 17
[13329]() NASL> [0x56214ac06120 <- 1
[13329]() NASL> [0x56214abfefb0 <- 0
[13329]() NASL> [0x56214ac05ee0 <- 2
[13329]() NASL> [0x56214abfda40 <- 0
[13329]() NASL> [0x56214ac06520 <- 1
[13329]() NASL> [0x56214ac05e20 <- 2
[13329]() NASL> [0x56214ac01840 <- 3
[13329]() NASL> [0x56214ab8eee0 <- 4
[13329]() NASL> [0x56214ac01880 <- 5
[13329]() NASL> [0x56214abfef70 <- 6
[13329]() NASL> [0x56214abfc540 <- 7
[13329]() NASL> [0x56214ab902a0 <- 9
[13329]() NASL> [0x56214ac067d0 <- 10
[13329]() NASL> [0x56214ac061e0 <- 1
[13329]() NASL> [0x56214ac05fa0 <- 2
[13329]() NASL> [0x56214ac172c0 <- 4
[13329]() NASL> [0x56214ab90240 <- 8
[13329]() NASL> [0x56214ab8f330 <- 16
[13329]() NASL> [0x56214ac062c0 <- 32
[13329]() NASL> [0x56214ac01800 <- 32768
[13329]() NASL> [0x56214ac17410 <- 16384
[13329]() NASL> [0x56214ac07080 <- 8192
[13329]() NASL> [0x56214ac06770 <- 8191
[13329]() NASL> [0x56214ac05e80 <- 0
[13329]() NASL> [0x56214ac06e60 <- 3
[13329]() NASL> [0x56214ac05dc0 <- 4
[13329]() NASL> [0x56214ac064e0 <- 5
[13329]() NASL> [0x56214ac17190 <- 6
[13329]() NASL> [0x56214ab8f2f0 <- 7
[13329]() NASL> [0x56214ac060c0 <- 1
[13329]() NASL> [0x56214abfda00 <- 2
[13329]() NASL> [0x56214ab8ef40 <- 8
[13329]() NASL> [0x56214abfdb20 <- 9
[13329]() NASL> [0x56214ac06ea0 <- 10
[13329]() NASL> [0x56214ac06180 <- 1
[13329]() NASL> [0x56214abfdc00 <- 0
[13329]() NASL> [0x56214ac17470 <- 1
[13329]() NASL> [0x56214ac06240 <- 2
[13329]() NASL> [0x56214ac07040 <- 3
[13329]() NASL> [0x56214ac070e0 <- 99
[13329]() NASL> [0x56214ac06060 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "Content-Type: text/html
"
[13329]() NASL> [0x56214ac06980 <- "Content-Type: text/html
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "Content-Type: text/html
")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 25
NASL:0647> if (counter > 1024) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfffa0 -> 7
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfea80 -> 1
NASL:0637> line=recv_line(...);
NASL:0637> recv_line(...)
[13329]() NASL> [0x56214ac07040 <- 1
[13329]() NASL> [0x56214ac06240 <- 0
[13329]() NASL> [0x56214ac070e0 <- 6
[13329]() NASL> [0x56214abfdc00 <- 17
[13329]() NASL> [0x56214ac17410 <- 1
[13329]() NASL> [0x56214ac061e0 <- 0
[13329]() NASL> [0x56214ac06520 <- 2
[13329]() NASL> [0x56214ac06480 <- 0
[13329]() NASL> [0x56214ac067d0 <- 1
[13329]() NASL> [0x56214abfda40 <- 2
[13329]() NASL> [0x56214ac05ee0 <- 3
[13329]() NASL> [0x56214abfdae0 <- 4
[13329]() NASL> [0x56214ac064e0 <- 5
[13329]() NASL> [0x56214ac06120 <- 6
[13329]() NASL> [0x56214ac06770 <- 7
[13329]() NASL> [0x56214abfda80 <- 9
[13329]() NASL> [0x56214ac06000 <- 10
[13329]() NASL> [0x56214ac06180 <- 1
[13329]() NASL> [0x56214abfda00 <- 2
[13329]() NASL> [0x56214ac05e80 <- 4
[13329]() NASL> [0x56214ac06ea0 <- 8
[13329]() NASL> [0x56214ac01800 <- 16
[13329]() NASL> [0x56214ac17280 <- 32
[13329]() NASL> [0x56214ac06060 <- 32768
[13329]() NASL> [0x56214ac17470 <- 16384
[13329]() NASL> [0x56214abfdb20 <- 8192
[13329]() NASL> [0x56214ab902a0 <- 8191
[13329]() NASL> [0x56214ac01880 <- 0
[13329]() NASL> [0x56214ac05fa0 <- 3
[13329]() NASL> [0x56214ac060c0 <- 4
[13329]() NASL> [0x56214ab8ef40 <- 5
[13329]() NASL> [0x56214ac06e60 <- 6
[13329]() NASL> [0x56214abfc540 <- 7
[13329]() NASL> [0x56214ac062c0 <- 1
[13329]() NASL> [0x56214abfef70 <- 2
[13329]() NASL> [0x56214ac07080 <- 8
[13329]() NASL> [0x56214ac172c0 <- 9
[13329]() NASL> [0x56214ac17190 <- 10
[13329]() NASL> [0x56214ab8f330 <- 1
[13329]() NASL> [0x56214ab8eee0 <- 0
[13329]() NASL> [0x56214abfefb0 <- 1
[13329]() NASL> [0x56214ab8f2f0 <- 2
[13329]() NASL> [0x56214ac05dc0 <- 3
[13329]() NASL> [0x56214ab90240 <- 99
[13329]() NASL> [0x56214ac01840 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> 1000000
[13329]() NASL> [0x56214ac05f40 <- 1000000
[13329]() NASL> [0x56214ac06710 <- 4096
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call recv_line(socket: 1000000, length: 4096)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return recv_line: "
"
[13329]() NASL> [0x56214ac06be0 <- "
"
NASL:0638> buf+= (line);
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe5f0 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html
"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "
"
[13329]() NASL> [0x56214abfe5f0 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
NASL:0641> if (line == "
") { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "
"
NASL:0640> break
NASL:0649> return buf;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe5f0 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return http_recv_headers2: "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8..."
[13329]() NASL> [0x56214ab8d440 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
NASL:0266> http_close_socket(...)
[13329]() NASL> [0x56214ab8eee0 <- 1
[13329]() NASL> [0x56214abffa10 <- 0
[13329]() NASL> [0x56214ac00b20 <- 6
[13329]() NASL> [0x56214abff460 <- 17
[13329]() NASL> [0x56214abfd880 <- 1
[13329]() NASL> [0x56214ac011a0 <- 0
[13329]() NASL> [0x56214abfed20 <- 2
[13329]() NASL> [0x56214abff1d0 <- 0
[13329]() NASL> [0x56214abfe830 <- 1
[13329]() NASL> [0x56214ac06920 <- 2
[13329]() NASL> [0x56214ac065c0 <- 3
[13329]() NASL> [0x56214ac00570 <- 4
[13329]() NASL> [0x56214ac01be0 <- 5
[13329]() NASL> [0x56214ac06410 <- 6
[13329]() NASL> [0x56214ac06be0 <- 7
[13329]() NASL> [0x56214ac00ec0 <- 9
[13329]() NASL> [0x56214abfd690 <- 10
[13329]() NASL> [0x56214ac00220 <- 1
[13329]() NASL> [0x56214abfea80 <- 2
[13329]() NASL> [0x56214ac00510 <- 4
[13329]() NASL> [0x56214ac04900 <- 8
[13329]() NASL> [0x56214abff4c0 <- 16
[13329]() NASL> [0x56214abfd8c0 <- 32
[13329]() NASL> [0x56214abfece0 <- 32768
[13329]() NASL> [0x56214ac063b0 <- 16384
[13329]() NASL> [0x56214abfd6f0 <- 8192
[13329]() NASL> [0x56214abff230 <- 8191
[13329]() NASL> [0x56214ac00b80 <- 0
[13329]() NASL> [0x56214abfe200 <- 3
[13329]() NASL> [0x56214abfdff0 <- 4
[13329]() NASL> [0x56214ac06370 <- 5
[13329]() NASL> [0x56214abfff40 <- 6
[13329]() NASL> [0x56214abfeae0 <- 7
[13329]() NASL> [0x56214abfe3c0 <- 1
[13329]() NASL> [0x56214abfe650 <- 2
[13329]() NASL> [0x56214abfe420 <- 8
[13329]() NASL> [0x56214abfd4f0 <- 9
[13329]() NASL> [0x56214abfe1a0 <- 10
[13329]() NASL> [0x56214ac00280 <- 1
[13329]() NASL> [0x56214ac06ba0 <- 0
[13329]() NASL> [0x56214ac06ae0 <- 1
[13329]() NASL> [0x56214abfffa0 <- 2
[13329]() NASL> [0x56214abfd1e0 <- 3
[13329]() NASL> [0x56214abff9b0 <- 99
[13329]() NASL> [0x56214ab8c9d0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d200 -> 1000000
[13329]() NASL> [0x56214ab909e0 <- 1000000
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call http_close_socket(1: 1000000)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return http_close_socket: FAKE
NASL:0271> if (banner) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d440 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
NASL:0269> replace_kb_item(...)
[13329]() NASL> [0x56214abff700 <- 1
[13329]() NASL> [0x56214abfe5f0 <- 0
[13329]() NASL> [0x56214abfc540 <- 6
[13329]() NASL> [0x56214abfe830 <- 17
[13329]() NASL> [0x56214abff460 <- 1
[13329]() NASL> [0x56214ab8c9d0 <- 0
[13329]() NASL> [0x56214abfd4f0 <- 2
[13329]() NASL> [0x56214ac01be0 <- 0
[13329]() NASL> [0x56214abff4c0 <- 1
[13329]() NASL> [0x56214ac06920 <- 2
[13329]() NASL> [0x56214ab909c0 <- 3
[13329]() NASL> [0x56214abfe890 <- 4
[13329]() NASL> [0x56214abfd550 <- 5
[13329]() NASL> [0x56214abfd1e0 <- 6
[13329]() NASL> [0x56214abfe650 <- 7
[13329]() NASL> [0x56214ac011a0 <- 9
[13329]() NASL> [0x56214abfdff0 <- 10
[13329]() NASL> [0x56214ac04900 <- 1
[13329]() NASL> [0x56214ac17740 <- 2
[13329]() NASL> [0x56214ac06ac0 <- 4
[13329]() NASL> [0x56214ac06b00 <- 8
[13329]() NASL> [0x56214ac06ba0 <- 16
[13329]() NASL> [0x56214ac06be0 <- 32
[13329]() NASL> [0x56214abff9b0 <- 32768
[13329]() NASL> [0x56214abffa10 <- 16384
[13329]() NASL> [0x56214abff1d0 <- 8192
[13329]() NASL> [0x56214abff230 <- 8191
[13329]() NASL> [0x56214ac00240 <- 0
[13329]() NASL> [0x56214abfd690 <- 3
[13329]() NASL> [0x56214abfd6d0 <- 4
[13329]() NASL> [0x56214ac06590 <- 5
[13329]() NASL> [0x56214ac065f0 <- 6
[13329]() NASL> [0x56214ac17890 <- 7
[13329]() NASL> [0x56214ac178f0 <- 1
[13329]() NASL> [0x56214abfef70 <- 2
[13329]() NASL> [0x56214abfefd0 <- 8
[13329]() NASL> [0x56214ac01820 <- 9
[13329]() NASL> [0x56214ac01880 <- 10
[13329]() NASL> [0x56214abfd380 <- 1
[13329]() NASL> [0x56214abfd3e0 <- 0
[13329]() NASL> [0x56214ac00830 <- 1
[13329]() NASL> [0x56214ac00890 <- 2
[13329]() NASL> [0x56214ac014d0 <- 3
[13329]() NASL> [0x56214ac01530 <- 99
[13329]() NASL> [0x56214abffc90 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d0e0 -> "www/banner/80/"
[13329]() NASL> [0x56214ac00b60 <- "www/banner/80/"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d440 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
[13329]() NASL> [0x56214ac00ba0 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call replace_kb_item(name: "www/banner/80/", value: "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8...")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return replace_kb_item: FAKE
NASL:0271> return banner;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d440 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_http_banner: "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8..."
[13329]() NASL> [0x56214abff760 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
NASL:0070> if (((banner) && ("Apache" >< banner)) && ("Apache-" >!< banner)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abff760 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abff760 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abff760 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
NASL:0063> version="unknown";
[13329]() NASL> [0x56214ab8cf60 <- "unknown"
NASL:0064> installed=TRUE;
[13329]() NASL> [0x56214ac01f50 <- 1
NASL:0066> vers=eregmatch(...);
NASL:0066> eregmatch(...)
[13329]() NASL> [0x56214ac025f0 <- 1
[13329]() NASL> [0x56214ab8ccc0 <- 0
[13329]() NASL> [0x56214ac03ca0 <- 6
[13329]() NASL> [0x56214ab8d560 <- 17
[13329]() NASL> [0x56214ab904b0 <- 1
[13329]() NASL> [0x56214ac02940 <- 0
[13329]() NASL> [0x56214ac04d40 <- 2
[13329]() NASL> [0x56214ac03d00 <- 0
[13329]() NASL> [0x56214ac03510 <- 1
[13329]() NASL> [0x56214ab8d260 <- 2
[13329]() NASL> [0x56214ac030d0 <- 3
[13329]() NASL> [0x56214ac034b0 <- 4
[13329]() NASL> [0x56214ab901a0 <- 5
[13329]() NASL> [0x56214ab8d320 <- 6
[13329]() NASL> [0x56214ab8d740 <- 7
[13329]() NASL> [0x56214ac01ef0 <- 9
[13329]() NASL> [0x56214ac04da0 <- 10
[13329]() NASL> [0x56214ac029a0 <- 1
[13329]() NASL> [0x56214ab90520 <- 2
[13329]() NASL> [0x56214ab8d4a0 <- 4
[13329]() NASL> [0x56214ac04110 <- 8
[13329]() NASL> [0x56214ab8d440 <- 16
[13329]() NASL> [0x56214ac04530 <- 32
[13329]() NASL> [0x56214ac02d20 <- 32768
[13329]() NASL> [0x56214ab8cd20 <- 16384
[13329]() NASL> [0x56214ab8eb30 <- 8192
[13329]() NASL> [0x56214ab90af0 <- 8191
[13329]() NASL> [0x56214ac04960 <- 0
[13329]() NASL> [0x56214ab8d980 <- 3
[13329]() NASL> [0x56214ab8d020 <- 4
[13329]() NASL> [0x56214ab90560 <- 5
[13329]() NASL> [0x56214ab8fad0 <- 6
[13329]() NASL> [0x56214ab8d5c0 <- 7
[13329]() NASL> [0x56214ab8cfc0 <- 1
[13329]() NASL> [0x56214abfbc50 <- 2
[13329]() NASL> [0x56214ab8fdf0 <- 8
[13329]() NASL> [0x56214ac02590 <- 9
[13329]() NASL> [0x56214ab8cd80 <- 10
[13329]() NASL> [0x56214ac044d0 <- 1
[13329]() NASL> [0x56214ab8cea0 <- 0
[13329]() NASL> [0x56214ab8d8c0 <- 1
[13329]() NASL> [0x56214ac038a0 <- 2
[13329]() NASL> [0x56214ac01b80 <- 3
[13329]() NASL> [0x56214ab8dc80 <- 99
[13329]() NASL> [0x56214ac03900 <- "1.1.0.0"
[13329]() NASL> [0x56214ac040b0 <- "Server: Apache/([0-9]\.[0-9]+\.[0-9][0-9]?)"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abff760 -> "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
[13329]() NASL> [0x56214ab8d9e0 <- "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8 (Ubuntu) DAV/2
X-Powered-By: PHP/5.2.4-2ubuntu5.10
Content-Length: 891
Connection: close
Content-Type: text/html

"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call eregmatch(pattern: "Server: Apache/([0-9]\.[0-9]+\.[0-9][0-9]?)", string: "HTTP/1.1 200 OK
Date: Wed, 10 Aug 2022 10:55:29 GMT
Server: Apache/2.2.8...")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return eregmatch: ???? (DYN_ARRAY (64))
[13329]() NASL> [0x56214ab8d0e0 <- (VAR2_ARRAY)
NASL:0068> if (! (isnull(...))) { ... }
NASL:0067> isnull(...)
[13329]() NASL> [0x56214ac17870 <- 1
[13329]() NASL> [0x56214ab8e100 <- 0
[13329]() NASL> [0x56214ac01b80 <- 6
[13329]() NASL> [0x56214ac038a0 <- 17
[13329]() NASL> [0x56214ac040b0 <- 1
[13329]() NASL> [0x56214abfdf90 <- 0
[13329]() NASL> [0x56214ac02ce0 <- 2
[13329]() NASL> [0x56214ab8dc80 <- 0
[13329]() NASL> [0x56214ab8cea0 <- 1
[13329]() NASL> [0x56214ab8cd20 <- 2
[13329]() NASL> [0x56214ac029a0 <- 3
[13329]() NASL> [0x56214ac03510 <- 4
[13329]() NASL> [0x56214ab8d560 <- 5
[13329]() NASL> [0x56214ac04da0 <- 6
[13329]() NASL> [0x56214ac03d00 <- 7
[13329]() NASL> [0x56214ac04d40 <- 9
[13329]() NASL> [0x56214ab8ccc0 <- 10
[13329]() NASL> [0x56214ab8e250 <- 1
[13329]() NASL> [0x56214ab90560 <- 2
[13329]() NASL> [0x56214ab904b0 <- 4
[13329]() NASL> [0x56214ab90af0 <- 8
[13329]() NASL> [0x56214ac025f0 <- 16
[13329]() NASL> [0x56214ab8d9e0 <- 32
[13329]() NASL> [0x56214ac03ca0 <- 32768
[13329]() NASL> [0x56214ac044d0 <- 16384
[13329]() NASL> [0x56214abfbc50 <- 8192
[13329]() NASL> [0x56214ac04960 <- 8191
[13329]() NASL> [0x56214ab8cd80 <- 0
[13329]() NASL> [0x56214ac02d20 <- 3
[13329]() NASL> [0x56214ab8d200 <- 4
[13329]() NASL> [0x56214ac03900 <- 5
[13329]() NASL> [0x56214ab8d8c0 <- 6
[13329]() NASL> [0x56214ac02590 <- 7
[13329]() NASL> [0x56214ac01ef0 <- 1
[13329]() NASL> [0x56214ab901a0 <- 2
[13329]() NASL> [0x56214ab90520 <- 8
[13329]() NASL> [0x56214ab8cfc0 <- 9
[13329]() NASL> [0x56214ab8fdf0 <- 10
[13329]() NASL> [0x56214ab8d980 <- 1
[13329]() NASL> [0x56214ab8d740 <- 0
[13329]() NASL> [0x56214ac04530 <- 1
[13329]() NASL> [0x56214ab8d320 <- 2
[13329]() NASL> [0x56214ab8eb30 <- 3
[13329]() NASL> [0x56214ab8d4a0 <- 99
[13329]() NASL> [0x56214ab8fad0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe3c0 -> "2.2.8"
[13329]() NASL> [0x56214ab71b20 <- "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call isnull(1: "2.2.8")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return isnull: 0
NASL:0067> version=chomp(...);
NASL:0067> chomp(...)
[13329]() NASL> [0x56214ab8d320 <- 1
[13329]() NASL> [0x56214ab8d4a0 <- 0
[13329]() NASL> [0x56214ab8d740 <- 6
[13329]() NASL> [0x56214ac044d0 <- 17
[13329]() NASL> [0x56214ab8e250 <- 1
[13329]() NASL> [0x56214ab8cea0 <- 0
[13329]() NASL> [0x56214ac038a0 <- 2
[13329]() NASL> [0x56214ab8ccc0 <- 0
[13329]() NASL> [0x56214ab8dc80 <- 1
[13329]() NASL> [0x56214ac02ce0 <- 2
[13329]() NASL> [0x56214ab8e100 <- 3
[13329]() NASL> [0x56214ac03900 <- 4
[13329]() NASL> [0x56214ac040b0 <- 5
[13329]() NASL> [0x56214ac04960 <- 6
[13329]() NASL> [0x56214ac17870 <- 7
[13329]() NASL> [0x56214ac01b80 <- 9
[13329]() NASL> [0x56214ab8d980 <- 10
[13329]() NASL> [0x56214ab901a0 <- 1
[13329]() NASL> [0x56214ab8cd80 <- 2
[13329]() NASL> [0x56214ab8fdf0 <- 4
[13329]() NASL> [0x56214ac03ca0 <- 8
[13329]() NASL> [0x56214ab8d440 <- 16
[13329]() NASL> [0x56214ab8fad0 <- 32
[13329]() NASL> [0x56214ac04530 <- 32768
[13329]() NASL> [0x56214ab8cfc0 <- 16384
[13329]() NASL> [0x56214ac04d40 <- 8192
[13329]() NASL> [0x56214ab8d560 <- 8191
[13329]() NASL> [0x56214ab90560 <- 0
[13329]() NASL> [0x56214ac01ef0 <- 3
[13329]() NASL> [0x56214ab90520 <- 4
[13329]() NASL> [0x56214ac02d20 <- 5
[13329]() NASL> [0x56214ac03d00 <- 6
[13329]() NASL> [0x56214ab8d9e0 <- 7
[13329]() NASL> [0x56214ac04da0 <- 1
[13329]() NASL> [0x56214abfbc50 <- 2
[13329]() NASL> [0x56214ab904b0 <- 8
[13329]() NASL> [0x56214ab8d8c0 <- 9
[13329]() NASL> [0x56214ac025f0 <- 10
[13329]() NASL> [0x56214ac03510 <- 1
[13329]() NASL> [0x56214abfdf90 <- 0
[13329]() NASL> [0x56214ac02590 <- 1
[13329]() NASL> [0x56214ab8d200 <- 2
[13329]() NASL> [0x56214ab90af0 <- 3
[13329]() NASL> [0x56214ac029a0 <- 99
[13329]() NASL> [0x56214ab8cd20 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe3c0 -> "2.2.8"
[13329]() NASL> [0x56214ab71b20 <- "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call chomp(1: "2.2.8")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return chomp: "2.2.8"
[13329]() NASL> [0x56214ab8cf60 <- "2.2.8"
NASL:0092> if ((! (version)) || (version == "unknown")) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cf60 -> "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cf60 -> "2.2.8"
NASL:0115> if ((! (version)) || (version == "unknown")) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cf60 -> "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cf60 -> "2.2.8"
NASL:0139> if ((! (version)) || (version == "unknown")) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cf60 -> "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cf60 -> "2.2.8"
NASL:0160> if (installed) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac01f50 -> 1
NASL:0141> install=(port) + ("/tcp");
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8ce40 -> "80"
[13329]() NASL> [0x56214ab8d020 <- "80/tcp"
NASL:0143> set_kb_item(...)
[13329]() NASL> [0x56214ab8eb30 <- 1
[13329]() NASL> [0x56214ac02940 <- 0
[13329]() NASL> [0x56214ab90af0 <- 6
[13329]() NASL> [0x56214ab8d200 <- 17
[13329]() NASL> [0x56214ac029a0 <- 1
[13329]() NASL> [0x56214abfdf90 <- 0
[13329]() NASL> [0x56214ab8cfc0 <- 2
[13329]() NASL> [0x56214ab901a0 <- 0
[13329]() NASL> [0x56214ab8dc80 <- 1
[13329]() NASL> [0x56214ac044d0 <- 2
[13329]() NASL> [0x56214ab8d980 <- 3
[13329]() NASL> [0x56214ab8ccc0 <- 4
[13329]() NASL> [0x56214ac038a0 <- 5
[13329]() NASL> [0x56214ab8d4a0 <- 6
[13329]() NASL> [0x56214ac02d20 <- 7
[13329]() NASL> [0x56214ab8e250 <- 9
[13329]() NASL> [0x56214ab8d560 <- 10
[13329]() NASL> [0x56214ab8d320 <- 1
[13329]() NASL> [0x56214ab8d740 <- 2
[13329]() NASL> [0x56214ac03510 <- 4
[13329]() NASL> [0x56214abfbc50 <- 8
[13329]() NASL> [0x56214ab90560 <- 16
[13329]() NASL> [0x56214ac025f0 <- 32
[13329]() NASL> [0x56214ac04530 <- 32768
[13329]() NASL> [0x56214ac034b0 <- 16384
[13329]() NASL> [0x56214ab8cd20 <- 8192
[13329]() NASL> [0x56214ac02590 <- 8191
[13329]() NASL> [0x56214ab8d8c0 <- 0
[13329]() NASL> [0x56214ac01b80 <- 3
[13329]() NASL> [0x56214ac040b0 <- 4
[13329]() NASL> [0x56214ab8cd80 <- 5
[13329]() NASL> [0x56214ac04da0 <- 6
[13329]() NASL> [0x56214ab904b0 <- 7
[13329]() NASL> [0x56214ac01ef0 <- 1
[13329]() NASL> [0x56214ac17870 <- 2
[13329]() NASL> [0x56214ab8fad0 <- 8
[13329]() NASL> [0x56214ac04960 <- 9
[13329]() NASL> [0x56214ac04d40 <- 10
[13329]() NASL> [0x56214ab8fdf0 <- 1
[13329]() NASL> [0x56214ac03d00 <- 0
[13329]() NASL> [0x56214ab8d440 <- 1
[13329]() NASL> [0x56214ac03900 <- 2
[13329]() NASL> [0x56214ab8cea0 <- 3
[13329]() NASL> [0x56214ab8d9e0 <- 99
[13329]() NASL> [0x56214ab90520 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8ce40 -> "80"
[13329]() NASL> [0x56214ab8e100 <- "www/80/Apache"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cf60 -> "2.2.8"
[13329]() NASL> [0x56214ac02ce0 <- "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call set_kb_item(name: "www/80/Apache", value: "2.2.8")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return set_kb_item: FAKE
NASL:0144> set_kb_item(...)
[13329]() NASL> [0x56214ab8cea0 <- 1
[13329]() NASL> [0x56214ac03900 <- 0
[13329]() NASL> [0x56214ab8d9e0 <- 6
[13329]() NASL> [0x56214ac03d00 <- 17
[13329]() NASL> [0x56214ac034b0 <- 1
[13329]() NASL> [0x56214ab8d320 <- 0
[13329]() NASL> [0x56214ab8dc80 <- 2
[13329]() NASL> [0x56214ab8d200 <- 0
[13329]() NASL> [0x56214ab8d560 <- 1
[13329]() NASL> [0x56214ab901a0 <- 2
[13329]() NASL> [0x56214ab8cfc0 <- 3
[13329]() NASL> [0x56214ac02940 <- 4
[13329]() NASL> [0x56214ab8cd80 <- 5
[13329]() NASL> [0x56214ac029a0 <- 6
[13329]() NASL> [0x56214ac02590 <- 7
[13329]() NASL> [0x56214ab8eb30 <- 9
[13329]() NASL> [0x56214ab90af0 <- 10
[13329]() NASL> [0x56214ab8fdf0 <- 1
[13329]() NASL> [0x56214ac17870 <- 2
[13329]() NASL> [0x56214ab8d8c0 <- 4
[13329]() NASL> [0x56214ac04d40 <- 8
[13329]() NASL> [0x56214ac04530 <- 16
[13329]() NASL> [0x56214ac03ca0 <- 32
[13329]() NASL> [0x56214ab90520 <- 32768
[13329]() NASL> [0x56214ab8d440 <- 16384
[13329]() NASL> [0x56214ac04960 <- 8192
[13329]() NASL> [0x56214ab8e250 <- 8191
[13329]() NASL> [0x56214ac038a0 <- 0
[13329]() NASL> [0x56214ab8e100 <- 3
[13329]() NASL> [0x56214ab8d740 <- 4
[13329]() NASL> [0x56214ac01ef0 <- 5
[13329]() NASL> [0x56214ab8fad0 <- 6
[13329]() NASL> [0x56214ac01b80 <- 7
[13329]() NASL> [0x56214ac02d20 <- 1
[13329]() NASL> [0x56214ac025f0 <- 2
[13329]() NASL> [0x56214ab8d4a0 <- 8
[13329]() NASL> [0x56214ab8cd20 <- 9
[13329]() NASL> [0x56214ac03510 <- 10
[13329]() NASL> [0x56214ac02ce0 <- 1
[13329]() NASL> [0x56214ac04da0 <- 0
[13329]() NASL> [0x56214ab90560 <- 1
[13329]() NASL> [0x56214ab8ccc0 <- 2
[13329]() NASL> [0x56214abfdf90 <- 3
[13329]() NASL> [0x56214ab904b0 <- 99
[13329]() NASL> [0x56214ac040b0 <- "1.1.0.0"
[13329]() NASL> [0x56214ab8d980 <- "apache/installed"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8a4c0 -> 1
[13329]() NASL> [0x56214ac044d0 <- 1
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call set_kb_item(name: "apache/installed", value: 1)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return set_kb_item: FAKE
NASL:0146> cpe=build_cpe(...);
NASL:0146> build_cpe(...)
[13329]() NASL> [0x56214ab904b0 <- 1
[13329]() NASL> [0x56214ac04da0 <- 0
[13329]() NASL> [0x56214ab8d440 <- 6
[13329]() NASL> [0x56214ab8fdf0 <- 17
[13329]() NASL> [0x56214ab8d560 <- 1
[13329]() NASL> [0x56214ac03d00 <- 0
[13329]() NASL> [0x56214ab90af0 <- 2
[13329]() NASL> [0x56214ab8d200 <- 0
[13329]() NASL> [0x56214ab8dc80 <- 1
[13329]() NASL> [0x56214ac03900 <- 2
[13329]() NASL> [0x56214ac01ef0 <- 3
[13329]() NASL> [0x56214ac034b0 <- 4
[13329]() NASL> [0x56214ab8e250 <- 5
[13329]() NASL> [0x56214ab8cea0 <- 6
[13329]() NASL> [0x56214ab8d9e0 <- 7
[13329]() NASL> [0x56214ac02ce0 <- 9
[13329]() NASL> [0x56214ac025f0 <- 10
[13329]() NASL> [0x56214ac038a0 <- 1
[13329]() NASL> [0x56214ac03510 <- 2
[13329]() NASL> [0x56214ab90520 <- 4
[13329]() NASL> [0x56214abfbc50 <- 8
[13329]() NASL> [0x56214ac040b0 <- 16
[13329]() NASL> [0x56214ab90560 <- 32
[13329]() NASL> [0x56214ab8cd20 <- 32768
[13329]() NASL> [0x56214ab8eb30 <- 16384
[13329]() NASL> [0x56214ab8cd80 <- 8192
[13329]() NASL> [0x56214ab8d980 <- 8191
[13329]() NASL> [0x56214ac17870 <- 0
[13329]() NASL> [0x56214ac02d20 <- 3
[13329]() NASL> [0x56214ab8d4a0 <- 4
[13329]() NASL> [0x56214ab8e100 <- 5
[13329]() NASL> [0x56214ac02590 <- 6
[13329]() NASL> [0x56214ac03ca0 <- 7
[13329]() NASL> [0x56214ac029a0 <- 1
[13329]() NASL> [0x56214ac04960 <- 2
[13329]() NASL> [0x56214ab8d8c0 <- 8
[13329]() NASL> [0x56214ac044d0 <- 9
[13329]() NASL> [0x56214ab8fad0 <- 10
[13329]() NASL> [0x56214ac04530 <- 1
[13329]() NASL> [0x56214ac02940 <- 0
[13329]() NASL> [0x56214ab8d320 <- 1
[13329]() NASL> [0x56214ac01b80 <- 2
[13329]() NASL> [0x56214ab8d740 <- 3
[13329]() NASL> [0x56214ac04d40 <- 99
[13329]() NASL> [0x56214ab8cfc0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cf60 -> "2.2.8"
[13329]() NASL> [0x56214abfd4f0 <- "2.2.8"
[13329]() NASL> [0x56214ac01be0 <- "^([0-9.]+)"
[13329]() NASL> [0x56214abfe830 <- "cpe:/a:apache:http_server:"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call build_cpe(value: "2.2.8", exp: "^([0-9.]+)", base: "cpe:/a:apache:http_server:")
NASL:0039> local_var ...
NASL:0040> local_var ...
NASL:0047> if (! (value)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> "2.2.8"
NASL:0052> if (! (exp)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac01be0 -> "^([0-9.]+)"
NASL:0057> if (! (base)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe830 -> "cpe:/a:apache:http_server:"
NASL:0060> if (((value == "unknown") || (value == "Unknown")) || (strlen(...) < 1)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> "2.2.8"
NASL:0057> strlen(...)
[13329]() NASL> [0x56214ac04110 <- 1
[13329]() NASL> [0x56214ac030d0 <- 0
[13329]() NASL> [0x56214ab8d260 <- 6
[13329]() NASL> [0x56214ab909c0 <- 17
[13329]() NASL> [0x56214ac05170 <- 1
[13329]() NASL> [0x56214abfe890 <- 0
[13329]() NASL> [0x56214abfe650 <- 2
[13329]() NASL> [0x56214abfd550 <- 0
[13329]() NASL> [0x56214ac011a0 <- 1
[13329]() NASL> [0x56214abfdff0 <- 2
[13329]() NASL> [0x56214abff1d0 <- 3
[13329]() NASL> [0x56214abff700 <- 4
[13329]() NASL> [0x56214abfc540 <- 5
[13329]() NASL> [0x56214ac178b0 <- 6
[13329]() NASL> [0x56214ac178f0 <- 7
[13329]() NASL> [0x56214ac06ba0 <- 9
[13329]() NASL> [0x56214ac06be0 <- 10
[13329]() NASL> [0x56214ac06ac0 <- 1
[13329]() NASL> [0x56214ac06b00 <- 2
[13329]() NASL> [0x56214abfcd80 <- 4
[13329]() NASL> [0x56214abfcdc0 <- 8
[13329]() NASL> [0x56214abfd1e0 <- 16
[13329]() NASL> [0x56214abfd220 <- 32
[13329]() NASL> [0x56214aa9a380 <- 32768
[13329]() NASL> [0x56214abfddc0 <- 16384
[13329]() NASL> [0x56214abfd690 <- 8192
[13329]() NASL> [0x56214abfd6f0 <- 8191
[13329]() NASL> [0x56214ac06590 <- 0
[13329]() NASL> [0x56214ac065f0 <- 3
[13329]() NASL> [0x56214abfece0 <- 4
[13329]() NASL> [0x56214abfed40 <- 5
[13329]() NASL> [0x56214abfef70 <- 6
[13329]() NASL> [0x56214abfefd0 <- 7
[13329]() NASL> [0x56214ac00830 <- 1
[13329]() NASL> [0x56214ac00890 <- 2
[13329]() NASL> [0x56214ac00b40 <- 8
[13329]() NASL> [0x56214ac00ba0 <- 9
[13329]() NASL> [0x56214abffc90 <- 10
[13329]() NASL> [0x56214abffcf0 <- 1
[13329]() NASL> [0x56214ac01820 <- 0
[13329]() NASL> [0x56214ac01880 <- 1
[13329]() NASL> [0x56214abff9d0 <- 2
[13329]() NASL> [0x56214abffa30 <- 3
[13329]() NASL> [0x56214ac00240 <- 99
[13329]() NASL> [0x56214ac002a0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> "2.2.8"
[13329]() NASL> [0x56214abff4e0 <- "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "2.2.8")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 5
NASL:0060> res=eregmatch(...);
NASL:0060> eregmatch(...)
[13329]() NASL> [0x56214ab8c9d0 <- 1
[13329]() NASL> [0x56214abffa30 <- 0
[13329]() NASL> [0x56214abff9d0 <- 6
[13329]() NASL> [0x56214ac00240 <- 17
[13329]() NASL> [0x56214ac01820 <- 1
[13329]() NASL> [0x56214abfddc0 <- 0
[13329]() NASL> [0x56214ac06ac0 <- 2
[13329]() NASL> [0x56214ac011a0 <- 0
[13329]() NASL> [0x56214ac06be0 <- 1
[13329]() NASL> [0x56214abfd550 <- 2
[13329]() NASL> [0x56214abfe650 <- 3
[13329]() NASL> [0x56214ac030d0 <- 4
[13329]() NASL> [0x56214abfed40 <- 5
[13329]() NASL> [0x56214ac05170 <- 6
[13329]() NASL> [0x56214abfd6f0 <- 7
[13329]() NASL> [0x56214ac04110 <- 9
[13329]() NASL> [0x56214ab8d260 <- 10
[13329]() NASL> [0x56214abffcf0 <- 1
[13329]() NASL> [0x56214ac00890 <- 2
[13329]() NASL> [0x56214ac06590 <- 4
[13329]() NASL> [0x56214abffc90 <- 8
[13329]() NASL> [0x56214aa9a380 <- 16
[13329]() NASL> [0x56214abfd3a0 <- 32
[13329]() NASL> [0x56214ac002a0 <- 32768
[13329]() NASL> [0x56214ac01880 <- 16384
[13329]() NASL> [0x56214ac00ba0 <- 8192
[13329]() NASL> [0x56214ac06ba0 <- 8191
[13329]() NASL> [0x56214abfc540 <- 0
[13329]() NASL> [0x56214ac06b00 <- 3
[13329]() NASL> [0x56214ac00830 <- 4
[13329]() NASL> [0x56214ac00b40 <- 5
[13329]() NASL> [0x56214ac065f0 <- 6
[13329]() NASL> [0x56214ac178f0 <- 7
[13329]() NASL> [0x56214ac178b0 <- 1
[13329]() NASL> [0x56214abfd690 <- 2
[13329]() NASL> [0x56214abfcd80 <- 8
[13329]() NASL> [0x56214abfef70 <- 9
[13329]() NASL> [0x56214abfd1e0 <- 10
[13329]() NASL> [0x56214abff700 <- 1
[13329]() NASL> [0x56214abfe890 <- 0
[13329]() NASL> [0x56214abfefd0 <- 1
[13329]() NASL> [0x56214abfece0 <- 2
[13329]() NASL> [0x56214abff1d0 <- 3
[13329]() NASL> [0x56214abfdff0 <- 99
[13329]() NASL> [0x56214abff4e0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> "2.2.8"
[13329]() NASL> [0x56214abfd880 <- "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac01be0 -> "^([0-9.]+)"
[13329]() NASL> [0x56214abfd8c0 <- "^([0-9.]+)"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab904b0 -> 1
[13329]() NASL> [0x56214abfeae0 <- 1
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call eregmatch(string: "2.2.8", pattern: "^([0-9.]+)", icase: 1)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return eregmatch: ???? (DYN_ARRAY (64))
[13329]() NASL> [0x56214ab8cf00 <- (VAR2_ARRAY)
NASL:0071> if (res[1]) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac067e0 -> "2.2.8"
NASL:0062> last=(strlen(...)) - (1);
NASL:0062> strlen(...)
[13329]() NASL> [0x56214abff1d0 <- 1
[13329]() NASL> [0x56214abfece0 <- 0
[13329]() NASL> [0x56214abfd8c0 <- 6
[13329]() NASL> [0x56214abfdff0 <- 17
[13329]() NASL> [0x56214abfe890 <- 1
[13329]() NASL> [0x56214ac01880 <- 0
[13329]() NASL> [0x56214abffcf0 <- 2
[13329]() NASL> [0x56214ac06be0 <- 0
[13329]() NASL> [0x56214ac00240 <- 1
[13329]() NASL> [0x56214ab8d260 <- 2
[13329]() NASL> [0x56214ac011a0 <- 3
[13329]() NASL> [0x56214ac06ac0 <- 4
[13329]() NASL> [0x56214abffa30 <- 5
[13329]() NASL> [0x56214abfeae0 <- 6
[13329]() NASL> [0x56214ac00b40 <- 7
[13329]() NASL> [0x56214ac01820 <- 9
[13329]() NASL> [0x56214ac06ba0 <- 10
[13329]() NASL> [0x56214ab8c9d0 <- 1
[13329]() NASL> [0x56214abfd880 <- 2
[13329]() NASL> [0x56214abff9d0 <- 4
[13329]() NASL> [0x56214abff700 <- 8
[13329]() NASL> [0x56214abfd690 <- 16
[13329]() NASL> [0x56214abfc540 <- 32
[13329]() NASL> [0x56214abfd1e0 <- 32768
[13329]() NASL> [0x56214ac002a0 <- 16384
[13329]() NASL> [0x56214abff460 <- 8192
[13329]() NASL> [0x56214abff4e0 <- 8191
[13329]() NASL> [0x56214abfefd0 <- 0
[13329]() NASL> [0x56214abfef70 <- 3
[13329]() NASL> [0x56214ac04110 <- 4
[13329]() NASL> [0x56214abfed40 <- 5
[13329]() NASL> [0x56214ac00890 <- 6
[13329]() NASL> [0x56214ac178b0 <- 7
[13329]() NASL> [0x56214abfcd80 <- 1
[13329]() NASL> [0x56214ac06b00 <- 2
[13329]() NASL> [0x56214abfd6f0 <- 8
[13329]() NASL> [0x56214abfd3a0 <- 9
[13329]() NASL> [0x56214ac05170 <- 10
[13329]() NASL> [0x56214ac00ba0 <- 1
[13329]() NASL> [0x56214ac06590 <- 0
[13329]() NASL> [0x56214ac065f0 <- 1
[13329]() NASL> [0x56214aa9a380 <- 2
[13329]() NASL> [0x56214ac030d0 <- 3
[13329]() NASL> [0x56214abfddc0 <- 99
[13329]() NASL> [0x56214ac178f0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe830 -> "cpe:/a:apache:http_server:"
[13329]() NASL> [0x56214ac08130 <- "cpe:/a:apache:http_server:"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "cpe:/a:apache:http_server:")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 26
[13329]() NASL> [0x56214ab8d5c0 <- 25
NASL:0070> if (":" >!< base[last]) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d5c0 -> 25
NASL:0070> if ((res[1]) && (res[2])) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac067e0 -> "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac08550 -> undef
NASL:0070> if (res[1]) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac067e0 -> "2.2.8"
NASL:0068> return string(...);
NASL:0068> string(...)
[13329]() NASL> [0x56214aa9a380 <- 1
[13329]() NASL> [0x56214abfddc0 <- 0
[13329]() NASL> [0x56214ac06590 <- 6
[13329]() NASL> [0x56214ac002a0 <- 17
[13329]() NASL> [0x56214ab8c9d0 <- 1
[13329]() NASL> [0x56214ac00240 <- 0
[13329]() NASL> [0x56214abfdff0 <- 2
[13329]() NASL> [0x56214ac06ba0 <- 0
[13329]() NASL> [0x56214ac06be0 <- 1
[13329]() NASL> [0x56214abffcf0 <- 2
[13329]() NASL> [0x56214abfece0 <- 3
[13329]() NASL> [0x56214abfed40 <- 4
[13329]() NASL> [0x56214abfe890 <- 5
[13329]() NASL> [0x56214abff4e0 <- 6
[13329]() NASL> [0x56214abff1d0 <- 7
[13329]() NASL> [0x56214abfd8c0 <- 9
[13329]() NASL> [0x56214ac00ba0 <- 10
[13329]() NASL> [0x56214ac06b00 <- 1
[13329]() NASL> [0x56214abfefd0 <- 2
[13329]() NASL> [0x56214ac05170 <- 4
[13329]() NASL> [0x56214abfd1e0 <- 8
[13329]() NASL> [0x56214ac00830 <- 16
[13329]() NASL> [0x56214ac178f0 <- 32
[13329]() NASL> [0x56214ac065f0 <- 32768
[13329]() NASL> [0x56214abfd3a0 <- 16384
[13329]() NASL> [0x56214ac01820 <- 8192
[13329]() NASL> [0x56214abffa30 <- 8191
[13329]() NASL> [0x56214abfd880 <- 0
[13329]() NASL> [0x56214abfcd80 <- 3
[13329]() NASL> [0x56214abfd6f0 <- 4
[13329]() NASL> [0x56214abfef70 <- 5
[13329]() NASL> [0x56214ac00b40 <- 6
[13329]() NASL> [0x56214abfc540 <- 7
[13329]() NASL> [0x56214abfeae0 <- 1
[13329]() NASL> [0x56214abff460 <- 2
[13329]() NASL> [0x56214abff9d0 <- 8
[13329]() NASL> [0x56214ac00890 <- 9
[13329]() NASL> [0x56214abfd690 <- 10
[13329]() NASL> [0x56214ac06ac0 <- 1
[13329]() NASL> [0x56214ac01880 <- 0
[13329]() NASL> [0x56214ac178b0 <- 1
[13329]() NASL> [0x56214ac04110 <- 2
[13329]() NASL> [0x56214abff700 <- 3
[13329]() NASL> [0x56214ac011a0 <- 99
[13329]() NASL> [0x56214ab8d260 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfe830 -> "cpe:/a:apache:http_server:"
[13329]() NASL> [0x56214ac08400 <- "cpe:/a:apache:http_server:"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac067e0 -> "2.2.8"
[13329]() NASL> [0x56214ab90280 <- "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call string(1: "cpe:/a:apache:http_server:", 2: "2.2.8")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return string: "cpe:/a:apache:http_server:2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return build_cpe: "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214abfdf90 <- "cpe:/a:apache:http_server:2.2.8"
NASL:0150> if (isnull(...)) { ... }
NASL:0147> isnull(...)
[13329]() NASL> [0x56214abfd550 <- 1
[13329]() NASL> [0x56214ab8ccc0 <- 0
[13329]() NASL> [0x56214ab8d740 <- 6
[13329]() NASL> [0x56214ac01b80 <- 17
[13329]() NASL> [0x56214ac04d40 <- 1
[13329]() NASL> [0x56214ac02940 <- 0
[13329]() NASL> [0x56214ab8eb30 <- 2
[13329]() NASL> [0x56214ac038a0 <- 0
[13329]() NASL> [0x56214ab8d5c0 <- 1
[13329]() NASL> [0x56214ab8dc80 <- 2
[13329]() NASL> [0x56214ab8fdf0 <- 3
[13329]() NASL> [0x56214abfe830 <- 4
[13329]() NASL> [0x56214ac025f0 <- 5
[13329]() NASL> [0x56214ab8d200 <- 6
[13329]() NASL> [0x56214ab90af0 <- 7
[13329]() NASL> [0x56214ac04da0 <- 9
[13329]() NASL> [0x56214ab8e100 <- 10
[13329]() NASL> [0x56214ab8d560 <- 1
[13329]() NASL> [0x56214ab8d980 <- 2
[13329]() NASL> [0x56214ab904b0 <- 4
[13329]() NASL> [0x56214ab8d440 <- 8
[13329]() NASL> [0x56214ac04530 <- 16
[13329]() NASL> [0x56214ac04960 <- 32
[13329]() NASL> [0x56214ac17870 <- 32768
[13329]() NASL> [0x56214ab8cf00 <- 16384
[13329]() NASL> [0x56214ab8fad0 <- 8192
[13329]() NASL> [0x56214ab8cd20 <- 8191
[13329]() NASL> [0x56214ab901a0 <- 0
[13329]() NASL> [0x56214ab8cfc0 <- 3
[13329]() NASL> [0x56214ab8d320 <- 4
[13329]() NASL> [0x56214ac044d0 <- 5
[13329]() NASL> [0x56214ac02ce0 <- 6
[13329]() NASL> [0x56214ab8e250 <- 7
[13329]() NASL> [0x56214ac03510 <- 1
[13329]() NASL> [0x56214ac01be0 <- 2
[13329]() NASL> [0x56214ac029a0 <- 8
[13329]() NASL> [0x56214ab8d8c0 <- 9
[13329]() NASL> [0x56214ac02d20 <- 10
[13329]() NASL> [0x56214ab8d9e0 <- 1
[13329]() NASL> [0x56214ab90560 <- 0
[13329]() NASL> [0x56214ab8cea0 <- 1
[13329]() NASL> [0x56214ab8cd80 <- 2
[13329]() NASL> [0x56214ab90520 <- 3
[13329]() NASL> [0x56214abfd4f0 <- 99
[13329]() NASL> [0x56214ac02590 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfdf90 -> "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214ac08550 <- "cpe:/a:apache:http_server:2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call isnull(1: "cpe:/a:apache:http_server:2.2.8")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return isnull: 0
NASL:0150> register_product(...)
[13329]() NASL> [0x56214ac03d00 <- 1
[13329]() NASL> [0x56214ab90520 <- 0
[13329]() NASL> [0x56214ab8cd80 <- 6
[13329]() NASL> [0x56214abfd4f0 <- 17
[13329]() NASL> [0x56214ab90560 <- 1
[13329]() NASL> [0x56214ab8cf00 <- 0
[13329]() NASL> [0x56214ab8d560 <- 2
[13329]() NASL> [0x56214ab8d5c0 <- 0
[13329]() NASL> [0x56214ac01b80 <- 1
[13329]() NASL> [0x56214ab8e100 <- 2
[13329]() NASL> [0x56214ac038a0 <- 3
[13329]() NASL> [0x56214ab8eb30 <- 4
[13329]() NASL> [0x56214ab8ccc0 <- 5
[13329]() NASL> [0x56214ac044d0 <- 6
[13329]() NASL> [0x56214ac04d40 <- 7
[13329]() NASL> [0x56214ab8cd20 <- 9
[13329]() NASL> [0x56214abfd550 <- 10
[13329]() NASL> [0x56214ab8d740 <- 1
[13329]() NASL> [0x56214ab8d9e0 <- 2
[13329]() NASL> [0x56214ac01be0 <- 4
[13329]() NASL> [0x56214ab901a0 <- 8
[13329]() NASL> [0x56214ac02d20 <- 16
[13329]() NASL> [0x56214ac17870 <- 32
[13329]() NASL> [0x56214ac040b0 <- 32768
[13329]() NASL> [0x56214ac02590 <- 16384
[13329]() NASL> [0x56214ab8cea0 <- 8192
[13329]() NASL> [0x56214ab8d8c0 <- 8191
[13329]() NASL> [0x56214ac04da0 <- 0
[13329]() NASL> [0x56214ac025f0 <- 3
[13329]() NASL> [0x56214ab8d980 <- 4
[13329]() NASL> [0x56214ac03510 <- 5
[13329]() NASL> [0x56214ac029a0 <- 6
[13329]() NASL> [0x56214ab8cfc0 <- 7
[13329]() NASL> [0x56214ab90af0 <- 1
[13329]() NASL> [0x56214ac04960 <- 2
[13329]() NASL> [0x56214ab8d200 <- 8
[13329]() NASL> [0x56214ab8fad0 <- 9
[13329]() NASL> [0x56214ab904b0 <- 10
[13329]() NASL> [0x56214ac02ce0 <- 1
[13329]() NASL> [0x56214ac04530 <- 0
[13329]() NASL> [0x56214abfe830 <- 1
[13329]() NASL> [0x56214ac02940 <- 2
[13329]() NASL> [0x56214ab8e250 <- 3
[13329]() NASL> [0x56214ab8d320 <- 99
[13329]() NASL> [0x56214ab8d440 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfdf90 -> "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214ab8dc80 <- "cpe:/a:apache:http_server:2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d020 -> "80/tcp"
[13329]() NASL> [0x56214ac034b0 <- "80/tcp"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8ce40 -> "80"
[13329]() NASL> [0x56214ac03ca0 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call register_product(cpe: "cpe:/a:apache:http_server:2.2.8", location: "80/tcp", port: "80")
NASL:0359> local_var ...
NASL:0361> register_host_detail(...)
[13329]() NASL> [0x56214ac00530 <- 1
[13329]() NASL> [0x56214ac030d0 <- 0
[13329]() NASL> [0x56214abff4a0 <- 6
[13329]() NASL> [0x56214abfe650 <- 17
[13329]() NASL> [0x56214abff700 <- 1
[13329]() NASL> [0x56214ac04110 <- 0
[13329]() NASL> [0x56214ac011a0 <- 2
[13329]() NASL> [0x56214ac01880 <- 0
[13329]() NASL> [0x56214abfd3a0 <- 1
[13329]() NASL> [0x56214ac06b00 <- 2
[13329]() NASL> [0x56214ac06be0 <- 3
[13329]() NASL> [0x56214ac002a0 <- 4
[13329]() NASL> [0x56214ac00ba0 <- 5
[13329]() NASL> [0x56214ac06ba0 <- 6
[13329]() NASL> [0x56214abfdff0 <- 7
[13329]() NASL> [0x56214abfddc0 <- 9
[13329]() NASL> [0x56214abfef70 <- 10
[13329]() NASL> [0x56214ab8c9d0 <- 1
[13329]() NASL> [0x56214abffa30 <- 2
[13329]() NASL> [0x56214aa9a380 <- 4
[13329]() NASL> [0x56214ac06590 <- 8
[13329]() NASL> [0x56214ac06ac0 <- 16
[13329]() NASL> [0x56214abff460 <- 32
[13329]() NASL> [0x56214abfd880 <- 32768
[13329]() NASL> [0x56214abfd690 <- 16384
[13329]() NASL> [0x56214ac065f0 <- 8192
[13329]() NASL> [0x56214abffc90 <- 8191
[13329]() NASL> [0x56214ab8d260 <- 0
[13329]() NASL> [0x56214ac178b0 <- 3
[13329]() NASL> [0x56214ac00890 <- 4
[13329]() NASL> [0x56214abfd8c0 <- 5
[13329]() NASL> [0x56214abfe890 <- 6
[13329]() NASL> [0x56214abfefd0 <- 7
[13329]() NASL> [0x56214abfeae0 <- 1
[13329]() NASL> [0x56214abff9d0 <- 2
[13329]() NASL> [0x56214abfcd80 <- 8
[13329]() NASL> [0x56214abff1d0 <- 9
[13329]() NASL> [0x56214ac178f0 <- 10
[13329]() NASL> [0x56214abff4e0 <- 1
[13329]() NASL> [0x56214ac01820 <- 0
[13329]() NASL> [0x56214ac05170 <- 1
[13329]() NASL> [0x56214ac00b40 <- 2
[13329]() NASL> [0x56214ac00830 <- 3
[13329]() NASL> [0x56214abfed40 <- 99
[13329]() NASL> [0x56214ac00240 <- "1.1.0.0"
[13329]() NASL> [0x56214abfd6f0 <- "App"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8dc80 -> "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214abfd1e0 <- "cpe:/a:apache:http_server:2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call register_host_detail(name: "App", value: "cpe:/a:apache:http_server:2.2.8")
NASL:0314> local_var ...
NASL:0321> if (! (name)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd6f0 -> "App"
NASL:0323> if (! (value)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd1e0 -> "cpe:/a:apache:http_server:2.2.8"
NASL:0323> nvt=get_script_oid(...);
NASL:0323> get_script_oid(...)
[13329]() NASL> [0x56214ab8f270 <- 1
[13329]() NASL> [0x56214ab8f2b0 <- 0
[13329]() NASL> [0x56214abfcdc0 <- 6
[13329]() NASL> [0x56214ab41ae0 <- 17
[13329]() NASL> [0x56214ac07050 <- 1
[13329]() NASL> [0x56214ac07090 <- 0
[13329]() NASL> [0x56214ac070d0 <- 2
[13329]() NASL> [0x56214ac07110 <- 0
[13329]() NASL> [0x56214ac07150 <- 1
[13329]() NASL> [0x56214ac07190 <- 2
[13329]() NASL> [0x56214ac071d0 <- 3
[13329]() NASL> [0x56214ac07210 <- 4
[13329]() NASL> [0x56214ac07250 <- 5
[13329]() NASL> [0x56214ac07290 <- 6
[13329]() NASL> [0x56214ac072d0 <- 7
[13329]() NASL> [0x56214ac07310 <- 9
[13329]() NASL> [0x56214ac07350 <- 10
[13329]() NASL> [0x56214ac07390 <- 1
[13329]() NASL> [0x56214ac073d0 <- 2
[13329]() NASL> [0x56214ac07410 <- 4
[13329]() NASL> [0x56214ac07450 <- 8
[13329]() NASL> [0x56214ac07490 <- 16
[13329]() NASL> [0x56214ac074d0 <- 32
[13329]() NASL> [0x56214ac07510 <- 32768
[13329]() NASL> [0x56214ac07550 <- 16384
[13329]() NASL> [0x56214ac07590 <- 8192
[13329]() NASL> [0x56214ac075d0 <- 8191
[13329]() NASL> [0x56214ac07610 <- 0
[13329]() NASL> [0x56214ac07650 <- 3
[13329]() NASL> [0x56214ac07690 <- 4
[13329]() NASL> [0x56214ac076d0 <- 5
[13329]() NASL> [0x56214ac07710 <- 6
[13329]() NASL> [0x56214ac07750 <- 7
[13329]() NASL> [0x56214ac07790 <- 1
[13329]() NASL> [0x56214ac077d0 <- 2
[13329]() NASL> [0x56214ac07810 <- 8
[13329]() NASL> [0x56214ac07850 <- 9
[13329]() NASL> [0x56214ac07890 <- 10
[13329]() NASL> [0x56214ac078d0 <- 1
[13329]() NASL> [0x56214ac07910 <- 0
[13329]() NASL> [0x56214ac07950 <- 1
[13329]() NASL> [0x56214ac07990 <- 2
[13329]() NASL> [0x56214ac079d0 <- 3
[13329]() NASL> [0x56214ac07a10 <- 99
[13329]() NASL> [0x56214ac07a50 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_script_oid()
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_script_oid: NULL
[13329]() NASL> [0x56214abffcf0 <- undef
NASL:0327> if (! (nvt)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abffcf0 -> undef
NASL:0325> return NULL;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return register_host_detail: FAKE
NASL:0362> register_host_detail(...)
[13329]() NASL> [0x56214abfece0 <- 1
[13329]() NASL> [0x56214ac00830 <- 0
[13329]() NASL> [0x56214ac00b40 <- 6
[13329]() NASL> [0x56214abfed40 <- 17
[13329]() NASL> [0x56214ac01820 <- 1
[13329]() NASL> [0x56214abfd690 <- 0
[13329]() NASL> [0x56214ab8c9d0 <- 2
[13329]() NASL> [0x56214abfd3a0 <- 0
[13329]() NASL> [0x56214abfe650 <- 1
[13329]() NASL> [0x56214abfef70 <- 2
[13329]() NASL> [0x56214ac01880 <- 3
[13329]() NASL> [0x56214ac011a0 <- 4
[13329]() NASL> [0x56214ac030d0 <- 5
[13329]() NASL> [0x56214abfd8c0 <- 6
[13329]() NASL> [0x56214abff700 <- 7
[13329]() NASL> [0x56214abffc90 <- 9
[13329]() NASL> [0x56214ac00530 <- 10
[13329]() NASL> [0x56214abff4a0 <- 1
[13329]() NASL> [0x56214abff4e0 <- 2
[13329]() NASL> [0x56214abff9d0 <- 4
[13329]() NASL> [0x56214ab8d260 <- 8
[13329]() NASL> [0x56214abffcf0 <- 16
[13329]() NASL> [0x56214ac178f0 <- 32
[13329]() NASL> [0x56214abfd880 <- 32768
[13329]() NASL> [0x56214abfc540 <- 16384
[13329]() NASL> [0x56214ac00240 <- 8192
[13329]() NASL> [0x56214ac05170 <- 8191
[13329]() NASL> [0x56214abff1d0 <- 0
[13329]() NASL> [0x56214abfddc0 <- 3
[13329]() NASL> [0x56214ac00ba0 <- 4
[13329]() NASL> [0x56214abfd6f0 <- 5
[13329]() NASL> [0x56214abffa30 <- 6
[13329]() NASL> [0x56214abfeae0 <- 7
[13329]() NASL> [0x56214ac084d0 <- 1
[13329]() NASL> [0x56214abfcd80 <- 2
[13329]() NASL> [0x56214ac178b0 <- 8
[13329]() NASL> [0x56214abfdff0 <- 9
[13329]() NASL> [0x56214abff460 <- 10
[13329]() NASL> [0x56214ac06ba0 <- 1
[13329]() NASL> [0x56214ac065f0 <- 0
[13329]() NASL> [0x56214aa9a380 <- 1
[13329]() NASL> [0x56214abfd1e0 <- 2
[13329]() NASL> [0x56214abfe890 <- 3
[13329]() NASL> [0x56214ac06ac0 <- 99
[13329]() NASL> [0x56214ac002a0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8dc80 -> "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214abfefd0 <- "cpe:/a:apache:http_server:2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac034b0 -> "80/tcp"
[13329]() NASL> [0x56214ac00890 <- "80/tcp"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call register_host_detail(name: "cpe:/a:apache:http_server:2.2.8", value: "80/tcp")
NASL:0314> local_var ...
NASL:0321> if (! (name)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfefd0 -> "cpe:/a:apache:http_server:2.2.8"
NASL:0323> if (! (value)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00890 -> "80/tcp"
NASL:0323> nvt=get_script_oid(...);
NASL:0323> get_script_oid(...)
[13329]() NASL> [0x56214ac079d0 <- 1
[13329]() NASL> [0x56214ac07990 <- 0
[13329]() NASL> [0x56214ac07a10 <- 6
[13329]() NASL> [0x56214ac07910 <- 17
[13329]() NASL> [0x56214ac07550 <- 1
[13329]() NASL> [0x56214ac07390 <- 0
[13329]() NASL> [0x56214ac07150 <- 2
[13329]() NASL> [0x56214ac07350 <- 0
[13329]() NASL> [0x56214ac07110 <- 1
[13329]() NASL> [0x56214ac070d0 <- 2
[13329]() NASL> [0x56214ab8f2b0 <- 3
[13329]() NASL> [0x56214ac076d0 <- 4
[13329]() NASL> [0x56214ac07050 <- 5
[13329]() NASL> [0x56214ac075d0 <- 6
[13329]() NASL> [0x56214ab8f270 <- 7
[13329]() NASL> [0x56214ac078d0 <- 9
[13329]() NASL> [0x56214ac077d0 <- 10
[13329]() NASL> [0x56214ac07610 <- 1
[13329]() NASL> [0x56214ac07890 <- 2
[13329]() NASL> [0x56214ac07510 <- 4
[13329]() NASL> [0x56214ac07a90 <- 8
[13329]() NASL> [0x56214ac07a50 <- 16
[13329]() NASL> [0x56214ac07950 <- 32
[13329]() NASL> [0x56214ac07850 <- 32768
[13329]() NASL> [0x56214ac07310 <- 16384
[13329]() NASL> [0x56214ac07250 <- 8192
[13329]() NASL> [0x56214ac073d0 <- 8191
[13329]() NASL> [0x56214ac07790 <- 0
[13329]() NASL> [0x56214ac07810 <- 3
[13329]() NASL> [0x56214ac07650 <- 4
[13329]() NASL> [0x56214ac072d0 <- 5
[13329]() NASL> [0x56214ac074d0 <- 6
[13329]() NASL> [0x56214ac07290 <- 7
[13329]() NASL> [0x56214ac07590 <- 1
[13329]() NASL> [0x56214ac07410 <- 2
[13329]() NASL> [0x56214ac07710 <- 8
[13329]() NASL> [0x56214ac07490 <- 9
[13329]() NASL> [0x56214ac07210 <- 10
[13329]() NASL> [0x56214ac07090 <- 1
[13329]() NASL> [0x56214ac07750 <- 0
[13329]() NASL> [0x56214ac07690 <- 1
[13329]() NASL> [0x56214ac07450 <- 2
[13329]() NASL> [0x56214ac071d0 <- 3
[13329]() NASL> [0x56214ac07190 <- 99
[13329]() NASL> [0x56214ac07ad0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_script_oid()
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_script_oid: NULL
[13329]() NASL> [0x56214ac06be0 <- undef
NASL:0327> if (! (nvt)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> undef
NASL:0325> return NULL;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return register_host_detail: FAKE
NASL:0367> if (port) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac03ca0 -> "80"
NASL:0364> register_host_detail(...)
[13329]() NASL> [0x56214abfe890 <- 1
[13329]() NASL> [0x56214abfd1e0 <- 0
[13329]() NASL> [0x56214ac06ac0 <- 6
[13329]() NASL> [0x56214ac065f0 <- 17
[13329]() NASL> [0x56214abfc540 <- 1
[13329]() NASL> [0x56214abff4a0 <- 0
[13329]() NASL> [0x56214abfe650 <- 2
[13329]() NASL> [0x56214abfed40 <- 0
[13329]() NASL> [0x56214ac00530 <- 1
[13329]() NASL> [0x56214abfd3a0 <- 2
[13329]() NASL> [0x56214ab8c9d0 <- 3
[13329]() NASL> [0x56214ac00830 <- 4
[13329]() NASL> [0x56214abfd6f0 <- 5
[13329]() NASL> [0x56214ac01820 <- 6
[13329]() NASL> [0x56214ac05170 <- 7
[13329]() NASL> [0x56214abfece0 <- 9
[13329]() NASL> [0x56214ac00b40 <- 10
[13329]() NASL> [0x56214ac06ba0 <- 1
[13329]() NASL> [0x56214abfcd80 <- 2
[13329]() NASL> [0x56214abff1d0 <- 4
[13329]() NASL> [0x56214ac06be0 <- 8
[13329]() NASL> [0x56214abff460 <- 16
[13329]() NASL> [0x56214abfd880 <- 32
[13329]() NASL> [0x56214ac04110 <- 32768
[13329]() NASL> [0x56214ac002a0 <- 16384
[13329]() NASL> [0x56214aa9a380 <- 8192
[13329]() NASL> [0x56214abfdff0 <- 8191
[13329]() NASL> [0x56214abffc90 <- 0
[13329]() NASL> [0x56214ac030d0 <- 3
[13329]() NASL> [0x56214abfefd0 <- 4
[13329]() NASL> [0x56214abff4e0 <- 5
[13329]() NASL> [0x56214ac084d0 <- 6
[13329]() NASL> [0x56214ac06b00 <- 7
[13329]() NASL> [0x56214ac178b0 <- 1
[13329]() NASL> [0x56214abfddc0 <- 2
[13329]() NASL> [0x56214abff700 <- 8
[13329]() NASL> [0x56214ac178f0 <- 9
[13329]() NASL> [0x56214abfd8c0 <- 10
[13329]() NASL> [0x56214ac00240 <- 1
[13329]() NASL> [0x56214abff9d0 <- 0
[13329]() NASL> [0x56214ac00890 <- 1
[13329]() NASL> [0x56214abffa30 <- 2
[13329]() NASL> [0x56214abffcf0 <- 3
[13329]() NASL> [0x56214ac011a0 <- 99
[13329]() NASL> [0x56214abfd690 <- "1.1.0.0"
[13329]() NASL> [0x56214ac00ba0 <- "port"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac03ca0 -> "80"
[13329]() NASL> [0x56214ab8d260 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call register_host_detail(name: "port", value: "80")
NASL:0314> local_var ...
NASL:0321> if (! (name)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00ba0 -> "port"
NASL:0323> if (! (value)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d260 -> "80"
NASL:0323> nvt=get_script_oid(...);
NASL:0323> get_script_oid(...)
[13329]() NASL> [0x56214ac07450 <- 1
[13329]() NASL> [0x56214ac07190 <- 0
[13329]() NASL> [0x56214ac07750 <- 6
[13329]() NASL> [0x56214ac07310 <- 17
[13329]() NASL> [0x56214ac07610 <- 1
[13329]() NASL> [0x56214ac07110 <- 0
[13329]() NASL> [0x56214ac07910 <- 2
[13329]() NASL> [0x56214ac077d0 <- 0
[13329]() NASL> [0x56214ac07350 <- 1
[13329]() NASL> [0x56214ac07150 <- 2
[13329]() NASL> [0x56214ac07990 <- 3
[13329]() NASL> [0x56214ac072d0 <- 4
[13329]() NASL> [0x56214ac07550 <- 5
[13329]() NASL> [0x56214ac073d0 <- 6
[13329]() NASL> [0x56214ac079d0 <- 7
[13329]() NASL> [0x56214ac07a10 <- 9
[13329]() NASL> [0x56214ac07090 <- 10
[13329]() NASL> [0x56214ac07410 <- 1
[13329]() NASL> [0x56214ac07790 <- 2
[13329]() NASL> [0x56214ac07210 <- 4
[13329]() NASL> [0x56214ac07850 <- 8
[13329]() NASL> [0x56214ac07b10 <- 16
[13329]() NASL> [0x56214ac07ad0 <- 32
[13329]() NASL> [0x56214ac07690 <- 32768
[13329]() NASL> [0x56214ac07490 <- 16384
[13329]() NASL> [0x56214ac078d0 <- 8192
[13329]() NASL> [0x56214ac07050 <- 8191
[13329]() NASL> [0x56214ac07890 <- 0
[13329]() NASL> [0x56214ac07590 <- 3
[13329]() NASL> [0x56214ac07710 <- 4
[13329]() NASL> [0x56214ac07810 <- 5
[13329]() NASL> [0x56214ab8f270 <- 6
[13329]() NASL> [0x56214ac07950 <- 7
[13329]() NASL> [0x56214ac075d0 <- 1
[13329]() NASL> [0x56214ac07250 <- 2
[13329]() NASL> [0x56214ac07510 <- 8
[13329]() NASL> [0x56214ac074d0 <- 9
[13329]() NASL> [0x56214ac07a50 <- 10
[13329]() NASL> [0x56214ac076d0 <- 1
[13329]() NASL> [0x56214ac07390 <- 0
[13329]() NASL> [0x56214ac07290 <- 1
[13329]() NASL> [0x56214ac07650 <- 2
[13329]() NASL> [0x56214ac07a90 <- 3
[13329]() NASL> [0x56214ab8f2b0 <- 99
[13329]() NASL> [0x56214ac070d0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_script_oid()
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_script_oid: NULL
[13329]() NASL> [0x56214abfef70 <- undef
NASL:0327> if (! (nvt)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfef70 -> undef
NASL:0325> return NULL;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return register_host_detail: FAKE
NASL:0372> if (! (base_cpe=get_base_cpe(...))) { ... }
NASL:0367> base_cpe=get_base_cpe(...);
NASL:0367> get_base_cpe(...)
[13329]() NASL> [0x56214ac01880 <- 1
[13329]() NASL> [0x56214abffcf0 <- 0
[13329]() NASL> [0x56214abffa30 <- 6
[13329]() NASL> [0x56214ac011a0 <- 17
[13329]() NASL> [0x56214abff9d0 <- 1
[13329]() NASL> [0x56214ac002a0 <- 0
[13329]() NASL> [0x56214ac06ba0 <- 2
[13329]() NASL> [0x56214ac00530 <- 0
[13329]() NASL> [0x56214ac065f0 <- 1
[13329]() NASL> [0x56214ac00b40 <- 2
[13329]() NASL> [0x56214abfed40 <- 3
[13329]() NASL> [0x56214abfe650 <- 4
[13329]() NASL> [0x56214abfd1e0 <- 5
[13329]() NASL> [0x56214abff4e0 <- 6
[13329]() NASL> [0x56214abfc540 <- 7
[13329]() NASL> [0x56214abfdff0 <- 9
[13329]() NASL> [0x56214abfe890 <- 10
[13329]() NASL> [0x56214ac06ac0 <- 1
[13329]() NASL> [0x56214ac00240 <- 2
[13329]() NASL> [0x56214abfddc0 <- 4
[13329]() NASL> [0x56214abffc90 <- 8
[13329]() NASL> [0x56214abfef70 <- 16
[13329]() NASL> [0x56214abfd8c0 <- 32
[13329]() NASL> [0x56214ac04110 <- 32768
[13329]() NASL> [0x56214abfeae0 <- 16384
[13329]() NASL> [0x56214abfd690 <- 8192
[13329]() NASL> [0x56214ac00890 <- 8191
[13329]() NASL> [0x56214ac178f0 <- 0
[13329]() NASL> [0x56214abfece0 <- 3
[13329]() NASL> [0x56214abfd6f0 <- 4
[13329]() NASL> [0x56214ac00ba0 <- 5
[13329]() NASL> [0x56214abfcd80 <- 6
[13329]() NASL> [0x56214ac178b0 <- 7
[13329]() NASL> [0x56214abfe5f0 <- 1
[13329]() NASL> [0x56214abff700 <- 2
[13329]() NASL> [0x56214ac030d0 <- 8
[13329]() NASL> [0x56214ac05170 <- 9
[13329]() NASL> [0x56214abfd880 <- 10
[13329]() NASL> [0x56214ac01820 <- 1
[13329]() NASL> [0x56214aa9a380 <- 0
[13329]() NASL> [0x56214abff1d0 <- 1
[13329]() NASL> [0x56214ab8d260 <- 2
[13329]() NASL> [0x56214ac084d0 <- 3
[13329]() NASL> [0x56214abff460 <- 99
[13329]() NASL> [0x56214ac00830 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8dc80 -> "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214ac06b00 <- "cpe:/a:apache:http_server:2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_base_cpe(cpe: "cpe:/a:apache:http_server:2.2.8")
NASL:1649> local_var ...
NASL:1654> if (! (cpe)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06b00 -> "cpe:/a:apache:http_server:2.2.8"
NASL:1654> bc=split(...);
NASL:1654> split(...)
[13329]() NASL> [0x56214abfd3a0 <- 1
[13329]() NASL> [0x56214ac071d0 <- 0
[13329]() NASL> [0x56214ac07a90 <- 6
[13329]() NASL> [0x56214ac07650 <- 17
[13329]() NASL> [0x56214ab8f2b0 <- 1
[13329]() NASL> [0x56214ac07390 <- 0
[13329]() NASL> [0x56214ac07490 <- 2
[13329]() NASL> [0x56214ac07410 <- 0
[13329]() NASL> [0x56214ac07350 <- 1
[13329]() NASL> [0x56214ac07310 <- 2
[13329]() NASL> [0x56214ac07090 <- 3
[13329]() NASL> [0x56214ac077d0 <- 4
[13329]() NASL> [0x56214ac07910 <- 5
[13329]() NASL> [0x56214ac07190 <- 6
[13329]() NASL> [0x56214ac07810 <- 7
[13329]() NASL> [0x56214ac07610 <- 9
[13329]() NASL> [0x56214ac07050 <- 10
[13329]() NASL> [0x56214ac07450 <- 1
[13329]() NASL> [0x56214ac07750 <- 2
[13329]() NASL> [0x56214ac076d0 <- 4
[13329]() NASL> [0x56214ac07250 <- 8
[13329]() NASL> [0x56214ac07890 <- 16
[13329]() NASL> [0x56214ac07a50 <- 32
[13329]() NASL> [0x56214ac07690 <- 32768
[13329]() NASL> [0x56214ac07b50 <- 16384
[13329]() NASL> [0x56214ac070d0 <- 8192
[13329]() NASL> [0x56214ac07290 <- 8191
[13329]() NASL> [0x56214ac074d0 <- 0
[13329]() NASL> [0x56214ac07a10 <- 3
[13329]() NASL> [0x56214ac07550 <- 4
[13329]() NASL> [0x56214ac07790 <- 5
[13329]() NASL> [0x56214ac075d0 <- 6
[13329]() NASL> [0x56214ac07510 <- 7
[13329]() NASL> [0x56214ac07590 <- 1
[13329]() NASL> [0x56214ac079d0 <- 2
[13329]() NASL> [0x56214ac07ad0 <- 8
[13329]() NASL> [0x56214ac073d0 <- 9
[13329]() NASL> [0x56214ac078d0 <- 10
[13329]() NASL> [0x56214ac07210 <- 1
[13329]() NASL> [0x56214ab8f270 <- 0
[13329]() NASL> [0x56214ac07b10 <- 1
[13329]() NASL> [0x56214ac072d0 <- 2
[13329]() NASL> [0x56214ac07110 <- 3
[13329]() NASL> [0x56214ac07950 <- 99
[13329]() NASL> [0x56214ac07710 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06b00 -> "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214ac08400 <- "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214ac07150 <- ":"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abffcf0 -> 0
[13329]() NASL> [0x56214ac07990 <- 0
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call split(1: "cpe:/a:apache:http_server:2.2.8", sep: ":", keep: 0)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return split: ???? (DYN_ARRAY (64))
[13329]() NASL> [0x56214abfefd0 <- (VAR2_ARRAY)
NASL:1658> if ((! (bc)) || (max_index(...) < 4)) { ... }
NASL:1655> max_index(...)
[13329]() NASL> [0x56214ac07ca0 <- 1
[13329]() NASL> [0x56214ac07c60 <- 0
[13329]() NASL> [0x56214ab8c9d0 <- 6
[13329]() NASL> [0x56214ac07990 <- 17
[13329]() NASL> [0x56214ac07110 <- 1
[13329]() NASL> [0x56214ac072d0 <- 0
[13329]() NASL> [0x56214ac07950 <- 2
[13329]() NASL> [0x56214ab8f270 <- 0
[13329]() NASL> [0x56214ac07b50 <- 1
[13329]() NASL> [0x56214ac07450 <- 2
[13329]() NASL> [0x56214ac07350 <- 3
[13329]() NASL> [0x56214ac07650 <- 4
[13329]() NASL> [0x56214ac07050 <- 5
[13329]() NASL> [0x56214ac07410 <- 6
[13329]() NASL> [0x56214ac07490 <- 7
[13329]() NASL> [0x56214ac071d0 <- 9
[13329]() NASL> [0x56214ac07790 <- 10
[13329]() NASL> [0x56214ab8f2b0 <- 1
[13329]() NASL> [0x56214ac07290 <- 2
[13329]() NASL> [0x56214abfd3a0 <- 4
[13329]() NASL> [0x56214ac07a90 <- 8
[13329]() NASL> [0x56214ac07210 <- 16
[13329]() NASL> [0x56214ac079d0 <- 32
[13329]() NASL> [0x56214ac074d0 <- 32768
[13329]() NASL> [0x56214ac078d0 <- 16384
[13329]() NASL> [0x56214ac07690 <- 8192
[13329]() NASL> [0x56214ac07850 <- 8191
[13329]() NASL> [0x56214ac07710 <- 0
[13329]() NASL> [0x56214ac07b10 <- 3
[13329]() NASL> [0x56214ac073d0 <- 4
[13329]() NASL> [0x56214ac07610 <- 5
[13329]() NASL> [0x56214ac07910 <- 6
[13329]() NASL> [0x56214ac07750 <- 7
[13329]() NASL> [0x56214ac07590 <- 1
[13329]() NASL> [0x56214ac07ad0 <- 2
[13329]() NASL> [0x56214ac07a10 <- 8
[13329]() NASL> [0x56214ac07810 <- 9
[13329]() NASL> [0x56214ac07a50 <- 10
[13329]() NASL> [0x56214ac07190 <- 1
[13329]() NASL> [0x56214ac070d0 <- 0
[13329]() NASL> [0x56214ac076d0 <- 1
[13329]() NASL> [0x56214ac07150 <- 2
[13329]() NASL> [0x56214ac075d0 <- 3
[13329]() NASL> [0x56214ac07890 <- 99
[13329]() NASL> [0x56214ac077d0 <- "1.1.0.0"
[13329]() NASL> [0x56214ac07be0 <- (VAR2_ARRAY)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call max_index(1: ???? (REF_ARRAY (63)))
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return max_index: 5
NASL:1661> if ((*54*) || (bc[1] !~ FAKE)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06c60 -> "cpe"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac08400 -> "/a"
NASL:1661> base_cpe=((((((bc[0]) + (":")) + (bc[1])) + (":")) + (bc[2])) + (":")) + (bc[3]);
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06c60 -> "cpe"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac08400 -> "/a"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfde20 -> "apache"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac08130 -> "http_server"
[13329]() NASL> [0x56214ac06be0 <- "cpe:/a:apache:http_server"
NASL:1663> return base_cpe;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06be0 -> "cpe:/a:apache:http_server"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_base_cpe: "cpe:/a:apache:http_server"
[13329]() NASL> [0x56214ac03900 <- "cpe:/a:apache:http_server"
NASL:0375> if (! (proto)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d4a0 -> undef
NASL:0373> proto="tcp";
[13329]() NASL> [0x56214ab8d4a0 <- "tcp"
NASL:0378> if (service) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfbc50 -> undef
NASL:0378> kb_e=((((((((get_script_oid(...)) + ("#-#")) + (cpe)) + ("#-#")) + (location)) + ("#-#")) + (port)) + ("#-#")) + (proto);
NASL:0378> get_script_oid(...)
[13329]() NASL> [0x56214abfefd0 <- 1
[13329]() NASL> [0x56214ac084d0 <- 0
[13329]() NASL> [0x56214ab8d260 <- 6
[13329]() NASL> [0x56214abff460 <- 17
[13329]() NASL> [0x56214aa9a380 <- 1
[13329]() NASL> [0x56214abfeae0 <- 0
[13329]() NASL> [0x56214ac06ac0 <- 2
[13329]() NASL> [0x56214ac065f0 <- 0
[13329]() NASL> [0x56214ac011a0 <- 1
[13329]() NASL> [0x56214ac06be0 <- 2
[13329]() NASL> [0x56214abfe890 <- 3
[13329]() NASL> [0x56214ac00530 <- 4
[13329]() NASL> [0x56214ac06ba0 <- 5
[13329]() NASL> [0x56214abffcf0 <- 6
[13329]() NASL> [0x56214ac00ba0 <- 7
[13329]() NASL> [0x56214abff9d0 <- 9
[13329]() NASL> [0x56214ac00890 <- 10
[13329]() NASL> [0x56214ac01880 <- 1
[13329]() NASL> [0x56214abffa30 <- 2
[13329]() NASL> [0x56214ac01820 <- 4
[13329]() NASL> [0x56214abff700 <- 8
[13329]() NASL> [0x56214ac178f0 <- 16
[13329]() NASL> [0x56214abfd880 <- 32
[13329]() NASL> [0x56214ac04110 <- 32768
[13329]() NASL> [0x56214abff4a0 <- 16384
[13329]() NASL> [0x56214ac00830 <- 8192
[13329]() NASL> [0x56214abff1d0 <- 8191
[13329]() NASL> [0x56214ac05170 <- 0
[13329]() NASL> [0x56214abfdff0 <- 3
[13329]() NASL> [0x56214abfd1e0 <- 4
[13329]() NASL> [0x56214ac06b00 <- 5
[13329]() NASL> [0x56214ac00240 <- 6
[13329]() NASL> [0x56214abfe5f0 <- 7
[13329]() NASL> [0x56214ac030d0 <- 1
[13329]() NASL> [0x56214abfece0 <- 2
[13329]() NASL> [0x56214abfc540 <- 8
[13329]() NASL> [0x56214abfd8c0 <- 9
[13329]() NASL> [0x56214abff4e0 <- 10
[13329]() NASL> [0x56214abfd690 <- 1
[13329]() NASL> [0x56214abfddc0 <- 0
[13329]() NASL> [0x56214abfcd80 <- 1
[13329]() NASL> [0x56214abfef70 <- 2
[13329]() NASL> [0x56214abfe650 <- 3
[13329]() NASL> [0x56214ac002a0 <- 99
[13329]() NASL> [0x56214ac178b0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call get_script_oid()
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return get_script_oid: NULL
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8dc80 -> "cpe:/a:apache:http_server:2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac034b0 -> "80/tcp"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac03ca0 -> "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d4a0 -> "tcp"
[13329]() NASL> [0x56214ac01ef0 <- "#-#cpe:/a:apache:http_server:2.2.8#-#80/tcp#-#80#-#tcp"
NASL:0380> set_kb_item(...)
[13329]() NASL> [0x56214ac002a0 <- 1
[13329]() NASL> [0x56214abff4a0 <- 0
[13329]() NASL> [0x56214ab8ef60 <- 6
[13329]() NASL> [0x56214ac06590 <- 17
[13329]() NASL> [0x56214abfef70 <- 1
[13329]() NASL> [0x56214abfe650 <- 0
[13329]() NASL> [0x56214ac01880 <- 2
[13329]() NASL> [0x56214ac011a0 <- 0
[13329]() NASL> [0x56214abff460 <- 1
[13329]() NASL> [0x56214ac00890 <- 2
[13329]() NASL> [0x56214ac065f0 <- 3
[13329]() NASL> [0x56214ac06ac0 <- 4
[13329]() NASL> [0x56214ac084d0 <- 5
[13329]() NASL> [0x56214ac06b00 <- 6
[13329]() NASL> [0x56214aa9a380 <- 7
[13329]() NASL> [0x56214abff1d0 <- 9
[13329]() NASL> [0x56214abfefd0 <- 10
[13329]() NASL> [0x56214ab8d260 <- 1
[13329]() NASL> [0x56214abfd690 <- 2
[13329]() NASL> [0x56214abfece0 <- 4
[13329]() NASL> [0x56214ac05170 <- 8
[13329]() NASL> [0x56214abff4e0 <- 16
[13329]() NASL> [0x56214ac04110 <- 32
[13329]() NASL> [0x56214abfd6f0 <- 32768
[13329]() NASL> [0x56214ac178b0 <- 16384
[13329]() NASL> [0x56214abfcd80 <- 8192
[13329]() NASL> [0x56214abfd8c0 <- 8191
[13329]() NASL> [0x56214abff9d0 <- 0
[13329]() NASL> [0x56214ac06ba0 <- 3
[13329]() NASL> [0x56214abffa30 <- 4
[13329]() NASL> [0x56214ac030d0 <- 5
[13329]() NASL> [0x56214abfc540 <- 6
[13329]() NASL> [0x56214abfdff0 <- 7
[13329]() NASL> [0x56214ac00ba0 <- 1
[13329]() NASL> [0x56214abfd880 <- 2
[13329]() NASL> [0x56214abffcf0 <- 8
[13329]() NASL> [0x56214ac00830 <- 9
[13329]() NASL> [0x56214ac01820 <- 10
[13329]() NASL> [0x56214ac00240 <- 1
[13329]() NASL> [0x56214ac178f0 <- 0
[13329]() NASL> [0x56214ac00530 <- 1
[13329]() NASL> [0x56214abfeae0 <- 2
[13329]() NASL> [0x56214abfe5f0 <- 3
[13329]() NASL> [0x56214abfd1e0 <- 99
[13329]() NASL> [0x56214abff700 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac03900 -> "cpe:/a:apache:http_server"
[13329]() NASL> [0x56214abffc90 <- "get_app/cpe:/a:apache:http_server"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac01ef0 -> "#-#cpe:/a:apache:http_server:2.2.8#-#80/tcp#-#80#-#tcp"
[13329]() NASL> [0x56214ac06be0 <- "#-#cpe:/a:apache:http_server:2.2.8#-#80/tcp#-#80#-#tcp"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call set_kb_item(name: "get_app/cpe:/a:apache:http_server", value: "#-#cpe:/a:apache:http_server:2.2.8#-#80/tcp#-#80#-#tcp")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return set_kb_item: FAKE
NASL:0394> if (! (isnull(...))) { ... }
NASL:0382> isnull(...)
[13329]() NASL> [0x56214abfe5f0 <- 1
[13329]() NASL> [0x56214abfeae0 <- 0
[13329]() NASL> [0x56214abfd1e0 <- 6
[13329]() NASL> [0x56214ac178f0 <- 17
[13329]() NASL> [0x56214ac178b0 <- 1
[13329]() NASL> [0x56214ab8d260 <- 0
[13329]() NASL> [0x56214abff460 <- 2
[13329]() NASL> [0x56214ac06590 <- 0
[13329]() NASL> [0x56214abfefd0 <- 1
[13329]() NASL> [0x56214ac011a0 <- 2
[13329]() NASL> [0x56214ac01880 <- 3
[13329]() NASL> [0x56214abff4a0 <- 4
[13329]() NASL> [0x56214ac030d0 <- 5
[13329]() NASL> [0x56214abfef70 <- 6
[13329]() NASL> [0x56214abfd8c0 <- 7
[13329]() NASL> [0x56214ac002a0 <- 9
[13329]() NASL> [0x56214ab8ef60 <- 10
[13329]() NASL> [0x56214ac00240 <- 1
[13329]() NASL> [0x56214abfd880 <- 2
[13329]() NASL> [0x56214abff9d0 <- 4
[13329]() NASL> [0x56214ac01820 <- 8
[13329]() NASL> [0x56214abfd6f0 <- 16
[13329]() NASL> [0x56214abfe890 <- 32
[13329]() NASL> [0x56214abff700 <- 32768
[13329]() NASL> [0x56214ac00530 <- 16384
[13329]() NASL> [0x56214ac00830 <- 8192
[13329]() NASL> [0x56214abff1d0 <- 8191
[13329]() NASL> [0x56214ac084d0 <- 0
[13329]() NASL> [0x56214abffc90 <- 3
[13329]() NASL> [0x56214abfd690 <- 4
[13329]() NASL> [0x56214ac00ba0 <- 5
[13329]() NASL> [0x56214abffcf0 <- 6
[13329]() NASL> [0x56214ac06ba0 <- 7
[13329]() NASL> [0x56214aa9a380 <- 1
[13329]() NASL> [0x56214ac04110 <- 2
[13329]() NASL> [0x56214ac06b00 <- 8
[13329]() NASL> [0x56214abfcd80 <- 9
[13329]() NASL> [0x56214abfece0 <- 10
[13329]() NASL> [0x56214ac06be0 <- 1
[13329]() NASL> [0x56214ab8c860 <- 0
[13329]() NASL> [0x56214ac176f0 <- 1
[13329]() NASL> [0x56214abfc540 <- 2
[13329]() NASL> [0x56214abff4e0 <- 3
[13329]() NASL> [0x56214ac06ac0 <- 99
[13329]() NASL> [0x56214abfe650 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac03ca0 -> "80"
[13329]() NASL> [0x56214ac07ce0 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call isnull(1: "80")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return isnull: 0
NASL:0387> if (port == 0) { ... } else { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac03ca0 -> "80"
NASL:0386> set_kb_item(...)
[13329]() NASL> [0x56214abff4e0 <- 1
[13329]() NASL> [0x56214ac06ac0 <- 0
[13329]() NASL> [0x56214ab8c860 <- 6
[13329]() NASL> [0x56214ac00530 <- 17
[13329]() NASL> [0x56214ac00240 <- 1
[13329]() NASL> [0x56214abfefd0 <- 0
[13329]() NASL> [0x56214ac178f0 <- 2
[13329]() NASL> [0x56214ab8ef60 <- 0
[13329]() NASL> [0x56214ac06590 <- 1
[13329]() NASL> [0x56214abff460 <- 2
[13329]() NASL> [0x56214abfeae0 <- 3
[13329]() NASL> [0x56214ac00ba0 <- 4
[13329]() NASL> [0x56214ac178b0 <- 5
[13329]() NASL> [0x56214abff1d0 <- 6
[13329]() NASL> [0x56214abfe5f0 <- 7
[13329]() NASL> [0x56214abfd1e0 <- 9
[13329]() NASL> [0x56214ac06be0 <- 10
[13329]() NASL> [0x56214ac04110 <- 1
[13329]() NASL> [0x56214ac084d0 <- 2
[13329]() NASL> [0x56214abfece0 <- 4
[13329]() NASL> [0x56214abff700 <- 8
[13329]() NASL> [0x56214abfdff0 <- 16
[13329]() NASL> [0x56214abfe650 <- 32
[13329]() NASL> [0x56214ac176f0 <- 32768
[13329]() NASL> [0x56214abfcd80 <- 16384
[13329]() NASL> [0x56214ac002a0 <- 8192
[13329]() NASL> [0x56214ac030d0 <- 8191
[13329]() NASL> [0x56214abfd880 <- 0
[13329]() NASL> [0x56214aa9a380 <- 3
[13329]() NASL> [0x56214ac06b00 <- 4
[13329]() NASL> [0x56214abffc90 <- 5
[13329]() NASL> [0x56214abfd8c0 <- 6
[13329]() NASL> [0x56214abfe890 <- 7
[13329]() NASL> [0x56214abfef70 <- 1
[13329]() NASL> [0x56214ac00830 <- 2
[13329]() NASL> [0x56214abff9d0 <- 8
[13329]() NASL> [0x56214abffcf0 <- 9
[13329]() NASL> [0x56214abfd6f0 <- 10
[13329]() NASL> [0x56214abff4a0 <- 1
[13329]() NASL> [0x56214ab8d260 <- 0
[13329]() NASL> [0x56214ac06ba0 <- 1
[13329]() NASL> [0x56214abfd690 <- 2
[13329]() NASL> [0x56214ac01820 <- 3
[13329]() NASL> [0x56214ac01880 <- 99
[13329]() NASL> [0x56214ac011a0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac03900 -> "cpe:/a:apache:http_server"
[13329]() NASL> [0x56214ac00890 <- "get_app/ports/cpe:/a:apache:http_server"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac03ca0 -> "80"
[13329]() NASL> [0x56214ac065f0 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call set_kb_item(name: "get_app/ports/cpe:/a:apache:http_server", value: "80")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return set_kb_item: FAKE
NASL:0389> set_kb_item(...)
[13329]() NASL> [0x56214abfc540 <- 1
[13329]() NASL> [0x56214ac01820 <- 0
[13329]() NASL> [0x56214abfd690 <- 6
[13329]() NASL> [0x56214ac01880 <- 17
[13329]() NASL> [0x56214ab8d260 <- 1
[13329]() NASL> [0x56214abfcd80 <- 0
[13329]() NASL> [0x56214ac04110 <- 2
[13329]() NASL> [0x56214ac06590 <- 0
[13329]() NASL> [0x56214ac00530 <- 1
[13329]() NASL> [0x56214ac06be0 <- 2
[13329]() NASL> [0x56214ab8ef60 <- 3
[13329]() NASL> [0x56214ac178f0 <- 4
[13329]() NASL> [0x56214ac06ac0 <- 5
[13329]() NASL> [0x56214abffc90 <- 6
[13329]() NASL> [0x56214ac00240 <- 7
[13329]() NASL> [0x56214ac030d0 <- 9
[13329]() NASL> [0x56214abff4e0 <- 10
[13329]() NASL> [0x56214ab8c860 <- 1
[13329]() NASL> [0x56214abff4a0 <- 2
[13329]() NASL> [0x56214ac00830 <- 4
[13329]() NASL> [0x56214abfd880 <- 8
[13329]() NASL> [0x56214abfd6f0 <- 16
[13329]() NASL> [0x56214ac176f0 <- 32
[13329]() NASL> [0x56214abffa30 <- 32768
[13329]() NASL> [0x56214ac011a0 <- 16384
[13329]() NASL> [0x56214ac06ba0 <- 8192
[13329]() NASL> [0x56214abffcf0 <- 8191
[13329]() NASL> [0x56214abfd1e0 <- 0
[13329]() NASL> [0x56214ac178b0 <- 3
[13329]() NASL> [0x56214ac00890 <- 4
[13329]() NASL> [0x56214ac084d0 <- 5
[13329]() NASL> [0x56214abfef70 <- 6
[13329]() NASL> [0x56214abff9d0 <- 7
[13329]() NASL> [0x56214aa9a380 <- 1
[13329]() NASL> [0x56214abfe5f0 <- 2
[13329]() NASL> [0x56214abfe650 <- 8
[13329]() NASL> [0x56214abff1d0 <- 9
[13329]() NASL> [0x56214ac002a0 <- 10
[13329]() NASL> [0x56214abfece0 <- 1
[13329]() NASL> [0x56214ac065f0 <- 0
[13329]() NASL> [0x56214abfd8c0 <- 1
[13329]() NASL> [0x56214abfdff0 <- 2
[13329]() NASL> [0x56214ac00ba0 <- 3
[13329]() NASL> [0x56214abfefd0 <- 99
[13329]() NASL> [0x56214abfe890 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac03900 -> "cpe:/a:apache:http_server"
[13329]() NASL> [0x56214abfeae0 <- "get_app/protocols/cpe:/a:apache:http_server"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d4a0 -> "tcp"
[13329]() NASL> [0x56214abff460 <- "tcp"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call set_kb_item(name: "get_app/protocols/cpe:/a:apache:http_server", value: "tcp")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return set_kb_item: FAKE
NASL:0393> if (service) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfbc50 -> undef
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return register_product: FAKE
NASL:0157> log_message(...)
[13329]() NASL> [0x56214ab8e250 <- 1
[13329]() NASL> [0x56214ac02940 <- 0
[13329]() NASL> [0x56214ab8d320 <- 6
[13329]() NASL> [0x56214ac04530 <- 17
[13329]() NASL> [0x56214ac02590 <- 1
[13329]() NASL> [0x56214ab8d740 <- 0
[13329]() NASL> [0x56214ab8d4a0 <- 2
[13329]() NASL> [0x56214ac01b80 <- 0
[13329]() NASL> [0x56214abfd4f0 <- 1
[13329]() NASL> [0x56214ac03900 <- 2
[13329]() NASL> [0x56214ac034b0 <- 3
[13329]() NASL> [0x56214abfd550 <- 4
[13329]() NASL> [0x56214ab8d5c0 <- 5
[13329]() NASL> [0x56214ab8d560 <- 6
[13329]() NASL> [0x56214ab90520 <- 7
[13329]() NASL> [0x56214ac03510 <- 9
[13329]() NASL> [0x56214ab90560 <- 10
[13329]() NASL> [0x56214ab8d8c0 <- 1
[13329]() NASL> [0x56214ac03d00 <- 2
[13329]() NASL> [0x56214ab8cd80 <- 4
[13329]() NASL> [0x56214abfbc50 <- 8
[13329]() NASL> [0x56214ac03ca0 <- 16
[13329]() NASL> [0x56214ac02ce0 <- 32
[13329]() NASL> [0x56214ac04960 <- 32768
[13329]() NASL> [0x56214ac04da0 <- 16384
[13329]() NASL> [0x56214ab904b0 <- 8192
[13329]() NASL> [0x56214ac040b0 <- 8191
[13329]() NASL> [0x56214ab8fdf0 <- 0
[13329]() NASL> [0x56214ab8d440 <- 3
[13329]() NASL> [0x56214abfe830 <- 4
[13329]() NASL> [0x56214ab8fad0 <- 5
[13329]() NASL> [0x56214ab8cd20 <- 6
[13329]() NASL> [0x56214ab8ccc0 <- 7
[13329]() NASL> [0x56214ab8dc80 <- 1
[13329]() NASL> [0x56214ab8d9e0 <- 2
[13329]() NASL> [0x56214ab90af0 <- 8
[13329]() NASL> [0x56214ab8d200 <- 9
[13329]() NASL> [0x56214ac025f0 <- 10
[13329]() NASL> [0x56214ac04d40 <- 1
[13329]() NASL> [0x56214ac01ef0 <- 0
[13329]() NASL> [0x56214abfddc0 <- 1
[13329]() NASL> [0x56214ac17870 <- 2
[13329]() NASL> [0x56214ac044d0 <- 3
[13329]() NASL> [0x56214ab8cea0 <- 99
[13329]() NASL> [0x56214ac01be0 <- "1.1.0.0"
NASL:0156> build_detection_report(...)
[13329]() NASL> [0x56214ac02d20 <- 1
[13329]() NASL> [0x56214ab8eb30 <- 0
[13329]() NASL> [0x56214ab8cf00 <- 6
[13329]() NASL> [0x56214ab8cfc0 <- 17
[13329]() NASL> [0x56214ab8d980 <- 1
[13329]() NASL> [0x56214ab901a0 <- 0
[13329]() NASL> [0x56214ac038a0 <- 2
[13329]() NASL> [0x56214ab8e100 <- 0
[13329]() NASL> [0x56214ac05170 <- 1
[13329]() NASL> [0x56214ac00ba0 <- 2
[13329]() NASL> [0x56214abfdff0 <- 3
[13329]() NASL> [0x56214abfefd0 <- 4
[13329]() NASL> [0x56214ac065f0 <- 5
[13329]() NASL> [0x56214ac011a0 <- 6
[13329]() NASL> [0x56214ab8c860 <- 7
[13329]() NASL> [0x56214ac00530 <- 9
[13329]() NASL> [0x56214ac01880 <- 10
[13329]() NASL> [0x56214abff4e0 <- 1
[13329]() NASL> [0x56214ac06590 <- 2
[13329]() NASL> [0x56214ac04110 <- 4
[13329]() NASL> [0x56214ac01820 <- 8
[13329]() NASL> [0x56214ac084d0 <- 16
[13329]() NASL> [0x56214ab8d260 <- 32
[13329]() NASL> [0x56214abffcf0 <- 32768
[13329]() NASL> [0x56214abfc540 <- 16384
[13329]() NASL> [0x56214abfd690 <- 8192
[13329]() NASL> [0x56214abfece0 <- 8191
[13329]() NASL> [0x56214abfe5f0 <- 0
[13329]() NASL> [0x56214abfd1e0 <- 3
[13329]() NASL> [0x56214ac002a0 <- 4
[13329]() NASL> [0x56214abffa30 <- 5
[13329]() NASL> [0x56214ac06b00 <- 6
[13329]() NASL> [0x56214abfe890 <- 7
[13329]() NASL> [0x56214abfd8c0 <- 1
[13329]() NASL> [0x56214abff1d0 <- 2
[13329]() NASL> [0x56214ac030d0 <- 8
[13329]() NASL> [0x56214ac06ac0 <- 9
[13329]() NASL> [0x56214abfeae0 <- 10
[13329]() NASL> [0x56214ac00b40 <- 1
[13329]() NASL> [0x56214abf3740 <- 0
[13329]() NASL> [0x56214abff4a0 <- 1
[13329]() NASL> [0x56214aa9a380 <- 2
[13329]() NASL> [0x56214abfe650 <- 3
[13329]() NASL> [0x56214ac178b0 <- 99
[13329]() NASL> [0x56214ac00240 <- "1.1.0.0"
[13329]() NASL> [0x56214abffc90 <- "Apache"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8cf60 -> "2.2.8"
[13329]() NASL> [0x56214ac06ba0 <- "2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8d020 -> "80/tcp"
[13329]() NASL> [0x56214ac00830 <- "80/tcp"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfdf90 -> "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214abff460 <- "cpe:/a:apache:http_server:2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfef70 -> undef
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac01170 -> "Server: Apache/2.2.8"
[13329]() NASL> [0x56214ac178f0 <- "Server: Apache/2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call build_detection_report(app: "Apache", version: "2.2.8", install: "80/tcp", cpe: "cpe:/a:apache:http_server:2.2.8", concludedUrl: NULL, concluded: "Server: Apache/2.2.8")
NASL:1683> local_var ...
NASL:1689> if (isnull(...)) { ... }
NASL:1685> isnull(...)
[13329]() NASL> [0x56214ab8ef60 <- 1
[13329]() NASL> [0x56214ac06be0 <- 0
[13329]() NASL> [0x56214ab8d800 <- 6
[13329]() NASL> [0x56214abfed40 <- 17
[13329]() NASL> [0x56214ab8c9d0 <- 1
[13329]() NASL> [0x56214abfcdc0 <- 0
[13329]() NASL> [0x56214abfd220 <- 2
[13329]() NASL> [0x56214ab909c0 <- 0
[13329]() NASL> [0x56214ac06c40 <- 1
[13329]() NASL> [0x56214ab902d0 <- 2
[13329]() NASL> [0x56214abfdf40 <- 3
[13329]() NASL> [0x56214ab8ffb0 <- 4
[13329]() NASL> [0x56214abf3870 <- 5
[13329]() NASL> [0x56214abf38b0 <- 6
[13329]() NASL> [0x56214ac082a0 <- 7
[13329]() NASL> [0x56214ac082e0 <- 9
[13329]() NASL> [0x56214abfdb40 <- 10
[13329]() NASL> [0x56214abfdb80 <- 1
[13329]() NASL> [0x56214abfdbc0 <- 2
[13329]() NASL> [0x56214ac077a0 <- 4
[13329]() NASL> [0x56214ac07800 <- 8
[13329]() NASL> [0x56214ac07860 <- 16
[13329]() NASL> [0x56214ac078c0 <- 32
[13329]() NASL> [0x56214ac07920 <- 32768
[13329]() NASL> [0x56214ac07980 <- 16384
[13329]() NASL> [0x56214ac079e0 <- 8192
[13329]() NASL> [0x56214ac07a40 <- 8191
[13329]() NASL> [0x56214ac07aa0 <- 0
[13329]() NASL> [0x56214ac07b00 <- 3
[13329]() NASL> [0x56214ac07b60 <- 4
[13329]() NASL> [0x56214ac07bc0 <- 5
[13329]() NASL> [0x56214ac07c20 <- 6
[13329]() NASL> [0x56214ac07c80 <- 7
[13329]() NASL> [0x56214ac07ce0 <- 1
[13329]() NASL> [0x56214ac07d40 <- 2
[13329]() NASL> [0x56214ac07da0 <- 8
[13329]() NASL> [0x56214ac07e00 <- 9
[13329]() NASL> [0x56214ac07e60 <- 10
[13329]() NASL> [0x56214ac07ec0 <- 1
[13329]() NASL> [0x56214ac07f20 <- 0
[13329]() NASL> [0x56214ac07f80 <- 1
[13329]() NASL> [0x56214ac07fe0 <- 2
[13329]() NASL> [0x56214ac08040 <- 3
[13329]() NASL> [0x56214ac080a0 <- 99
[13329]() NASL> [0x56214ac08db0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abffc90 -> "Apache"
[13329]() NASL> [0x56214abf3780 <- "Apache"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call isnull(1: "Apache")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return isnull: 0
NASL:1697> if (! (skip_version)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac00890 -> undef
NASL:1693> if (! (version)) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ac06ba0 -> "2.2.8"
NASL:1713> if (strlen(...) > 0) { ... }
NASL:1697> strlen(...)
[13329]() NASL> [0x56214ac08fe0 <- 1
[13329]() NASL> [0x56214ac08040 <- 0
[13329]() NASL> [0x56214ac07fe0 <- 6
[13329]() NASL> [0x56214ac07f20 <- 17
[13329]() NASL> [0x56214ac07980 <- 1
[13329]() NASL> [0x56214abfdb80 <- 0
[13329]() NASL> [0x56214abfed40 <- 2
[13329]() NASL> [0x56214abfdb40 <- 0
[13329]() NASL> [0x56214ac06be0 <- 1
[13329]() NASL> [0x56214ac07bc0 <- 2
[13329]() NASL> [0x56214ab8c9d0 <- 3
[13329]() NASL> [0x56214ac07a40 <- 4
[13329]() NASL> [0x56214ab8ef60 <- 5
[13329]() NASL> [0x56214ab8d800 <- 6
[13329]() NASL> [0x56214ac07ec0 <- 7
[13329]() NASL> [0x56214ac07d40 <- 9
[13329]() NASL> [0x56214ac07aa0 <- 10
[13329]() NASL> [0x56214ac07e60 <- 1
[13329]() NASL> [0x56214ac07920 <- 2
[13329]() NASL> [0x56214ac08e30 <- 4
[13329]() NASL> [0x56214ac08db0 <- 8
[13329]() NASL> [0x56214ac07f80 <- 16
[13329]() NASL> [0x56214ac07e00 <- 32
[13329]() NASL> [0x56214ac082e0 <- 32768
[13329]() NASL> [0x56214abf3870 <- 16384
[13329]() NASL> [0x56214abfdbc0 <- 8192
[13329]() NASL> [0x56214ac07ce0 <- 8191
[13329]() NASL> [0x56214ac07da0 <- 0
[13329]() NASL> [0x56214ac07b00 <- 3
[13329]() NASL> [0x56214ac082a0 <- 4
[13329]() NASL> [0x56214ac078c0 <- 5
[13329]() NASL> [0x56214abf38b0 <- 6
[13329]() NASL> [0x56214ac079e0 <- 7
[13329]() NASL> [0x56214ac077a0 <- 1
[13329]() NASL> [0x56214ac07c20 <- 2
[13329]() NASL> [0x56214ac07860 <- 8
[13329]() NASL> [0x56214ab8ffb0 <- 9
[13329]() NASL> [0x56214ac07c80 <- 10
[13329]() NASL> [0x56214ac07b60 <- 1
[13329]() NASL> [0x56214ac07800 <- 0
[13329]() NASL> [0x56214ac08fa0 <- 1
[13329]() NASL> [0x56214ac08e90 <- 2
[13329]() NASL> [0x56214ac08ed0 <- 3
[13329]() NASL> [0x56214ac08f10 <- 99
[13329]() NASL> [0x56214ac08f50 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abff460 -> "cpe:/a:apache:http_server:2.2.8"
[13329]() NASL> [0x56214abfe3f0 <- "cpe:/a:apache:http_server:2.2.8"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: "cpe:/a:apache:http_server:2.2.8")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 31
NASL:1713> if (strlen(...) > 0) { ... }
NASL:1700> strlen(...)
[13329]() NASL> [0x56214ac08ed0 <- 1
[13329]() NASL> [0x56214ac08e90 <- 0
[13329]() NASL> [0x56214ac08f10 <- 6
[13329]() NASL> [0x56214ac07800 <- 17
[13329]() NASL> [0x56214abf3870 <- 1
[13329]() NASL> [0x56214ac07e60 <- 0
[13329]() NASL> [0x56214ac06be0 <- 2
[13329]() NASL> [0x56214ac07f20 <- 0
[13329]() NASL> [0x56214ac07aa0 <- 1
[13329]() NASL> [0x56214abfdb40 <- 2
[13329]() NASL> [0x56214abfed40 <- 3
[13329]() NASL> [0x56214ac08040 <- 4
[13329]() NASL> [0x56214ac078c0 <- 5
[13329]() NASL> [0x56214ac07980 <- 6
[13329]() NASL> [0x56214ac07ce0 <- 7
[13329]() NASL> [0x56214ac08fe0 <- 9
[13329]() NASL> [0x56214ac07fe0 <- 10
[13329]() NASL> [0x56214ac07b60 <- 1
[13329]() NASL> [0x56214ac07c20 <- 2
[13329]() NASL> [0x56214ac07da0 <- 4
[13329]() NASL> [0x56214ac07c80 <- 8
[13329]() NASL> [0x56214ac082e0 <- 16
[13329]() NASL> [0x56214ac090a0 <- 32
[13329]() NASL> [0x56214ac08fa0 <- 32768
[13329]() NASL> [0x56214ab8ffb0 <- 16384
[13329]() NASL> [0x56214ac07d40 <- 8192
[13329]() NASL> [0x56214ab8ef60 <- 8191
[13329]() NASL> [0x56214ac07920 <- 0
[13329]() NASL> [0x56214ac077a0 <- 3
[13329]() NASL> [0x56214ac07860 <- 4
[13329]() NASL> [0x56214ac07b00 <- 5
[13329]() NASL> [0x56214ac07ec0 <- 6
[13329]() NASL> [0x56214ac07e00 <- 7
[13329]() NASL> [0x56214ab8d800 <- 1
[13329]() NASL> [0x56214abfdbc0 <- 2
[13329]() NASL> [0x56214ac08e30 <- 8
[13329]() NASL> [0x56214abf38b0 <- 9
[13329]() NASL> [0x56214ac07f80 <- 10
[13329]() NASL> [0x56214ac07a40 <- 1
[13329]() NASL> [0x56214abfdb80 <- 0
[13329]() NASL> [0x56214ac079e0 <- 1
[13329]() NASL> [0x56214ac082a0 <- 2
[13329]() NASL> [0x56214ac08db0 <- 3
[13329]() NASL> [0x56214ab8c9d0 <- 99
[13329]() NASL> [0x56214ac07bc0 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfcd80 -> undef
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call strlen(1: NULL)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return strlen: 0
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return build_detection_report: FAKE
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8ce40 -> "80"
[13329]() NASL> [0x56214abfe650 <- "80"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call log_message(data: FAKE, port: "80")
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return log_message: FAKE
NASL:0160> exit(...)
[13329]() NASL> [0x56214ac014d0 <- 1
[13329]() NASL> [0x56214aa9a380 <- 0
[13329]() NASL> [0x56214ac044d0 <- 6
[13329]() NASL> [0x56214ac17870 <- 17
[13329]() NASL> [0x56214ab8cea0 <- 1
[13329]() NASL> [0x56214ac01ef0 <- 0
[13329]() NASL> [0x56214ac04da0 <- 2
[13329]() NASL> [0x56214ab8d8c0 <- 0
[13329]() NASL> [0x56214ac178b0 <- 1
[13329]() NASL> [0x56214abfd4f0 <- 2
[13329]() NASL> [0x56214ac04530 <- 3
[13329]() NASL> [0x56214ab90560 <- 4
[13329]() NASL> [0x56214ac01b80 <- 5
[13329]() NASL> [0x56214ab8d4a0 <- 6
[13329]() NASL> [0x56214ac02940 <- 7
[13329]() NASL> [0x56214ab8fad0 <- 9
[13329]() NASL> [0x56214ac02590 <- 10
[13329]() NASL> [0x56214ac040b0 <- 1
[13329]() NASL> [0x56214ab8e250 <- 2
[13329]() NASL> [0x56214ab8d320 <- 4
[13329]() NASL> [0x56214abfe650 <- 8
[13329]() NASL> [0x56214ac04d40 <- 16
[13329]() NASL> [0x56214ab8d9e0 <- 32
[13329]() NASL> [0x56214ab8fdf0 <- 32768
[13329]() NASL> [0x56214ac025f0 <- 16384
[13329]() NASL> [0x56214ac04960 <- 8192
[13329]() NASL> [0x56214ac029a0 <- 8191
[13329]() NASL> [0x56214ac01be0 <- 0
[13329]() NASL> [0x56214abfddc0 <- 3
[13329]() NASL> [0x56214ab8d200 <- 4
[13329]() NASL> [0x56214ac03510 <- 5
[13329]() NASL> [0x56214ab8d5c0 <- 6
[13329]() NASL> [0x56214ac03d00 <- 7
[13329]() NASL> [0x56214ab8dc80 <- 1
[13329]() NASL> [0x56214abfd880 <- 2
[13329]() NASL> [0x56214ab90af0 <- 8
[13329]() NASL> [0x56214ab8d440 <- 9
[13329]() NASL> [0x56214ab90520 <- 10
[13329]() NASL> [0x56214ac02ce0 <- 1
[13329]() NASL> [0x56214ab8d560 <- 0
[13329]() NASL> [0x56214ab904b0 <- 1
[13329]() NASL> [0x56214ab8cd80 <- 2
[13329]() NASL> [0x56214ab8cd20 <- 3
[13329]() NASL> [0x56214ac03ca0 <- 99
[13329]() NASL> [0x56214abfd550 <- "1.1.0.0"
[13329]() NASL> [0x56214ac08550 <- 0
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call exit(1: 0)
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return exit: 0
[13329]() NASL> [0x56214ab8cd20 <- 1
[13329]() NASL> [0x56214ab8cd80 <- 0
[13329]() NASL> [0x56214ac03ca0 <- 6
[13329]() NASL> [0x56214ab8d560 <- 17
[13329]() NASL> [0x56214ac025f0 <- 1
[13329]() NASL> [0x56214ac040b0 <- 0
[13329]() NASL> [0x56214ac178b0 <- 2
[13329]() NASL> [0x56214ac17870 <- 0
[13329]() NASL> [0x56214ac02590 <- 1
[13329]() NASL> [0x56214ab8d8c0 <- 2
[13329]() NASL> [0x56214ac04da0 <- 3
[13329]() NASL> [0x56214aa9a380 <- 4
[13329]() NASL> [0x56214ac03510 <- 5
[13329]() NASL> [0x56214ab8cea0 <- 6
[13329]() NASL> [0x56214ac029a0 <- 7
[13329]() NASL> [0x56214ac014d0 <- 9
[13329]() NASL> [0x56214ac044d0 <- 10
[13329]() NASL> [0x56214ac02ce0 <- 1
[13329]() NASL> [0x56214abfd880 <- 2
[13329]() NASL> [0x56214ac01be0 <- 4
[13329]() NASL> [0x56214ab90520 <- 8
[13329]() NASL> [0x56214ab8fdf0 <- 16
[13329]() NASL> [0x56214ab8d740 <- 32
[13329]() NASL> [0x56214abfd550 <- 32768
[13329]() NASL> [0x56214ab904b0 <- 16384
[13329]() NASL> [0x56214ab8d440 <- 8192
[13329]() NASL> [0x56214ab8fad0 <- 8191
[13329]() NASL> [0x56214ac01b80 <- 0
[13329]() NASL> [0x56214ab8e250 <- 3
[13329]() NASL> [0x56214ab8dc80 <- 4
[13329]() NASL> [0x56214ab90af0 <- 5
[13329]() NASL> [0x56214abfddc0 <- 6
[13329]() NASL> [0x56214ac02940 <- 7
[13329]() NASL> [0x56214ab8d9e0 <- 1
[13329]() NASL> [0x56214ab8d4a0 <- 2
[13329]() NASL> [0x56214ac04960 <- 8
[13329]() NASL> [0x56214ab8d320 <- 9
[13329]() NASL> [0x56214ab8d5c0 <- 10
[13329]() NASL> [0x56214ac04d40 <- 1
[13329]() NASL> [0x56214ab90560 <- 0
[13329]() NASL> [0x56214ac01ef0 <- 1
[13329]() NASL> [0x56214ac03d00 <- 2
[13329]() NASL> [0x56214ab8d200 <- 3
[13329]() NASL> [0x56214abfe650 <- 99
[13329]() NASL> [0x56214ac04530 <- "1.1.0.0"
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Call on_exit()
NASL:0282> if (__ka_socket) { ... }
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214ab8daa0 -> 0
NASL:0282> return NULL;
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> [0x56214abfd4f0 -> undef
[13329](/usr/local/var/lib/mageni/plugins/secpod_apache_detect.nasl) NASL> Return on_exit: FAKE
